<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html401/loose.dtd">
<html>
<!-- Created on 5月, 20 2015 by texi2html 1.76 -->
<!--
Written by: Lionel Cons <Lionel.Cons@cern.ch> (original author)
            Karl Berry  <karl@freefriends.org>
            Olaf Bachmann <obachman@mathematik.uni-kl.de>
            and many others.
Maintained by: Many creative people <dev@texi2html.cvshome.org>
Send bugs and suggestions to <users@texi2html.cvshome.org>

-->
<head>
<title>Maxima 5.36.1 Manual: 18. Differentiation</title>

<meta name="description" content="Maxima 5.36.1 Manual: 18. Differentiation">
<meta name="keywords" content="Maxima 5.36.1 Manual: 18. Differentiation">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="texi2html 1.76">
<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
pre.display {font-family: serif}
pre.format {font-family: serif}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: serif; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: serif; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.sansserif {font-family:sans-serif; font-weight:normal;}
ul.toc {list-style: none}
body {color: black; background: white;  margin-left: 8%; margin-right: 13%;
      font-family: "FreeSans", sans-serif}
h1 {font-size: 150%; font-family: "FreeSans", sans-serif}
h2 {font-size: 125%; font-family: "FreeSans", sans-serif}
h3 {font-size: 100%; font-family: "FreeSans", sans-serif}
a[href] {color: rgb(0,0,255); text-decoration: none;}
a[href]:hover {background: rgb(220,220,220);}
div.textbox {border: solid; border-width: thin; padding-top: 1em;
    padding-bottom: 1em; padding-left: 2em; padding-right: 2em}
div.titlebox {border: none; padding-top: 1em; padding-bottom: 1em;
    padding-left: 2em; padding-right: 2em; background: rgb(200,255,255);
    font-family: sans-serif}
div.synopsisbox {
    border: none; padding-top: 1em; padding-bottom: 1em; padding-left: 2em;
    padding-right: 2em; background: rgb(255,220,255);}
pre.example {border: 1px solid rgb(180,180,180); padding-top: 1em;
    padding-bottom: 1em; padding-left: 1em; padding-right: 1em;
    background-color: rgb(238,238,255)}
div.spacerbox {border: none; padding-top: 2em; padding-bottom: 2em}
div.image {margin: 0; padding: 1em; text-align: center}
div.categorybox {border: 1px solid gray; padding-top: 0px; padding-bottom: 0px;
    padding-left: 1em; padding-right: 1em; background: rgb(247,242,220)}

-->
</style>

<link rel="icon" href="figures/favicon.ico"/>

<script type="text/javascript"><!--

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-510249-14']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

--></script>
</head>

<body lang="ja" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">

<a name="Differentiation"></a>
<a name="SEC95"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="maxima_17.html#SEC94" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC96" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima_17.html#SEC93" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Up section">上</a>]</td>
<td valign="middle" align="left">[<a href="maxima_19.html#SEC97" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">冒頭</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">目次</a>]</td>
<td valign="middle" align="left">[<a href="maxima_84.html#SEC395" title="Index">見出し</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h1 class="chapter"> 18. Differentiation </h1>

<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC96">18.1 Functions and Variables for Differentiation</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">  
</td></tr>
</table>

<p><a name="Item_003a-Functions-and-Variables-for-Differentiation"></a>
</p><hr size="6">
<a name="Functions-and-Variables-for-Differentiation"></a>
<a name="SEC96"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC95" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_19.html#SEC97" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC95" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC95" title="Up section">上</a>]</td>
<td valign="middle" align="left">[<a href="maxima_19.html#SEC97" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">冒頭</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">目次</a>]</td>
<td valign="middle" align="left">[<a href="maxima_84.html#SEC395" title="Index">見出し</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 18.1 Functions and Variables for Differentiation </h2>

<p><a name="antid"></a>
<a name="Item_003a-antid"></a>
</p><dl>
<dt><u>関数:</u> <b>antid</b><i> (<var>expr</var>, <var>x</var>, <var>u(x)</var>) </i>
<a name="IDX723"></a>
</dt>
<dd><p>２要素リストを返します。
そのリストから <var>expr</var>の <var>x</var>に関する不定積分(antiderivative)が構成できます。
式 <var>expr</var>は未知の関数 <var>u</var>とその導関数を含むかもしれません。
</p>
<p>２要素リスト <var>L</var>が<code>antid</code>の戻り値だとします。
<code><var>L</var>[1] + 'integrate (<var>L</var>[2], <var>x</var>)</code>は
<var>expr</var>の <var>x</var>に関する不定積分です。
</p>
<p><code>antid</code>が完全に成功した時、戻り値の二番目の要素は0です。
そうでないなら、二番目の要素は0ではなく、一番目の要素は0でないか0かです。
もし <code>antid</code>が全く進展できないなら、
一番目の要素が0で、二番目は0ではないです。
</p>
<p><code>load (&quot;antid&quot;)</code>はこの関数をロードします。
<code>antid</code>パッケージは関数 <code>nonzeroandfreeof</code>と <code>linear</code>も定義します。
</p>
<p><code>antid</code>は以下のように <code>antidiff</code>と関係します。
２要素リスト <var>L</var>が <code>antid</code>の戻り値とします。
<code>antidiff</code>の戻り値は
<code><var>L</var>[1] + 'integrate (<var>L</var>[2], <var>x</var>)</code>に等しいです。
ここで <var>x</var>は積分変数です。
</p>
<p>例:
</p>
<pre class="example">(%i1) load (&quot;antid&quot;)$
(%i2) expr: exp (z(x)) * diff (z(x), x) * y(x);
                            z(x)  d
(%o2)                y(x) %e     (-- (z(x)))
                                  dx
(%i3) a1: antid (expr, x, z(x));
                       z(x)      z(x)  d
(%o3)          [y(x) %e    , - %e     (-- (y(x)))]
                                       dx
(%i4) a2: antidiff (expr, x, z(x));
                            /
                     z(x)   [   z(x)  d
(%o4)         y(x) %e     - I %e     (-- (y(x))) dx
                            ]         dx
                            /
(%i5) a2 - (first (a1) + 'integrate (second (a1), x));
(%o5)                           0
(%i6) antid (expr, x, y(x));
                             z(x)  d
(%o6)             [0, y(x) %e     (-- (z(x)))]
                                   dx
(%i7) antidiff (expr, x, y(x));
                  /
                  [        z(x)  d
(%o7)             I y(x) %e     (-- (z(x))) dx
                  ]              dx
                  /
</pre>
<div class=categorybox>

<p>Categories:&nbsp;&nbsp;<a href="maxima_100.html#Category_003a-Integral-calculus">Integral calculus</a>
</div>
</p></dd></dl>

<p><a name="antidiff"></a>
<a name="Item_003a-antidiff"></a>
</p><dl>
<dt><u>関数:</u> <b>antidiff</b><i> (<var>expr</var>, <var>x</var>, <var>u</var>(<var>x</var>))</i>
<a name="IDX724"></a>
</dt>
<dd><p><var>expr</var>の <var>x</var>に関する不定積分(antiderivative)を返します。
式 <var>expr</var>は未知の関数 <var>u</var>とその導関数を含むかもしれません。
</p>
<p><code>antidiff</code>が完全に成功した時、
結果の式は積分記号を含みません(すなわち <code>integrate</code>名詞を含みません)。
そうでないなら、
<code>antidiff</code>は部分的にまたは完全に積分記号内にある式を返します。
もし <code>antidiff</code>が全く進展できないなら、戻り値はそっくり積分記号内にあります。
</p>
<p><code>load (&quot;antid&quot;)</code>はこの関数をロードします。
<code>antid</code>パッケージは関数 <code>nonzeroandfreeof</code>と <code>linear</code>も定義します。
</p>
<p><code>antidiff</code>は以下のように <code>antid</code>と関係します。
２要素リスト <var>L</var>が <code>antid</code>の戻り値とします。
<code>antidiff</code>の戻り値は
<code><var>L</var>[1] + 'integrate (<var>L</var>[2], <var>x</var>)</code>に等しいです。
ここで <var>x</var>は積分変数です。
</p>
<p>例:
</p>
<pre class="example">(%i1) load (&quot;antid&quot;)$
(%i2) expr: exp (z(x)) * diff (z(x), x) * y(x);
                            z(x)  d
(%o2)                y(x) %e     (-- (z(x)))
                                  dx
(%i3) a1: antid (expr, x, z(x));
                       z(x)      z(x)  d
(%o3)          [y(x) %e    , - %e     (-- (y(x)))]
                                       dx
(%i4) a2: antidiff (expr, x, z(x));
                            /
                     z(x)   [   z(x)  d
(%o4)         y(x) %e     - I %e     (-- (y(x))) dx
                            ]         dx
                            /
(%i5) a2 - (first (a1) + 'integrate (second (a1), x));
(%o5)                           0
(%i6) antid (expr, x, y(x));
                             z(x)  d
(%o6)             [0, y(x) %e     (-- (z(x)))]
                                   dx
(%i7) antidiff (expr, x, y(x));
                  /
                  [        z(x)  d
(%o7)             I y(x) %e     (-- (z(x))) dx
                  ]              dx
                  /
</pre>
<div class=categorybox>

<p>Categories:&nbsp;&nbsp;<a href="maxima_100.html#Category_003a-Integral-calculus">Integral calculus</a>
</div>
</p></dd></dl>

<p><a name="at"></a>
<a name="Item_003a-at"></a>
</p><dl>
<dt><u>関数:</u> <b>at</b><i> &nbsp;<br>&nbsp;&nbsp;&nbsp;&nbsp;<tt>at</tt> (<var>expr</var>, [<var>eqn_1</var>, &hellip;, <var>eqn_n</var>]) &nbsp;<br>&nbsp;&nbsp;&nbsp;&nbsp;<tt>at</tt> (<var>expr</var>, <var>eqn</var>)</i>
<a name="IDX725"></a>
</dt>
<dd><p>等式のリスト <code>[<var>eqn_1</var>, ..., <var>eqn_n</var>]</code>
もしくは１つの等式 <var>eqn</var>の中で指定されたように値を仮定された変数を使って
式 <var>expr</var>を評価します。
</p>
<p>もし値が指定される変数のいずれかに部分式が依存するけれど
指定の<code>atvalue</code>がなく他の方法で評価できないなら、
<code>at</code>の名詞形を返し、２次元形式で表示します。
</p>
<p><code>at</code>は多重代入を並列に実行します。
</p>
<p><code>atvalue</code>も参照してください。
代入を実行する他の関数に関しては <code>subst</code>や <code>ev</code>も参照してください。
</p>
<p>例:
</p>
<pre class="example">(%i1) atvalue (f(x,y), [x = 0, y = 1], a^2);
                                2
(%o1)                          a
(%i2) atvalue ('diff (f(x,y), x), x = 0, 1 + y);
(%o2)                        @2 + 1
(%i3) printprops (all, atvalue);
                                !
                  d             !
                 --- (f(@1, @2))!       = @2 + 1
                 d@1            !
                                !@1 = 0

                                     2
                          f(0, 1) = a

(%o3)                         done
(%i4) diff (4*f(x, y)^2 - u(x, y)^2, x);
                  d                          d
(%o4)  8 f(x, y) (-- (f(x, y))) - 2 u(x, y) (-- (u(x, y)))
                  dx                         dx
(%i5) at (%, [x = 0, y = 1]);
                                         !
              2              d           !
(%o5)     16 a  - 2 u(0, 1) (-- (u(x, y))!            )
                             dx          !
                                         !x = 0, y = 1
</pre>
<div class=categorybox>

<p>Categories:&nbsp;&nbsp;<a href="maxima_100.html#Category_003a-Evaluation">Evaluation</a> &middot;
<a href="maxima_100.html#Category_003a-Differential-equations">Differential equations</a>
</div>
</p></dd></dl>


<p><a name="atomgrad"></a>
<a name="Item_003a-atomgrad"></a>
</p><dl>
<dt><u>Property:</u> <b>atomgrad</b>
<a name="IDX726"></a>
</dt>
<dd><p><code>atomgrad</code>は式のアトムの勾配プロパティです。
このプロパティは <code>gradef</code>で割り当てられます。
</p>
<div class=categorybox>

<p>Categories:&nbsp;&nbsp;<a href="maxima_100.html#Category_003a-Differential-calculus">Differential calculus</a>
</div>
</p></dd></dl>

<p><a name="atvalue"></a>
<a name="Item_003a-atvalue"></a>
</p><dl>
<dt><u>関数:</u> <b>atvalue</b><i> &nbsp;<br>&nbsp;&nbsp;&nbsp;&nbsp;<tt>atvalue</tt> (<var>expr</var>, [<var>x_1</var> = <var>a_1</var>, &hellip;, <var>x_m</var> = <var>a_m</var>], <var>c</var>) &nbsp;<br>&nbsp;&nbsp;&nbsp;&nbsp;<tt>atvalue</tt> (<var>expr</var>, <var>x_1</var> = <var>a_1</var>, <var>c</var>)</i>
<a name="IDX727"></a>
</dt>
<dd><p>値 <var>c</var>を点 <code><var>x</var> = <var>a</var></code>の <var>expr</var>に割り当てます。
典型的にはこのメカニズムが境界値を確立します。
</p>
<p><var>expr</var>は関数引数が明示的に現れる関数評価
<code><var>f</var>(<var>x_1</var>, ..., <var>x_m</var>)</code>か導関数
<code>diff (<var>f</var>(<var>x_1</var>, ..., <var>x_m</var>), <var>x_1</var>, <var>n_1</var>, ..., <var>x_n</var>, <var>n_m</var>)</code>
です。
<var>n_i</var>は <var>x_i</var>に関する微分の階数です。
</p>
<p>等式のリスト
<code>[<var>x_1</var> = <var>a_1</var>, ..., <var>x_m</var> = <var>a_m</var>]</code>
はatvalueを確立する点を与えます。
もし１変数 <var>x_1</var>なら、
リストとしてくくることなしに等式１つを与えます。
</p>
<p><code>printprops ([<var>f_1</var>, <var>f_2</var>, ...], atvalue)</code>は
関数 <code><var>f_1</var>, <var>f_2</var>, ...</code>のatvalueを
<code>atvalue</code>コールで指定されたように表示します。
</p>
<p><code>printprops (<var>f</var>, atvalue)</code>は
１関数 <var>f</var>のatvalueを表示します。
<code>printprops (all, atvalue)</code>は
atvaluesが定義された関数すべての atvalueを表示します。
</p>
<p>atvaluesが表示される時、
シンボル <code>@1</code>, <code>@2</code>, &hellip; は
変数 <var>x_1</var>, <var>x_2</var>, &hellip;を表します。
</p>
<p><code>atvalue</code>は引数を評価します。
<code>atvalue</code>は <var>c</var>, atvalueそのものを返します。
</p>
<p>例:
</p>
<pre class="example">(%i1) atvalue (f(x,y), [x = 0, y = 1], a^2);
                                2
(%o1)                          a
(%i2) atvalue ('diff (f(x,y), x), x = 0, 1 + y);
(%o2)                        @2 + 1
(%i3) printprops (all, atvalue);
                                !
                  d             !
                 --- (f(@1, @2))!       = @2 + 1
                 d@1            !
                                !@1 = 0

                                     2
                          f(0, 1) = a

(%o3)                         done
(%i4) diff (4*f(x,y)^2 - u(x,y)^2, x);
                  d                          d
(%o4)  8 f(x, y) (-- (f(x, y))) - 2 u(x, y) (-- (u(x, y)))
                  dx                         dx
(%i5) at (%, [x = 0, y = 1]);
                                         !
              2              d           !
(%o5)     16 a  - 2 u(0, 1) (-- (u(x, y))!            )
                             dx          !
                                         !x = 0, y = 1
</pre>
<div class=categorybox>

<p>Categories:&nbsp;&nbsp;<a href="maxima_100.html#Category_003a-Differential-equations">Differential equations</a> &middot;
<a href="maxima_100.html#Category_003a-Declarations-and-inferences">Declarations and inferences</a>
</div>
</p></dd></dl>


<p><a name="cartan"></a>
<a name="Item_003a-cartan"></a>
</p><dl>
<dt><u>関数:</u> <b>cartan</b>
<a name="IDX728"></a>
</dt>
<dd><p>微分形式の外積代数はエリーカルタンによって開発された微分幾何の基本ツールであり、
偏微分方程式論で有用な応用があります。
<code>cartan</code>パッケージは
演算子 <code>~</code> (ウェッジ積)と <code>|</code> (形式とベクトルの縮約)と合わせて
関数 <code>ext_diff</code>と <code>lie_diff</code>を実装します。
例と一緒にこれらのコマンドの簡潔な記述を見るには <code>demo (tensor)</code>を実行してください。
</p>
<p><code>cartan</code>は F.B. EstabrookとH.D. Wahlquistによって実装されました。
</p>
<div class=categorybox>

<p>Categories:&nbsp;&nbsp;<a href="maxima_100.html#Category_003a-Differential-geometry">Differential geometry</a>
</div>
</p></dd></dl>

<p><a name="del"></a>
<a name="Item_003a-del"></a>
</p><dl>
<dt><u>関数:</u> <b>del</b><i> (<var>x</var>)</i>
<a name="IDX729"></a>
</dt>
<dd><p><code>del (<var>x</var>)</code>は変数 <em>x</em>の微分を表します。
</p>
<p>もし独立変数を指定しないなら、
<code>diff</code>は　<code>del</code>を含む式を返します。
この場合、戻り値は「全微分」と呼ばれるものです。
</p>
<p>例:
</p>
<pre class="example">(%i1) diff (log (x));
                             del(x)
(%o1)                        ------
                               x
(%i2) diff (exp (x*y));
                     x y              x y
(%o2)            x %e    del(y) + y %e    del(x)
(%i3) diff (x*y*z);
(%o3)         x y del(z) + x z del(y) + y z del(x)
</pre>
<div class=categorybox>

<p>Categories:&nbsp;&nbsp;<a href="maxima_100.html#Category_003a-Differential-calculus">Differential calculus</a>
</div>
</p></dd></dl>

<p><a name="delta"></a>
<a name="Item_003a-delta"></a>
</p><dl>
<dt><u>関数:</u> <b>delta</b><i> (<var>t</var>)</i>
<a name="IDX730"></a>
</dt>
<dd><p>Diracのデルタ関数
</p>
<p>今のところ、<code>laplace</code>だけが <code>delta</code>を知っています。
</p>
<p>例:
</p>
<pre class="example">(%i1) laplace (delta (t - a) * sin(b*t), t, s);
Is  a  positive, negative, or zero?

p;
                                   - a s
(%o1)                   sin(a b) %e
</pre>
<div class=categorybox>

<p>Categories:&nbsp;&nbsp;<a href="maxima_100.html#Category_003a-Mathematical-functions">Mathematical functions</a> &middot;
<a href="maxima_100.html#Category_003a-Laplace-transform">Laplace transform</a>
</div>
</p></dd></dl>

<p><a name="dependencies"></a>
<a name="Item_003a-dependencies"></a>
</p><dl>
<dt><u>システム変数:</u> <b>dependencies</b>
<a name="IDX731"></a>
</dt>
<dt><u>関数:</u> <b>dependencies</b><i> (<var>f_1</var>, &hellip;, <var>f_n</var>)</i>
<a name="IDX732"></a>
</dt>
<dd><p>変数 <code>dependencies</code>は、
<code>depends</code>や関数 <code>dependencies</code>, <code>gradef</code>が割り当てた関数依存を持つアトムのリストです。
<code>dependencies</code>リストは累積的です:
<code>depends</code>や <code>dependencies</code>, <code>gradef</code>をコールする毎に上乗せの項目を追加します。
<code>dependencies</code>のデフォルト値は <code>[]</code>です。
</p>
<p>関数 <code>dependencies(<var>f_1</var>, &hellip;, <var>f_n</var>)</code>は <var>f_1</var>, &hellip;, <var>f_n</var>を <code>dependencies</code>リストに追加します。
ここで、 <var>f_1</var>, &hellip;, <var>f_n</var>は形式 <code><var>f</var>(<var>x_1</var>, &hellip;, <var>x_m</var>)</code>の式であり、
<var>x_1</var>, &hellip;, <var>x_m</var>は任意の数の引数です。
</p>
<p><code>dependencies(<var>f</var>(<var>x_1</var>, &hellip;, <var>x_m</var>))</code>は <code>depends(<var>f</var>, [<var>x_1</var>, &hellip;, <var>x_m</var>])</code>と等価です。
</p>
<p><code>depends</code>と <code>gradef</code>を参照してください。
</p>
<pre class="example">(%i1) dependencies;                                
(%o1)                          []
(%i2) depends (foo, [bar, baz]);
(%o2)                    [foo(bar, baz)]
(%i3) depends ([g, h], [a, b, c]);
(%o3)               [g(a, b, c), h(a, b, c)]
(%i4) dependencies;
(%o4)        [foo(bar, baz), g(a, b, c), h(a, b, c)]
(%i5) dependencies (quux (x, y), mumble (u));
(%o5)                [quux(x, y), mumble(u)]
(%i6) dependencies;
(%o6) [foo(bar, baz), g(a, b, c), h(a, b, c), quux(x, y), 
                                                       mumble(u)]
(%i7) remove (quux, dependency);
(%o7)                         done
(%i8) dependencies;
(%o8)  [foo(bar, baz), g(a, b, c), h(a, b, c), mumble(u)]
</pre>
<div class=categorybox>

<p>Categories:&nbsp;&nbsp;<a href="maxima_100.html#Category_003a-Declarations-and-inferences">Declarations and inferences</a> &middot;
<a href="maxima_100.html#Category_003a-Global-variables">Global variables</a>
</div>
</p></dd></dl>

<p><a name="depends"></a>
<a name="Item_003a-depends"></a>
</p><dl>
<dt><u>関数:</u> <b>depends</b><i> (<var>f_1</var>, <var>x_1</var>, ..., <var>f_n</var>, <var>x_n</var>)</i>
<a name="IDX733"></a>
</dt>
<dd><p>導関数を計算するために変数の間の関数依存を宣言します。
宣言された依存関係がないと <code>diff (f, x)</code>の結果はゼロです。
もし <code>depends (f, x)</code>を宣言したら、
<code>diff (f, x)</code>の結果はシンボリックな導関数(すなわち <code>diff</code>名詞)です。
</p>
<p>それぞれの引数 <var>f_1</var>, <var>x_1</var>などは、
変数や配列の名前、または名前のリストをとり得ます。
<var>f_i</var> (多分ただ１つの要素)のすべての要素は、
<var>x_i</var> (多分ただ１つの要素)のすべての要素に依存するように宣言されます。
もしいくつかの <var>f_i</var>が配列名だったり配列名を含むなら、
配列の要素すべては <var>x_i</var>に依存します。
</p>
<p><code>diff</code>は <code>depends</code>が確立した間接的依存関係を認識し、
これらの場合に連鎖規則を適用します。
</p>
<p><code>remove (<var>f</var>, dependency)</code>は
<var>f</var>に関して宣言された依存関係すべてを取り除きます。
</p>
<p><code>depends</code>は確立した依存関係のリストを返します。
依存関係はグローバル変数 <code>dependencies</code>に追加されます。
<code>depends</code>は引数を評価します。
</p>
<p><code>diff</code>は
<code>depends</code>が確立する依存関係を認識する唯一の Maximaコマンドです。
他の関数( <code>integrate</code>, <code>laplace</code>など)は
引数が明示的に示す依存関係だけを認識します。
例えば、<code>integrate</code>は、
<code>integrate (f(x), x)</code>のように陽に表現されないなら
<code>f</code>の <code>x</code>への依存性を認識しません。
</p>
<p><code>depends(<var>f</var>, [<var>x_1</var>, &hellip;, <var>x_n</var>])</code>は <code>dependencies(<var>f</var>(<var>x_1</var>, &hellip;, <var>x_n</var>))</code>と等価です。
</p>
<pre class="example">(%i1) depends ([f, g], x);
(%o1)                     [f(x), g(x)]
(%i2) depends ([r, s], [u, v, w]);
(%o2)               [r(u, v, w), s(u, v, w)]
(%i3) depends (u, t);
(%o3)                        [u(t)]
(%i4) dependencies;
(%o4)      [f(x), g(x), r(u, v, w), s(u, v, w), u(t)]
(%i5) diff (r.s, u);
                         dr           ds
(%o5)                    -- . s + r . --
                         du           du
</pre>
<pre class="example">(%i6) diff (r.s, t);
                      dr du           ds du
(%o6)                 -- -- . s + r . -- --
                      du dt           du dt
</pre>
<pre class="example">(%i7) remove (r, dependency);
(%o7)                         done
(%i8) diff (r.s, t);
                                ds du
(%o8)                       r . -- --
                                du dt
</pre>
<div class=categorybox>

<p>Categories:&nbsp;&nbsp;<a href="maxima_100.html#Category_003a-Differential-calculus">Differential calculus</a> &middot;
<a href="maxima_100.html#Category_003a-Declarations-and-inferences">Declarations and inferences</a>
</div>
</p></dd></dl>

<p><a name="derivabrev"></a>
<a name="Item_003a-derivabbrev"></a>
</p><dl>
<dt><u>オプション変数:</u> <b>derivabbrev</b>
<a name="IDX734"></a>
</dt>
<dd><p>デフォルト値: <code>false</code>
</p>
<p><code>derivabbrev</code>が <code>true</code>の時、
シンボリックな導関数(すなわち <code>diff</code>名詞)が下付き添字として表示されます。
そうでないなら導関数はライプニッツ表記 <code>dy/dx</code>で表示されます。
</p>
<div class=categorybox>

<p>Categories:&nbsp;&nbsp;<a href="maxima_100.html#Category_003a-Differential-calculus">Differential calculus</a> &middot;
<a href="maxima_100.html#Category_003a-Global-flags">Global flags</a>
</div>
</p></dd></dl>


<p><a name="derivdegree"></a>
<a name="Item_003a-derivdegree"></a>
</p><dl>
<dt><u>関数:</u> <b>derivdegree</b><i> (<var>expr</var>, <var>y</var>, <var>x</var>)</i>
<a name="IDX735"></a>
</dt>
<dd><p><var>expr</var>に現れる独立変数 <var>x</var>に関する従属変数 <var>y</var>の微分の最高階数を返します。
</p>
<p>例:
</p>
<pre class="example">(%i1) 'diff (y, x, 2) + 'diff (y, z, 3) + 'diff (y, x) * x^2;
                         3     2
                        d y   d y    2 dy
(%o1)                   --- + --- + x  --
                          3     2      dx
                        dz    dx
(%i2) derivdegree (%, y, x);
(%o2)                           2
</pre>
<div class=categorybox>

<p>Categories:&nbsp;&nbsp;<a href="maxima_100.html#Category_003a-Differential-calculus">Differential calculus</a> &middot;
<a href="maxima_100.html#Category_003a-Expressions">Expressions</a>
</div>
</p></dd></dl>


<p><a name="derivlist"></a>
<a name="Item_003a-derivlist"></a>
</p><dl>
<dt><u>関数:</u> <b>derivlist</b><i> (<var>var_1</var>, &hellip;, <var>var_k</var>)</i>
<a name="IDX736"></a>
</dt>
<dd><p><code>ev</code>コマンド内にて示された変数に関する微分だけを生じさせます。
</p>
<div class=categorybox>

<p>Categories:&nbsp;&nbsp;<a href="maxima_100.html#Category_003a-Differential-calculus">Differential calculus</a> &middot;
<a href="maxima_100.html#Category_003a-Evaluation">Evaluation</a>
</div>
</p></dd></dl>

<p><a name="derivsubst"></a>
<a name="Item_003a-derivsubst"></a>
</p><dl>
<dt><u>オプション変数:</u> <b>derivsubst</b>
<a name="IDX737"></a>
</dt>
<dd><p>デフォルト値: <code>false</code>
</p>
<p><code>derivsubst</code>が <code>true</code>の時、
<code>subst (x, 'diff (y, t), 'diff (y, t, 2))</code>
のような非構文法的代入は <code>'diff (x, t)</code>をもらします。
</p>
<div class=categorybox>

<p>Categories:&nbsp;&nbsp;<a href="maxima_100.html#Category_003a-Differential-calculus">Differential calculus</a> &middot;
<a href="maxima_100.html#Category_003a-Expressions">Expressions</a>
</div>
</p></dd></dl>

<p><a name="diff"></a>
<a name="Item_003a-diff"></a>
</p><dl>
<dt><u>関数:</u> <b>diff</b><i> &nbsp;<br>&nbsp;&nbsp;&nbsp;&nbsp;<tt>diff</tt> (<var>expr</var>, <var>x_1</var>, <var>n_1</var>, &hellip;, <var>x_m</var>, <var>n_m</var>) &nbsp;<br>&nbsp;&nbsp;&nbsp;&nbsp;<tt>diff</tt> (<var>expr</var>, <var>x</var>, <var>n</var>) &nbsp;<br>&nbsp;&nbsp;&nbsp;&nbsp;<tt>diff</tt> (<var>expr</var>, <var>x</var>) &nbsp;<br>&nbsp;&nbsp;&nbsp;&nbsp;<tt>diff</tt> (<var>expr</var>)</i>
<a name="IDX738"></a>
</dt>
<dd><p><var>expr</var>の中のすべての変数の中のいくつかに関する
<var>expr</var>の導関数すなわち微分を返します。
</p>
<p><code>diff (<var>expr</var>, <var>x</var>, <var>n</var>)</code>は
<var>x</var>に関する <var>expr</var>の <var>n</var>階微分を返します。
</p>
<p><code>diff (<var>expr</var>, <var>x_1</var>, <var>n_1</var>, ..., <var>x_m</var>, <var>n_m</var>)</code>は
<var>x_1</var>, ..., <var>x_m</var>に関する <var>expr</var>の偏微分を返します。
これは <code>diff (... (diff (<var>expr</var>, <var>x_m</var>, <var>n_m</var>) ...), <var>x_1</var>, <var>n_1</var>)</code>と同値です。
</p>
<p><code>diff (<var>expr</var>, <var>x</var>)</code>は変数 <var>x</var>に関する
<var>expr</var>の1階微分を返します。
</p>
<p><code>diff (<var>expr</var>)</code>は <var>expr</var>の全微分を返します。
すなわち、それぞれの変数に関する <var>expr</var>の微分に変数それぞれの微分
<code>del</code>を掛けたものの和を返します。
<code>del</code>の更なる整理は提供されません。
</p>
<p>微分方程式を記述する時などいくつかの文脈で <code>diff</code>の名詞形式が要求されます。
これらの場合、 <code>diff</code>は微分が実行される代わりに名詞形式を出力するために
(<code>'diff</code>として)クォートされるかもしれません。
</p>
<p><code>derivabbrev</code>が <code>true</code>の時、導関数は下付き添字として表示されます。
そうでないなら、導関数はライブニツ記法の <code>dy/dx</code>で表示されます。
</p>
<p>例:
</p>
<pre class="example">(%i1) diff (exp (f(x)), x, 2);
                     2
              f(x)  d               f(x)  d         2
(%o1)       %e     (--- (f(x))) + %e     (-- (f(x)))
                      2                   dx
                    dx
(%i2) derivabbrev: true$
(%i3) 'integrate (f(x, y), y, g(x), h(x));
                         h(x)
                        /
                        [
(%o3)                   I     f(x, y) dy
                        ]
                        /
                         g(x)
(%i4) diff (%, x);
       h(x)
      /
      [
(%o4) I     f(x, y)  dy + f(x, h(x)) h(x)  - f(x, g(x)) g(x)
      ]            x                     x                  x
      /
       g(x)
</pre>
<p>テンソルパッケージのために以下の変更が取り込まれています:
</p>
<p>(1) <var>expr</var>の中の任意の添字付きオブジェクトの導関数は
追加された引数として添えられた変数 <var>x_i</var>を持ちます。
そして導関数の添字はすべてソートされます。
</p>
<p>(2) <var>x_i</var>は 1から変数 <code>dimension</code> [デフォルト値: 4]の値までの整数を取ります。
これにより、例えば <code>[x, y, z, t]</code>など座標名のリストして設定されたリスト
<code>coordinates</code>の <var>x_i</var>番目のメンバーに関する微分が実行されます。
もし <code>coordinates</code>がアトムの変数にバインドされているなら、
<var>x_i</var>で下付き添字された変数が、微分の変数として使われます。
これにより、座標名や
<code>X[1]</code>, <code>X[2]</code>, &hellip;のような下付き添字付き名前の配列が使えることになります。
もし <code>coordinates</code>に値が割り当てられていないなら、変数は上の(1)のように扱われます。
</p>
<div class=categorybox>

<p>Categories:&nbsp;&nbsp;<a href="maxima_100.html#Category_003a-Differential-calculus">Differential calculus</a>
</div>
</p></dd></dl>


<p><a name="symbol_005fdiff"></a>
</p>
<dl>
<dt><u>特殊シンボル:</u> <b>diff</b>
<a name="IDX739"></a>
</dt>
<dd><p><code>ev</code>コールで <code>evflag</code>として <code>diff</code>が存在する時、
<code>expr</code>の中で表現されたすべての微分が実行されます。
</p>
</dd></dl>


<p><a name="dscalar"></a>
<a name="Item_003a-dscalar"></a>
</p><dl>
<dt><u>関数:</u> <b>dscalar</b><i> (<var>f</var>)</i>
<a name="IDX740"></a>
</dt>
<dd><p>スカラーのダランベルシアンをスカラー関数 <var>f</var>に適用します。
</p>
<p><code>load (&quot;ctensor&quot;)</code>はこの関数をロードします。
</p>


<div class=categorybox>

<p>Categories:&nbsp;&nbsp;<a href="maxima_100.html#Category_003a-Differential-calculus">Differential calculus</a> &middot;
<a href="maxima_100.html#Category_003a-Package-ctensor">Package ctensor</a>
</div>
</p></dd></dl>

<p><a name="express"></a>
<a name="Item_003a-express"></a>
</p><dl>
<dt><u>関数:</u> <b>express</b><i> (<var>expr</var>)</i>
<a name="IDX741"></a>
</dt>
<dd>
<p>名詞形の微分演算子を偏微分を使った式に展開します。
<code>express</code>は演算子
<code>grad</code>, <code>div</code>, <code>curl</code>, <code>laplacian</code>を認識します。
<code>express</code>は外積 <code>~</code>も展開します。
</p>
<p><code>ev</code>関数コールかコマンドラインに <code>diff</code>を含ませることで、
expressの戻り値の中のシンボリックな導関数(すなわち
<code>diff</code>名詞)を評価することができます。
この文脈では <code>diff</code>は <code>evfun</code>として振る舞います。
</p>
<p><code>load (&quot;vect&quot;)</code>はこの関数をロードします。
</p>
<p>例:
</p>
<pre class="example">(%i1) load (&quot;vect&quot;)$
(%i2) grad (x^2 + y^2 + z^2);
                              2    2    2
(%o2)                  grad (z  + y  + x )
(%i3) express (%);
       d    2    2    2   d    2    2    2   d    2    2    2
(%o3) [-- (z  + y  + x ), -- (z  + y  + x ), -- (z  + y  + x )]
       dx                 dy                 dz
(%i4) ev (%, diff);
(%o4)                    [2 x, 2 y, 2 z]
(%i5) div ([x^2, y^2, z^2]);
                              2   2   2
(%o5)                   div [x , y , z ]
(%i6) express (%);
                   d    2    d    2    d    2
(%o6)              -- (z ) + -- (y ) + -- (x )
                   dz        dy        dx
(%i7) ev (%, diff);
(%o7)                    2 z + 2 y + 2 x
(%i8) curl ([x^2, y^2, z^2]);
                               2   2   2
(%o8)                   curl [x , y , z ]
(%i9) express (%);
       d    2    d    2   d    2    d    2   d    2    d    2
(%o9) [-- (z ) - -- (y ), -- (x ) - -- (z ), -- (y ) - -- (x )]
       dy        dz       dz        dx       dx        dy
(%i10) ev (%, diff);
(%o10)                      [0, 0, 0]
(%i11) laplacian (x^2 * y^2 * z^2);
                                  2  2  2
(%o11)                laplacian (x  y  z )
(%i12) express (%);
         2                2                2
        d     2  2  2    d     2  2  2    d     2  2  2
(%o12)  --- (x  y  z ) + --- (x  y  z ) + --- (x  y  z )
          2                2                2
        dz               dy               dx
(%i13) ev (%, diff);
                      2  2      2  2      2  2
(%o13)             2 y  z  + 2 x  z  + 2 x  y
(%i14) [a, b, c] ~ [x, y, z];
(%o14)                [a, b, c] ~ [x, y, z]
(%i15) express (%);
(%o15)          [b z - c y, c x - a z, a y - b x]
</pre>
<div class=categorybox>

<p>Categories:&nbsp;&nbsp;<a href="maxima_100.html#Category_003a-Differential-calculus">Differential calculus</a> &middot;
<a href="maxima_100.html#Category_003a-Vectors">Vectors</a> &middot;
<a href="maxima_100.html#Category_003a-Operators">Operators</a>
</div>
</p></dd></dl>


<p><a name="gradef"></a>
<a name="Item_003a-gradef"></a>
</p><dl>
<dt><u>関数:</u> <b>gradef</b><i> &nbsp;<br>&nbsp;&nbsp;&nbsp;&nbsp;<tt>gradef</tt> (<var>f</var>(<var>x_1</var>, &hellip;, <var>x_n</var>), <var>g_1</var>, &hellip;, <var>g_m</var>) &nbsp;<br>&nbsp;&nbsp;&nbsp;&nbsp;<tt>gradef</tt> (<var>a</var>, <var>x</var>, <var>expr</var>)</i>
<a name="IDX742"></a>
</dt>
<dd><p>関数 <var>f</var>または変数 <var>a</var>の偏微分（すなわち、勾配の成分）を定義します。
</p>
<p><code>gradef (<var>f</var>(<var>x_1</var>, ..., <var>x_n</var>), <var>g_1</var>, ..., <var>g_m</var>)</code>は
<code>d<var>f</var>/d<var>x_i</var></code>を <var>g_i</var>として定義します。
ここで <var>g_i</var>は式です; <var>g_i</var>は関数コールでもあり得ますが関数名ではありません。
偏微分の数 <var>m</var>は引数の数 <var>n</var>よりも小さいかもしれません。
その場合、微分は <var>x_1</var>から <var>x_m</var>までのみに関して定義されます。
</p>
<p><code>gradef (<var>a</var>, <var>x</var>, <var>expr</var>)</code>は変数 <var>a</var>の
<var>x</var>に関する微分を <var>expr</var>と定義します。
これは (<code>depends (<var>a</var>, <var>x</var>)</code>を介して)
<var>a</var>の <var>x</var>への依存性も確立します。
</p>
<p>最初の引数 <code><var>f</var>(<var>x_1</var>, ..., <var>x_n</var>)</code>または
<var>a</var>はクォートされますが、
残りの引数 <var>g_1</var>, ..., <var>g_m</var>は評価されます。
<code>gradef</code>は偏微分が定義される関数や変数を返します。
</p>
<p><code>gradef</code>は Maximaの組み込み関数の微分を再定義できます。
例えば、<code>gradef (sin(x), sqrt (1 - sin(x)^2))</code>は
<code>sin</code>の微分を再定義します。
</p>
<p><code>gradef</code>は添字付き関数の偏微分を定義できません。
</p>
<p><code>printprops ([<var>f_1</var>, ..., <var>f_n</var>], gradef)</code>は関数
<var>f_1</var>, ..., <var>f_n</var>の偏微分を
<code>gradef</code>で定義されたように表示します。
</p>
<p><code>printprops ([<var>a_n</var>, ..., <var>a_n</var>], atomgrad)</code>は変数
<var>a_n</var>, ..., <var>a_n</var>の偏微分を
<code>gradef</code>で定義されたように表示します。
</p>
<p><code>gradefs</code>は <code>gradef</code>が偏微分を定義した関数のリストです。
<code>gradefs</code>は <code>gradef</code>が偏微分を定義した変数は含みません。
</p>
<p>例えば、関数は明示的は知られていませんが一階微分が知られていて、
高階の微分を得ることが望まれる時、勾配が必要とされます。
</p>
<div class=categorybox>

<p>Categories:&nbsp;&nbsp;<a href="maxima_100.html#Category_003a-Differential-calculus">Differential calculus</a> &middot;
<a href="maxima_100.html#Category_003a-Declarations-and-inferences">Declarations and inferences</a>
</div>
</p></dd></dl>

<p><a name="gradefs"></a>
<a name="Item_003a-gradefs"></a>
</p><dl>
<dt><u>システム変数:</u> <b>gradefs</b>
<a name="IDX743"></a>
</dt>
<dd><p>デフォルト値: <code>[]</code>
</p>
<p><code>gradefs</code>は <code>gradef</code>が偏微分を定義した関数のリストです。
<code>gradefs</code>は <code>gradef</code>が偏微分を定義した変数は含みません。
</p>
<div class=categorybox>

<p>Categories:&nbsp;&nbsp;<a href="maxima_100.html#Category_003a-Differential-calculus">Differential calculus</a> &middot;
<a href="maxima_100.html#Category_003a-Declarations-and-inferences">Declarations and inferences</a>
</div>
</p></dd></dl>

<p><a name="laplace"></a>
<a name="Item_003a-laplace"></a>
</p><dl>
<dt><u>関数:</u> <b>laplace</b><i> (<var>expr</var>, <var>t</var>, <var>s</var>)</i>
<a name="IDX744"></a>
</dt>
<dd><p>変数 <var>t</var>に関するラブラス変換 <var>expr</var>を計算し、パラメータ
<var>s</var>に変換しようとします。
</p>
<p><code>laplace</code>は
<var>expr</var>の中で
<code>derivative</code>, <code>integrate</code>, <code>sum</code>, <code>ilt</code>はもちろん関数
<code>delta</code>, <code>exp</code>, <code>log</code>, <code>sin</code>, <code>cos</code>, <code>sinh</code>,
<code>cosh</code>, <code>erf</code>を認識します。
もし laplaceが変換を見つけられなかったら、
関数 <code>specint</code>をコールします。
<code>specint</code>はベッセル関数
<code>bessel_j</code>, <code>bessel_i</code>, &hellip;のような
特殊関数を含む式のラプラス変換を見つけることができ、
<code>unit_step</code>関数を扱うことができます。
<code>specint</code>も参照してください。
</p>
<p>もし <code>specint</code>も解を見つけられないなら、
名詞 <code>laplace</code>を返します。
</p>
<p><var>expr</var>は従属変数の
<code>atvalue</code>が使われている線形定数係数微分方程式であり得ます。
要求の atvalueは
変換を計算する前でも後でも供給できます。
初期条件をゼロ点で指定しなければいけないので、
もし他に課される境界条件を持つなら
一般解にそれらを課すことができます。
それらに関して一般解を解き、それらの値を代入し返すことによって定数を消去できます。
</p>
<p><code>laplace</code>は、形式
<code>integrate (f(x) * g(t - x), x, 0, t)</code>の畳み込み積分を認識します;
他の種類の畳み込みは認識されません。
</p>
<p>関数関係は <var>expr</var>で明示的に表現しなければいけません;
<code>depends</code>で確立した暗黙の関係は認識されません。
例えば、もし <var>f</var>が <var>x</var>と <var>y</var>に依存するなら、
<code>f (x, y)</code>が <var>expr</var>の中に現れなければいけません。
</p>
<p>逆ラプラス変換 <code>ilt</code>も参照してください。
</p>
<p>例:
</p>
<pre class="example">(%i1) laplace (exp (2*t + a) * sin(t) * t, t, s);
                            a
                          %e  (2 s - 4)
(%o1)                    ---------------
                           2           2
                         (s  - 4 s + 5)
(%i2) laplace ('diff (f (x), x), x, s);
(%o2)             s laplace(f(x), x, s) - f(0)
(%i3) diff (diff (delta (t), t), t);
                          2
                         d
(%o3)                    --- (delta(t))
                           2
                         dt
(%i4) laplace (%, t, s);
                            !
               d            !         2
(%o4)        - -- (delta(t))!      + s  - delta(0) s
               dt           !
                            !t = 0
(%i5) assume(a&gt;0)$
(%i6) laplace(gamma_incomplete(a,t),t,s),gamma_expand:true;
                                              - a - 1
                         gamma(a)   gamma(a) s
(%o6)                    -------- - -----------------
                            s            1     a
                                        (- + 1)
                                         s
(%i7) factor(laplace(gamma_incomplete(1/2,t),t,s));
                                              s + 1
                      sqrt(%pi) (sqrt(s) sqrt(-----) - 1)
                                                s
(%o7)                 -----------------------------------
                                3/2      s + 1
                               s    sqrt(-----)
                                           s
(%i8) assume(exp(%pi*s)&gt;1)$
(%i9) laplace(sum((-1)^n*unit_step(t-n*%pi)*sin(t),n,0,inf),t,s),
         simpsum;
                         %i                         %i
              ------------------------ - ------------------------
                              - %pi s                    - %pi s
              (s + %i) (1 - %e       )   (s - %i) (1 - %e       )
(%o9)         ---------------------------------------------------
                                       2
(%i9) factor(%);
                                      %pi s
                                    %e
(%o9)                   -------------------------------
                                             %pi s
                        (s - %i) (s + %i) (%e      - 1)

</pre>
<div class=categorybox>

<p>Categories:&nbsp;&nbsp;<a href="maxima_100.html#Category_003a-Laplace-transform">Laplace transform</a> &middot;
<a href="maxima_100.html#Category_003a-Differential-equations">Differential equations</a>
</div>
</p></dd></dl>

<p><a name="Item_003a-Integration"></a>
</p><hr size="6">
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC95" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_19.html#SEC97" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">冒頭</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">目次</a>]</td>
<td valign="middle" align="left">[<a href="maxima_84.html#SEC395" title="Index">見出し</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<p>
 <font size="-1">
  この文書は<em>市川 雄二</em>によって<em>5月, 20 2015</em>に<a href="http://texi2html.cvshome.org/"><em>texi2html 1.76</em></a>を用いて生成されました。
 </font>
 <br>

</p>
</body>
</html>
