<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html401/loose.dtd">
<html>
<!-- Created on Janeiro, 9 2015 by texi2html 1.76 -->
<!--
Written by: Lionel Cons <Lionel.Cons@cern.ch> (original author)
            Karl Berry  <karl@freefriends.org>
            Olaf Bachmann <obachman@mathematik.uni-kl.de>
            and many others.
Maintained by: Many creative people <dev@texi2html.cvshome.org>
Send bugs and suggestions to <users@texi2html.cvshome.org>

-->
<head>
<title>Manual do Maxima 5.35.71.g68475e4: 24. Arrays</title>

<meta name="description" content="Manual do Maxima 5.35.71.g68475e4: 24. Arrays">
<meta name="keywords" content="Manual do Maxima 5.35.71.g68475e4: 24. Arrays">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="texi2html 1.76">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
pre.display {font-family: serif}
pre.format {font-family: serif}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: serif; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: serif; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.sansserif {font-family:sans-serif; font-weight:normal;}
ul.toc {list-style: none}
body {color: black; background: white;  margin-left: 8%; margin-right: 13%;
      font-family: "FreeSans", sans-serif}
h1 {font-size: 150%; font-family: "FreeSans", sans-serif}
h2 {font-size: 125%; font-family: "FreeSans", sans-serif}
h3 {font-size: 100%; font-family: "FreeSans", sans-serif}
a[href] {color: rgb(0,0,255); text-decoration: none;}
a[href]:hover {background: rgb(220,220,220);}
div.textbox {border: solid; border-width: thin; padding-top: 1em;
    padding-bottom: 1em; padding-left: 2em; padding-right: 2em}
div.titlebox {border: none; padding-top: 1em; padding-bottom: 1em;
    padding-left: 2em; padding-right: 2em; background: rgb(200,255,255);
    font-family: sans-serif}
div.synopsisbox {
    border: none; padding-top: 1em; padding-bottom: 1em; padding-left: 2em;
    padding-right: 2em; background: rgb(255,220,255);}
pre.example {border: 1px solid rgb(180,180,180); padding-top: 1em;
    padding-bottom: 1em; padding-left: 1em; padding-right: 1em;
    background-color: rgb(238,238,255)}
div.spacerbox {border: none; padding-top: 2em; padding-bottom: 2em}
div.image {margin: 0; padding: 1em; text-align: center}
div.categorybox {border: 1px solid gray; padding-top: 0px; padding-bottom: 0px;
    padding-left: 1em; padding-right: 1em; background: rgb(247,242,220)}

-->
</style>

<link rel="icon" href="../figures/favicon.ico"/>
</head>

<body lang="pt" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">

<a name="Arrays"></a>
<a name="SEC78"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="maxima_23.html#SEC77" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC79" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima_23.html#SEC73" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_25.html#SEC80" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_72.html#SEC272" title="Index">&Iacute;ndice</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h1 class="chapter"> 24. Arrays </h1>

<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC79">24.1 Definições para Arrays</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">  
</td></tr>
</table>

<hr size="6">
<a name="Defini_00e7_00f5es-para-Arrays"></a>
<a name="SEC79"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC78" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_25.html#SEC80" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC78" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC78" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_25.html#SEC80" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_72.html#SEC272" title="Index">&Iacute;ndice</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 24.1 Definições para Arrays </h2>

<dl>
<dt><u>Função:</u> <b>array</b><i> (<var>name</var>, <var>dim_1</var>, ..., <var>dim_n</var>)</i>
<a name="IDX731"></a>
</dt>
<dt><u>Função:</u> <b>array</b><i> (<var>name</var>, <var>type</var>, <var>dim_1</var>, ..., <var>dim_n</var>)</i>
<a name="IDX732"></a>
</dt>
<dt><u>Função:</u> <b>array</b><i> ([<var>nome_1</var>, ..., <var>nome_m</var>], <var>dim_1</var>, ..., <var>dim_n</var>)</i>
<a name="IDX733"></a>
</dt>
<dd><p>Cria um array <em>n</em>-dimensional.  
<em>n</em> pode ser menor ou igual a 5.
Os subscritos para
a <em>i</em>'ésima dimensão são inteiros no intervalo de 0 a <var>dim_i</var>.  
</p>
<p><code>array (<var>name</var>, <var>dim_1</var>, ..., <var>dim_n</var>)</code> cria um array genérico.
</p>
<p><code>array (<var>name</var>, <var>type</var>, <var>dim_1</var>, ..., <var>dim_n</var>)</code> cria
um array, com elementos de um tipo especificado.
<var>type</var> pode ser <code>fixnum</code> para
inteiros de tamanho limitado ou <code>flonum</code> para números em ponto flutuante.
</p>
<p><code>array ([<var>nome_1</var>, ..., <var>nome_m</var>], <var>dim_1</var>, ..., <var>dim_n</var>)</code>
cria <em>m</em> arrays, todos da mesma dimensão.
</p>
<p>Se o utilizador atribui a uma variável subscrita antes de declarar o
array correspondente, um array não declarado é criado.
Arrays não declarados, também conhecidos como array desordenado (porque
o codigo desordenado termina nos subscritos), são mais gerais que arrays
declarados.  O utilizador não declara seu tamanho máximo, e ele cresce
dinamicamente e desordenadamente à medida que são atribuídos valores a mais elementos.  Os
subscritos de um array não declarado não precisam sempre ser números.  Todavia,
excepto para um array um tanto quanto esparso, é provavelmente mais eficiente
declarar isso quando possível que deixar não declarado.  A função <code>array</code>
pode ser usada para transformar um array não declarado em um array
declarado.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>arrayapply</b><i> (<var>A</var>, [<var>i_1</var>, ..., <var>i_n</var>])</i>
<a name="IDX734"></a>
</dt>
<dd><p>Avalia <code><var>A</var> [<var>i_1</var>, ..., <var>i_n</var>]</code>,
quando <var>A</var> for um array e <var>i_1</var>, ..., <var>i_n</var> são inteiros.
</p>
<p>Ela é remanescente de <code>apply</code>, excepto o primeiro argumento que é um array ao invés de uma função.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>arrayinfo</b><i> (<var>A</var>)</i>
<a name="IDX735"></a>
</dt>
<dd><p>Retorna informações sobre o array <var>A</var>.
O argumento <var>A</var> pode ser um array declarado, uma array não declarado ( que sofreu um hash),
uma função de array, ou uma função que possui subscrito.
</p>
<p>Para arrays declarados, <code>arrayinfo</code> retorna uma lista
compreendendo o átomo <code>declared</code>, o n;umero de dimensões, e o tamanho de cada dimensão.
Os elementos do array, ambos associados e não associados, são retornados por <code>listarray</code>.
</p>
<p>Para arrays não declarados (arrays que sofreram um hash),
<code>arrayinfo</code> retorna uma lista compreendendo o átomo <code>hashed</code>, o número de subscritos,
e os subscritos de de todo elemento que tiver um valor.
Os valores são retornados por meio de <code>listarray</code>.
</p>
<p>Para funções de array,
<code>arrayinfo</code> retretorna uma lista compreendendo o átomo <code>hashed</code>, o número de subscritos,
e quaisquer valores de subscritos para os quais exista valores funcionais armazenados.
Os valores funcionais armazenados são retornados através de <code>listarray</code>.
</p>
<p>Para funções que possuem subscritos,
<code>arrayinfo</code> retorna uma lista compreendendo o átomo <code>hashed</code>, o número de subscritos,
e qualquer valores subscritos para os quais existe uma expressões lambda.
As expressões lambda são retornadas por <code>listarray</code>.
</p>
<p>Examples:
</p>
<p><code>arrayinfo</code> e <code>listarray</code> aplicado a um array declarado.
</p>
<pre class="example">(%i1) array (aa, 2, 3);
(%o1)                          aa
(%i2) aa [2, 3] : %pi;
(%o2)                          %pi
(%i3) aa [1, 2] : %e;
(%o3)                          %e
(%i4) arrayinfo (aa);
(%o4)                 [declared, 2, [2, 3]]
(%i5) listarray (aa);
(%o5) [#####, #####, #####, #####, #####, #####, %e, #####, 
                                        #####, #####, #####, %pi]
</pre>
<p><code>arrayinfo</code> e <code>listarray</code> aplicado a um array não declarado (no qual foi aplicado um hash).
</p>
<pre class="example">(%i1) bb [FOO] : (a + b)^2;
                                   2
(%o1)                       (b + a)
(%i2) bb [BAR] : (c - d)^3;
                                   3
(%o2)                       (c - d)
(%i3) arrayinfo (bb);
(%o3)               [hashed, 1, [BAR], [FOO]]
(%i4) listarray (bb);
                              3         2
(%o4)                 [(c - d) , (b + a) ]
</pre>
<p><code>arrayinfo</code> e <code>listarray</code> aplicado a uma função de array.
</p>
<pre class="example">(%i1) cc [x, y] := y / x;
                                     y
(%o1)                      cc     := -
                             x, y    x
(%i2) cc [u, v];
                                v
(%o2)                           -
                                u
(%i3) cc [4, z];
                                z
(%o3)                           -
                                4
(%i4) arrayinfo (cc);
(%o4)              [hashed, 2, [4, z], [u, v]]
(%i5) listarray (cc);
                              z  v
(%o5)                        [-, -]
                              4  u
</pre>
<p><code>arrayinfo</code> e <code>listarray</code> aplicadas a funções com subscritos.
</p>
<pre class="example">(%i1) dd [x] (y) := y ^ x;
                                     x
(%o1)                     dd (y) := y
                            x
(%i2) dd [a + b];
                                    b + a
(%o2)                  lambda([y], y     )
(%i3) dd [v - u];
                                    v - u
(%o3)                  lambda([y], y     )
(%i4) arrayinfo (dd);
(%o4)             [hashed, 1, [b + a], [v - u]]
(%i5) listarray (dd);
                         b + a                v - u
(%o5)      [lambda([y], y     ), lambda([y], y     )]
</pre></dd></dl>

<dl>
<dt><u>Função:</u> <b>arraymake</b><i> (<var>A</var>, [<var>i_1</var>, ..., <var>i_n</var>])</i>
<a name="IDX736"></a>
</dt>
<dd><p>Retorna a expressão <code><var>A</var>[<var>i_1</var>, ..., <var>i_n</var>]</code>.
O resultado é uma referência a um array não avaliado.
</p>
<p><code>arraymake</code> é remanicência de <code>funmake</code>,
excepto o valor retornado é um array de referência não avaliado
ao invés de uma chamada de função não avaliada.
</p>
<p>Exemplos:
</p>
<pre class="example">(%i1) arraymake (A, [1]);
(%o1)                          A
                                1
(%i2) arraymake (A, [k]);
(%o2)                          A
                                k
(%i3) arraymake (A, [i, j, 3]);
(%o3)                       A
                             i, j, 3
(%i4) array (A, fixnum, 10);
(%o4)                           A
(%i5) fillarray (A, makelist (i^2, i, 1, 11));
(%o5)                           A
(%i6) arraymake (A, [5]); 
(%o6)                          A
                                5
(%i7) ''%;
(%o7)                          36
(%i8) L : [a, b, c, d, e];
(%o8)                    [a, b, c, d, e]
(%i9) arraymake ('L, [n]);
(%o9)                          L
                                n
(%i10) ''%, n = 3;
(%o10)                          c
(%i11) A2 : make_array (fixnum, 10);
(%o11)          {Array:  #(0 0 0 0 0 0 0 0 0 0)}
(%i12) fillarray (A2, [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]);
(%o12)          {Array:  #(1 2 3 4 5 6 7 8 9 10)}
(%i13) arraymake ('A2, [8]);
(%o13)                         A2
                                 8
(%i14) ''%;
(%o14)                          9
</pre>
</dd></dl>

<dl>
<dt><u>Variável de sistema:</u> <b>arrays</b>
<a name="IDX737"></a>
</dt>
<dd><p>Valor por omissão: <code>[]</code>
</p>
<p><code>arrays</code> é uma lista dos arrays que tiverem sido alocados.
Essa lista compreende arrays declarados através de <code>array</code>,
arrays desordenados (hashed) construídos através de definição implícita (atribuindo alguma coisa a um elemento de array),
e funções de array definidas por meio de <code>:=</code> e <code>define</code>.
Arrays definidos por meio de <code>make_array</code> não estão incluídos.
</p>
<p>Veja também
<code>array</code>, <code>arrayapply</code>, <code>arrayinfo</code>, <code>arraymake</code>, 
<code>fillarray</code>, <code>listarray</code>, e <code>rearray</code>.
</p>
<p>Exemplos:
</p>
<pre class="example">(%i1) array (aa, 5, 7);
(%o1)                          aa
(%i2) bb [FOO] : (a + b)^2;
                                   2
(%o2)                       (b + a)
(%i3) cc [x] := x/100;
                                   x
(%o3)                      cc  := ---
                             x    100
(%i4) dd : make_array ('any, 7);
(%o4)       {Array:  #(NIL NIL NIL NIL NIL NIL NIL)}
(%i5) arrays;
(%o5)                     [aa, bb, cc]
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>bashindices</b><i> (<var>expr</var>)</i>
<a name="IDX738"></a>
</dt>
<dd><p>Transforma a expressão <var>expr</var> dando a cada
somatório e a cada produto um único índice.  Isso dá a <code>changevar</code> grande
precisão quando se está trabalhando com somatórios e produtos.  A forma do
único índice é <code>j<var>number</var></code>.  A quantidade <var>number</var> é determindad por
referência a <code>gensumnum</code>, que pode ser alterada pelo utilizador.  Por
exemplo, <code>gensumnum:0$</code> reseta isso.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>fillarray</b><i> (<var>A</var>, <var>B</var>)</i>
<a name="IDX739"></a>
</dt>
<dd><p>Preenche o array <var>A</var> com <var>B</var>, que é uma lista ou um array.
</p>
<p>Se um tipo específico for declarado para <var>A</var> no momento de sua criação,
<var>A</var> somente porde ser preenchido com elementos do tipo especificado;
Constitui um erro alguma tentativa feita para copiar um um elemento de um tipo diferente.
</p> 
<p>Se as dimensões dos arrays <var>A</var> e <var>B</var> forem
diferents, <var>A</var> é preenchido no ordem de maior fileira.  Se não existirem elementos
livres em <var>B</var> o último elemento é usado para preencher todo o 
resto de <var>A</var>.  Se existirem muitos , esses restantes seram ignorados.
</p>
<p><code>fillarray</code> retorna esse primeiro argumento.
</p>
<p>Exemplos:
</p>
<p>Create an array of 9 elements and fill it from a list.
</p>
<pre class="example">(%i1) array (a1, fixnum, 8);
(%o1)                          a1
(%i2) listarray (a1);
(%o2)              [0, 0, 0, 0, 0, 0, 0, 0, 0]
(%i3) fillarray (a1, [1, 2, 3, 4, 5, 6, 7, 8, 9]);
(%o3)                          a1
(%i4) listarray (a1);
(%o4)              [1, 2, 3, 4, 5, 6, 7, 8, 9]
</pre>
<p>Quando existirem poucos elementos para preencher o array,
o último elemento é repetido.
Quando houverem muitos elementos,
os elementos extras são ignorados.
</p>
<pre class="example">(%i1) a2 : make_array (fixnum, 8);
(%o1)             {Array:  #(0 0 0 0 0 0 0 0)}
(%i2) fillarray (a2, [1, 2, 3, 4, 5]);
(%o2)             {Array:  #(1 2 3 4 5 5 5 5)}
(%i3) fillarray (a2, [4]);
(%o3)             {Array:  #(4 4 4 4 4 4 4 4)}
(%i4) fillarray (a2, makelist (i, i, 1, 100));
(%o4)             {Array:  #(1 2 3 4 5 6 7 8)}
</pre>
<p>Arrays multi-dimensionais são preenchidos em ordem de maior fileira.
</p>
<pre class="example">(%i1) a3 : make_array (fixnum, 2, 5);
(%o1)        {Array:  #2A((0 0 0 0 0) (0 0 0 0 0))}
(%i2) fillarray (a3, [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]);
(%o2)        {Array:  #2A((1 2 3 4 5) (6 7 8 9 10))}
(%i3) a4 : make_array (fixnum, 5, 2);
(%o3)     {Array:  #2A((0 0) (0 0) (0 0) (0 0) (0 0))}
(%i4) fillarray (a4, a3);
(%o4)     {Array:  #2A((1 2) (3 4) (5 6) (7 8) (9 10))}
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>listarray</b><i> (<var>A</var>)</i>
<a name="IDX740"></a>
</dt>
<dd><p>Retorna uma lista dos elementos do array <var>A</var>.
O argumento <var>A</var> pode ser um array declarado, um array não declarado (desordenado - hashed),
uma função de array, ou uma função com subscritos.
</p>
<p>Elementos são listados em ordem de linha maior.
Isto é, elementos são ordenados conforme o primeiro índice, en seguida conforme o segundo índice, e assim sucessivamente.
A sequuência de ordenação por meio dos valores dos índices é a mesma ordem estabelecida por meio de <code>orderless</code>.
</p>
<p>Para arrays não declarados , funções de arrays, e funções com subscritos,
os elementos correspondem aos valores de índice retornados através de <code>arrayinfo</code>.
</p>
<p>Elemetos não associados de arrays genéricos declarados (isto é, não <code>fixnum</code> e não <code>flonum</code>)
são retornados como <code>#####</code>.
Elementos não associados de arrays declarados <code>fixnum</code> ou <code>flonum</code>
são retornados como 0 ou 0.0, respectivamente.
Elementos não associados de arrays não declarados, funções de array,
e funções subscritas não são retornados.
</p>
<p>Exemplos:
</p>
<p><code>listarray</code> e <code>arrayinfo</code> aplicados a um array declarado.
</p>
<pre class="example">(%i1) array (aa, 2, 3);
(%o1)                          aa
(%i2) aa [2, 3] : %pi;
(%o2)                          %pi
(%i3) aa [1, 2] : %e;
(%o3)                          %e
(%i4) listarray (aa);
(%o4) [#####, #####, #####, #####, #####, #####, %e, #####, 
                                        #####, #####, #####, %pi]
(%i5) arrayinfo (aa);
(%o5)                 [declared, 2, [2, 3]]
</pre>
<p><code>listarray</code> e <code>arrayinfo</code> aplicadas a arrays não declarados (hashed - desordenados).
</p>
<pre class="example">(%i1) bb [FOO] : (a + b)^2;
                                   2
(%o1)                       (b + a)
(%i2) bb [BAR] : (c - d)^3;
                                   3
(%o2)                       (c - d)
(%i3) listarray (bb);
                              3         2
(%o3)                 [(c - d) , (b + a) ]
(%i4) arrayinfo (bb);
(%o4)               [hashed, 1, [BAR], [FOO]]
</pre>
<p><code>listarray</code> e <code>arrayinfo</code> aplicada a uma função de array.
</p>
<pre class="example">(%i1) cc [x, y] := y / x;
                                     y
(%o1)                      cc     := -
                             x, y    x
(%i2) cc [u, v];
                                v
(%o2)                           -
                                u
(%i3) cc [4, z];
                                z
(%o3)                           -
                                4
(%i4) listarray (cc);
                              z  v
(%o4)                        [-, -]
                              4  u
(%i5) arrayinfo (cc);
(%o5)              [hashed, 2, [4, z], [u, v]]
</pre>
<p><code>listarray</code> e <code>arrayinfo</code> aplicadas a funções com subscritos.
</p>
<pre class="example">(%i1) dd [x] (y) := y ^ x;
                                     x
(%o1)                     dd (y) := y
                            x
(%i2) dd [a + b];
                                    b + a
(%o2)                  lambda([y], y     )
(%i3) dd [v - u];
                                    v - u
(%o3)                  lambda([y], y     )
(%i4) listarray (dd);
                         b + a                v - u
(%o4)      [lambda([y], y     ), lambda([y], y     )]
(%i5) arrayinfo (dd);
(%o5)             [hashed, 1, [b + a], [v - u]]
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>make_array</b><i> (<var>type</var>, <var>dim_1</var>, ..., <var>dim_n</var>)</i>
<a name="IDX741"></a>
</dt>
<dd><p>Cria e retorna um array de Lisp.  <var>type</var> pode
ser <code>any</code>, <code>flonum</code>, <code>fixnum</code>, <code>hashed</code> ou
<code>functional</code>.
Existem <em>n</em> indices,
e o <em>i</em>'enésimo indice está no intervalo de 0 a <em><var>dim_i</var> - 1</em>.
</p>
<p>A vantagem de <code>make_array</code> sobre <code>array</code> é que o valor de retorno não tem 
um nome, e uma vez que um ponteiro a ele vai, ele irá também.
Por exemplo, se <code>y: make_array (...)</code> então <code>y</code> aponta para um objecto 
que ocupa espaço, mas depois de <code>y: false</code>, <code>y</code> não mais
aponta para aquele objecto, então o objecto pode ser descartado.  
</p>

<p>Exemplos:
</p>
<pre class="example">(%i1) A1 : make_array (fixnum, 10);
(%o1)           {Array:  #(0 0 0 0 0 0 0 0 0 0)}
(%i2) A1 [8] : 1729;
(%o2)                         1729
(%i3) A1;
(%o3)          {Array:  #(0 0 0 0 0 0 0 0 1729 0)}
(%i4) A2 : make_array (flonum, 10);
(%o4) {Array:  #(0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0)}
(%i5) A2 [2] : 2.718281828;
(%o5)                      2.718281828
(%i6) A2;
(%o6) 
     {Array:  #(0.0 0.0 2.718281828 0.0 0.0 0.0 0.0 0.0 0.0 0.0)}
(%i7) A3 : make_array (any, 10);
(%o7) {Array:  #(NIL NIL NIL NIL NIL NIL NIL NIL NIL NIL)}
(%i8) A3 [4] : x - y - z;
(%o8)                      - z - y + x
(%i9) A3;
(%o9) {Array:  #(NIL NIL NIL NIL ((MPLUS SIMP) $X ((MTIMES SIMP)\
 -1 $Y) ((MTIMES SIMP) -1 $Z))
  NIL NIL NIL NIL NIL)}
(%i10) A4 : make_array (fixnum, 2, 3, 5);
(%o10) {Array:  #3A(((0 0 0 0 0) (0 0 0 0 0) (0 0 0 0 0)) ((0 0 \
0 0 0) (0 0 0 0 0) (0 0 0 0 0)))}
(%i11) fillarray (A4, makelist (i, i, 1, 2*3*5));
(%o11) {Array:  #3A(((1 2 3 4 5) (6 7 8 9 10) (11 12 13 14 15))
    ((16 17 18 19 20) (21 22 23 24 25) (26 27 28 29 30)))}
(%i12) A4 [0, 2, 1];
(%o12)                         12
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>rearray</b><i> (<var>A</var>, <var>dim_1</var>, ..., <var>dim_n</var>)</i>
<a name="IDX742"></a>
</dt>
<dd><p>Altera as dimenções de um array.  
O novo array será preenchido com os elementos do antigo em
ordem da maior linha.  Se o array antigo era muito pequeno, 
os elementos restantes serão preenchidos com
<code>false</code>, <code>0.0</code> ou <code>0</code>,
dependendo do tipo do array.  O tipo do array não pode ser
alterado.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>remarray</b><i> (<var>A_1</var>, ..., <var>A_n</var>)</i>
<a name="IDX743"></a>
</dt>
<dt><u>Função:</u> <b>remarray</b><i> (all)</i>
<a name="IDX744"></a>
</dt>
<dd><p>Remove arrays e funções associadas
a arrays e libera o espaço ocupado.
Os argumentos podem ser arrays declarados, arrays não declarados (dsordenados - hashed), funções de array functions, e funções com subscritos.
</p>
<p><code>remarray (all)</code> remove todos os ítens na lista global <code>arrays</code>.
</p>
<p>Isso pode ser necessário para usar essa função se isso é
desejado para redefinir os valores em um array desordenado.
</p>
<p><code>remarray</code> retorna a lista dos arrays removidos.
</p>
</dd></dl>
<dl>
<dt><u>Função:</u> <b>subvar</b><i> (<var>x</var>, <var>i</var>)</i>
<a name="IDX745"></a>
</dt>
<dd><p>Avalia a expressão subscrita <code><var>x</var>[<var>i</var>]</code>.
</p>
<p><code>subvar</code> avalia seus argumentos.
</p>
<p><code>arraymake (<var>x</var>, [<var>i</var>]</code> constrói a expressão <code><var>x</var>[<var>i</var>]</code>,
mas não a avalia.
</p>
<p>Exemplos:
</p>
<pre class="example">(%i1) x : foo $
(%i2) i : 3 $
(%i3) subvar (x, i);
(%o3)                         foo
                                 3
(%i4) foo : [aa, bb, cc, dd, ee]$
(%i5) subvar (x, i);
(%o5)                          cc
(%i6) arraymake (x, [i]);
(%o6)                         foo
                                 3
(%i7) ''%;
(%o7)                          cc
</pre>
</dd></dl>

<dl>
<dt><u>Variável de pção:</u> <b>use_fast_arrays</b>
<a name="IDX746"></a>
</dt>
<dd><p>- Se <code>true</code> somente dois tipos de arrays são reconhecidos.  
</p>
<p>1) O array art-q (t no Lisp Comum) que pode ter muitas dimensões
indexadas por inteiros, e pode aceitar qualquer objecto do Lisp ou do Maxima como uma
entrada.  Para construir assim um array, insira <code>a:make_array(any,3,4);</code> 
então <code>a</code> terá como valor, um array com doze posições, e o 
índice é baseado em zero.
</p>
<p>2) O array Hash_table que é o tipo padrão de array criado se um
faz <code>b[x+1]:y^2</code> (e <code>b</code> não é ainda um array, uma lista, ou uma
matriz - se isso ou um desses ocorrer um erro pode ser causado desde
<code>x+1</code> não poderá ser um subscrito válido para um array art-q, uma lista ou
uma matriz).  Esses índices (também conhecidos como chaves) podem ser quaisquer objectos.  
Isso somente pega uma chave por vez a cada vez (<code>b[x+1,u]:y</code> ignorará o <code>u</code>).  
A referência termina em <code>b[x+1] ==&gt; y^2</code>.  Certamente a chave poe ser uma lista
, e.g.  <code>b[[x+1,u]]:y</code> poderá ser válido.  Isso é incompatível 
com os arrays antigos do Maxima, mas poupa recursos.
</p>
<p>Uma vantagem de armazenar os arrays como valores de símbolos é que as
convenções usuais sobre variáveis locais de uma função aplicam-se a arrays
também.  O tipo Hash_table também usa menos recursos e é mais eficiente
que o velho tipo hashar do Maxima.  Para obter comportamento consistente em
códigos traduzidos e compilados posicione <code>translate_fast_arrays</code> para ser
<code>true</code>.
</p> 
</dd></dl>


<hr size="6">
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC78" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_25.html#SEC80" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_72.html#SEC272" title="Index">&Iacute;ndice</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<p>
 <font size="-1">
  This document was generated by <em>Robert Dodier</em> on <em>Janeiro, 9 2015</em> using <a href="http://texi2html.cvshome.org/"><em>texi2html 1.76</em></a>.
 </font>
 <br>

</p>
</body>
</html>
