<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html401/loose.dtd">
<html>
<!-- Created on Janeiro, 9 2015 by texi2html 1.76 -->
<!--
Written by: Lionel Cons <Lionel.Cons@cern.ch> (original author)
            Karl Berry  <karl@freefriends.org>
            Olaf Bachmann <obachman@mathematik.uni-kl.de>
            and many others.
Maintained by: Many creative people <dev@texi2html.cvshome.org>
Send bugs and suggestions to <users@texi2html.cvshome.org>

-->
<head>
<title>Manual do Maxima 5.35.71.g68475e4: 19. Diferenciação</title>

<meta name="description" content="Manual do Maxima 5.35.71.g68475e4: 19. Diferenciação">
<meta name="keywords" content="Manual do Maxima 5.35.71.g68475e4: 19. Diferenciação">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="texi2html 1.76">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
pre.display {font-family: serif}
pre.format {font-family: serif}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: serif; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: serif; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.sansserif {font-family:sans-serif; font-weight:normal;}
ul.toc {list-style: none}
body {color: black; background: white;  margin-left: 8%; margin-right: 13%;
      font-family: "FreeSans", sans-serif}
h1 {font-size: 150%; font-family: "FreeSans", sans-serif}
h2 {font-size: 125%; font-family: "FreeSans", sans-serif}
h3 {font-size: 100%; font-family: "FreeSans", sans-serif}
a[href] {color: rgb(0,0,255); text-decoration: none;}
a[href]:hover {background: rgb(220,220,220);}
div.textbox {border: solid; border-width: thin; padding-top: 1em;
    padding-bottom: 1em; padding-left: 2em; padding-right: 2em}
div.titlebox {border: none; padding-top: 1em; padding-bottom: 1em;
    padding-left: 2em; padding-right: 2em; background: rgb(200,255,255);
    font-family: sans-serif}
div.synopsisbox {
    border: none; padding-top: 1em; padding-bottom: 1em; padding-left: 2em;
    padding-right: 2em; background: rgb(255,220,255);}
pre.example {border: 1px solid rgb(180,180,180); padding-top: 1em;
    padding-bottom: 1em; padding-left: 1em; padding-right: 1em;
    background-color: rgb(238,238,255)}
div.spacerbox {border: none; padding-top: 2em; padding-bottom: 2em}
div.image {margin: 0; padding: 1em; text-align: center}
div.categorybox {border: 1px solid gray; padding-top: 0px; padding-bottom: 0px;
    padding-left: 1em; padding-right: 1em; background: rgb(247,242,220)}

-->
</style>

<link rel="icon" href="../figures/favicon.ico"/>
</head>

<body lang="pt" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">

<a name="Diferencia_00e7_00e3o"></a>
<a name="SEC60"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="maxima_18.html#SEC59" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC61" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima_18.html#SEC58" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_20.html#SEC62" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_72.html#SEC272" title="Index">&Iacute;ndice</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h1 class="chapter"> 19. Diferenciação </h1>

<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC61">19.1 Definições para Diferenciação</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">  
</td></tr>
</table>

<hr size="6">
<a name="Defini_00e7_00f5es-para-Diferencia_00e7_00e3o"></a>
<a name="SEC61"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC60" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_20.html#SEC62" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC60" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC60" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_20.html#SEC62" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_72.html#SEC272" title="Index">&Iacute;ndice</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 19.1 Definições para Diferenciação </h2>

<dl>
<dt><u>Função:</u> <b>antid</b><i> (<var>expr</var>, <var>x</var>, <var>u(x)</var>) </i>
<a name="IDX592"></a>
</dt>
<dd><p>Retorna uma lista de dois elementos,
tais que uma antiderivada de <var>expr</var> com relação a <var>x</var>
pode ser constuída a partir da lista.
A expressão <var>expr</var> pode conter uma função desconhecida <var>u</var> e suas derivadas.
</p>
<p>Tome <var>L</var>, uma lista de dois elementos, como sendo o valor de retorno de <code>antid</code>.
Então <code><var>L</var>[1] + 'integrate (<var>L</var>[2], <var>x</var>)</code>
é uma antiderivada de <var>expr</var> com relação a <var>x</var>.
</p>
<p>Quando <code>antid</code> obtém sucesso inteiramente,
o segundo elemento do valor de retorno é zero.
De outra forma, o segundo elemento é não zero,
e o primeiro elemento não zero ou zero.
Se <code>antid</code> não pode fazer nenhum progresso,
o primeiro elemento é zero e o segundo não zero.
</p>
<p><code>load (&quot;antid&quot;)</code> chama essa função.
O pacote <code>antid</code> também define as funções <code>nonzeroandfreeof</code> e <code>linear</code>.
</p>
<p><code>antid</code> está relacionada a <code>antidiff</code> como segue.
Tome <var>L</var>, uma lista de dois elementos, que é o valor de retorno de <code>antid</code>.
Então o valor de retorno de <code>antidiff</code> é igual a <code><var>L</var>[1] + 'integrate (<var>L</var>[2], <var>x</var>)</code>
onde <var>x</var> é a variável de integração.
</p>
<p>Exemplos:
</p>
<pre class="example">(%i1) load (&quot;antid&quot;)$
(%i2) expr: exp (z(x)) * diff (z(x), x) * y(x);
                            z(x)  d
(%o2)                y(x) %e     (-- (z(x)))
                                  dx
(%i3) a1: antid (expr, x, z(x));
                       z(x)      z(x)  d
(%o3)          [y(x) %e    , - %e     (-- (y(x)))]
                                       dx
(%i4) a2: antidiff (expr, x, z(x));
                            /
                     z(x)   [   z(x)  d
(%o4)         y(x) %e     - I %e     (-- (y(x))) dx
                            ]         dx
                            /
(%i5) a2 - (first (a1) + 'integrate (second (a1), x));
(%o5)                           0
(%i6) antid (expr, x, y(x));
                             z(x)  d
(%o6)             [0, y(x) %e     (-- (z(x)))]
                                   dx
(%i7) antidiff (expr, x, y(x));
                  /
                  [        z(x)  d
(%o7)             I y(x) %e     (-- (z(x))) dx
                  ]              dx
                  /
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>antidiff</b><i> (<var>expr</var>, <var>x</var>, <var>u</var>(<var>x</var>))</i>
<a name="IDX593"></a>
</dt>
<dd><p>Retorna uma antiderivada de <var>expr</var> com relação a <var>x</var>.
A expressão <var>expr</var> pode conter uma função desconhecida <var>u</var> e suas derivadas.
</p>
<p>Quando <code>antidiff</code> obtém sucesso inteiramente,
a expressão resultante é livre do sinal de integral (isto é, livre do substantivo <code>integrate</code>).
De outra forma, <code>antidiff</code> retorna uma expressão
que é parcialmente ou inteiramente dentro de um sinal de um sinal de integral.
Se <code>antidiff</code> não pode fazer qualquer progresso,
o valor de retorno é inteiramente dentro de um sinal de integral.
</p>
<p><code>load (&quot;antid&quot;)</code> chama essa função.
O pacote <code>antid</code> também define as funções <code>nonzeroandfreeof</code> e <code>linear</code>.
</p>
<p><code>antidiff</code> é relacionada a <code>antid</code> como segue.
Tome <var>L</var>, uma lista de dois elementos, como sendo o valor de retorno de <code>antid</code>.
Então o valor de retorno de <code>antidiff</code> é igual a <code><var>L</var>[1] + 'integrate (<var>L</var>[2], <var>x</var>)</code>
onde <var>x</var> é a variável de integração.
</p>
<p>Exemplos:
</p>
<pre class="example">(%i1) load (&quot;antid&quot;)$
(%i2) expr: exp (z(x)) * diff (z(x), x) * y(x);
                            z(x)  d
(%o2)                y(x) %e     (-- (z(x)))
                                  dx
(%i3) a1: antid (expr, x, z(x));
                       z(x)      z(x)  d
(%o3)          [y(x) %e    , - %e     (-- (y(x)))]
                                       dx
(%i4) a2: antidiff (expr, x, z(x));
                            /
                     z(x)   [   z(x)  d
(%o4)         y(x) %e     - I %e     (-- (y(x))) dx
                            ]         dx
                            /
(%i5) a2 - (first (a1) + 'integrate (second (a1), x));
(%o5)                           0
(%i6) antid (expr, x, y(x));
                             z(x)  d
(%o6)             [0, y(x) %e     (-- (z(x)))]
                                   dx
(%i7) antidiff (expr, x, y(x));
                  /
                  [        z(x)  d
(%o7)             I y(x) %e     (-- (z(x))) dx
                  ]              dx
                  /
</pre>
</dd></dl>

<dl>
<dt><u>propriedade:</u> <b>atomgrad</b>
<a name="IDX594"></a>
</dt>
<dd><p><code>atomgrad</code> é a propriedade do gradiente at&ocirc;mico de uma expressão.
Essa propriedade é atribuída por <code>gradef</code>.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>atvalue</b><i> (<var>expr</var>, [<var>x_1</var> = <var>a_1</var>, ..., <var>x_m</var> = <var>a_m</var>], <var>c</var>)</i>
<a name="IDX595"></a>
</dt>
<dt><u>Função:</u> <b>atvalue</b><i> (<var>expr</var>, <var>x_1</var> = <var>a_1</var>, <var>c</var>)</i>
<a name="IDX596"></a>
</dt>
<dd><p>Atribui o valor <var>c</var> a <var>expr</var> no ponto <code><var>x</var> = <var>a</var></code>.
Tipicamente valores de extremidade são estabelecidos por esse mecanismo.
</p>
<p><var>expr</var> é a função de avaliação,
<code><var>f</var>(<var>x_1</var>, ..., <var>x_m</var>)</code>,
ou uma derivada,
<code>diff (<var>f</var>(<var>x_1</var>, ..., <var>x_m</var>), <var>x_1</var>, <var>n_1</var>, ..., <var>x_n</var>, <var>n_m</var>)</code>
na qual os argumentos da função explicitamente aparecem.
<var>n_i</var> é a ordem de diferenciação com relação a <var>x_i</var>.
</p>
<p>O ponto no qual o <code>atvalue</code> é estabelecido é dado pela lista de equações
<code>[<var>x_1</var> = <var>a_1</var>, ..., <var>x_m</var> = <var>a_m</var>]</code>.
Se existe uma variável simples <var>x_1</var>,
uma única equação pode ser dada sem ser contida em uma lista.
</p>
<p><code>printprops ([<var>f_1</var>, <var>f_2</var>, ...], atvalue)</code> mostra os <code>atvalues</code> das
funções <code><var>f_1</var>, <var>f_2</var>, ...</code>
como especificado por chamadas a <code>atvalue</code>.
<code>printprops (<var>f</var>, atvalue)</code> mostra os <code>atvalues</code> de uma função <var>f</var>.
<code>printprops (all, atvalue)</code> mostra os <code>atvalue</code>s de todas as funções para as quais <code>atvalue</code>s são definidos.
</p>
<p>Os simbolos <code>@1</code>, <code>@2</code>, ... representam as 
variáveis <var>x_1</var>, <var>x_2</var>, ... quando <code>atvalue</code>s são mostrados.
</p>
<p><code>atvalue</code> avalia seus argumentos.
<code>atvalue</code> retorna <var>c</var>, o <code>atvalue</code>.
</p>
<p>Exemplos:
</p>
<pre class="example">(%i1) atvalue (f(x,y), [x = 0, y = 1], a^2);
                                2
(%o1)                          a
(%i2) atvalue ('diff (f(x,y), x), x = 0, 1 + y);
(%o2)                        @2 + 1
(%i3) printprops (all, atvalue);
                                !
                  d             !
                 --- (f(@1, @2))!       = @2 + 1
                 d@1            !
                                !@1 = 0

                                     2
                          f(0, 1) = a

(%o3)                         done
(%i4) diff (4*f(x,y)^2 - u(x,y)^2, x);
                  d                          d
(%o4)  8 f(x, y) (-- (f(x, y))) - 2 u(x, y) (-- (u(x, y)))
                  dx                         dx
(%i5) at (%, [x = 0, y = 1]);
                                         !
              2              d           !
(%o5)     16 a  - 2 u(0, 1) (-- (u(x, y))!            )
                             dx          !
                                         !x = 0, y = 1
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>cartan</b><i>  -</i>
<a name="IDX597"></a>
</dt>
<dd><p>O cálculo exterior de formas diferenciais é uma ferramenta básica
de geometria diferencial desenvolvida por Elie Cartan e tem importantes
aplicações na teoria das equações diferenciais parciais.
O pacote <code>cartan</code>
implementa as funções <code>ext_diff</code> e <code>lie_diff</code>,
juntamente com os operadores <code>~</code> (produto da cunha) e <code>|</code> (contração
de uma forma com um vector.)
Digite <code>demo (tensor)</code> para ver uma breve
descrição desses comandos juntamente com exemplos.
</p>
<p><code>cartan</code> foi implementado por F.B. Estabrook e H.D. Wahlquist.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>del</b><i> (<var>x</var>)</i>
<a name="IDX598"></a>
</dt>
<dd><p><code>del (<var>x</var>)</code> representa a diferencial da variável <em>x</em>.
</p>
<p><code>diff</code> retorna uma expressão contendo <code>del</code>
se uma variável independente não for especificada.
Nesse caso, o valor de retorno é a então chamada &quot;diferencial total&quot;.
</p>
<p>Exemplos:
</p>
<pre class="example">(%i1) diff (log (x));
                             del(x)
(%o1)                        ------
                               x
(%i2) diff (exp (x*y));
                     x y              x y
(%o2)            x %e    del(y) + y %e    del(x)
(%i3) diff (x*y*z);
(%o3)         x y del(z) + x z del(y) + y z del(x)
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>delta</b><i> (<var>t</var>)</i>
<a name="IDX599"></a>
</dt>
<dd><p>A função Delta de Dirac.
</p>
<p>Correntemente somente <code>laplace</code> sabe sobre a função <code>delta</code>.
</p>
<p>Exemplo:
</p>
<pre class="example">(%i1) laplace (delta (t - a) * sin(b*t), t, s);
Is  a  positive, negative, or zero?

p;
                                   - a s
(%o1)                   sin(a b) %e
</pre>
</dd></dl>

<dl>
<dt><u>Variável:</u> <b>dependencies</b>
<a name="IDX600"></a>
</dt>
<dd><p>Valor por omissão: <code>[]</code>
</p>
<p><code>dependencies</code> é a lista de átomos que possuem dependências
funcionais, atribuídas por <code>depends</code> ou <code>gradef</code>.
A lista <code>dependencies</code> é cumulativa:
cada chamada a <code>depends</code> ou a <code>gradef</code> anexa ítens adicionais.
</p>
<p>Veja <code>depends</code> e <code>gradef</code>.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>depends</b><i> (<var>f_1</var>, <var>x_1</var>, ..., <var>f_n</var>, <var>x_n</var>)</i>
<a name="IDX601"></a>
</dt>
<dd><p>Declara dependêcias funcionais entre variáveis para o propósito de calcular derivadas.
Na ausência de dependêcias declaradas,
<code>diff (f, x)</code> retorna zero.
Se <code>depends (f, x)</code> for declarada,
<code>diff (f, x)</code> retorna uma derivada simbólica (isto é, um substantivo <code>diff</code>).
</p>
<p>Cada argumento <var>f_1</var>, <var>x_1</var>, etc., pode ser o nome de uma variável ou array,
ou uma lista de nomes.
Todo elemento de <var>f_i</var> (talvez apenas um elemento simples)
é declarado para depender
de todo elemento de <var>x_i</var> (talvez apenas um elemento simples).
Se algum <var>f_i</var> for o nome de um array ou contém o nome de um array,
todos os elementos do array dependem de <var>x_i</var>.
</p>
<p><code>diff</code> reconhece dependências indirectas estabelecidas por <code>depends</code>
e aplica a regra da cadeia nesses casos.
</p>
<p><code>remove (<var>f</var>, dependency)</code> remove todas as dependências declaradas para <var>f</var>.
</p>
<p><code>depends</code> retorna uma lista de dependências estabelecidas.
As dependências são anexadas à variável global <code>dependencies</code>.
<code>depends</code> avalia seus argumentos.
</p>
<p><code>diff</code> é o único comando Maxima que reconhece dependências estabelecidas por <code>depends</code>.
Outras funções (<code>integrate</code>, <code>laplace</code>, etc.)
somente reconhecem dependências explicitamente representadas por seus argumentos.
Por exemplo, <code>integrate</code> não reconhece a dependência de <code>f</code> sobre <code>x</code>
a menos que explicitamente representada como <code>integrate (f(x), x)</code>.
</p>
<pre class="example">(%i1) depends ([f, g], x);
(%o1)                     [f(x), g(x)]
(%i2) depends ([r, s], [u, v, w]);
(%o2)               [r(u, v, w), s(u, v, w)]
(%i3) depends (u, t);
(%o3)                        [u(t)]
(%i4) dependencies;
(%o4)      [f(x), g(x), r(u, v, w), s(u, v, w), u(t)]
(%i5) diff (r.s, u);
                         dr           ds
(%o5)                    -- . s + r . --
                         du           du
</pre>
<pre class="example">(%i6) diff (r.s, t);
                      dr du           ds du
(%o6)                 -- -- . s + r . -- --
                      du dt           du dt
</pre>
<pre class="example">(%i7) remove (r, dependency);
(%o7)                         done
(%i8) diff (r.s, t);
                                ds du
(%o8)                       r . -- --
                                du dt
</pre>
</dd></dl>

<dl>
<dt><u>Variável de opção:</u> <b>derivabbrev</b>
<a name="IDX602"></a>
</dt>
<dd><p>Valor por omissão: <code>false</code>
</p>
<p>Quando <code>derivabbrev</code> for <code>true</code>,
derivadas simbólicas (isto é, substantivos <code>diff</code>) são mostradas como subscritos.
De outra forma, derivadas são mostradas na notação de Leibniz <code>dy/dx</code>.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>derivdegree</b><i> (<var>expr</var>, <var>y</var>, <var>x</var>)</i>
<a name="IDX603"></a>
</dt>
<dd><p>Retorna o maior grau de uma derivada
da variável dependente <var>y</var> com relação à variável independente
<var>x</var> ocorrendo em <var>expr</var>.
</p>
<p>Exemplo:
</p><pre class="example">(%i1) 'diff (y, x, 2) + 'diff (y, z, 3) + 'diff (y, x) * x^2;
                         3     2
                        d y   d y    2 dy
(%o1)                   --- + --- + x  --
                          3     2      dx
                        dz    dx
(%i2) derivdegree (%, y, x);
(%o2)                           2
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>derivlist</b><i> (<var>var_1</var>, ..., <var>var_k</var>)</i>
<a name="IDX604"></a>
</dt>
<dd><p>Causa somente diferenciações com relação às
variáveis indicadas, dentro do comando <code>ev</code>.
</p>
</dd></dl>

<dl>
<dt><u>Variável de opção:</u> <b>derivsubst</b>
<a name="IDX605"></a>
</dt>
<dd><p>Valor por omissão: <code>false</code>
</p>
<p>Quando <code>derivsubst</code> for <code>true</code>, uma substiruíção não sintática tais como
<code>subst (x, 'diff (y, t), 'diff (y, t, 2))</code> retorna <code>'diff (x, t)</code>.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>diff</b><i> (<var>expr</var>, <var>x_1</var>, <var>n_1</var>, ..., <var>x_m</var>, <var>n_m</var>)</i>
<a name="IDX606"></a>
</dt>
<dt><u>Função:</u> <b>diff</b><i> (<var>expr</var>, <var>x</var>, <var>n</var>)</i>
<a name="IDX607"></a>
</dt>
<dt><u>Função:</u> <b>diff</b><i> (<var>expr</var>, <var>x</var>)</i>
<a name="IDX608"></a>
</dt>
<dt><u>Função:</u> <b>diff</b><i> (<var>expr</var>)</i>
<a name="IDX609"></a>
</dt>
<dd><p>Retorna uma derivada ou diferencial de <var>expr</var> com relação a alguma ou todas as variáveis em <var>expr</var>.
</p>
<p><code>diff (<var>expr</var>, <var>x</var>, <var>n</var>)</code> retorna a <var>n</var>'ésima derivada de <var>expr</var>
com relação a <var>x</var>.
</p>
<p><code>diff (<var>expr</var>, <var>x_1</var>, <var>n_1</var>, ..., <var>x_m</var>, <var>n_m</var>)</code>
retorna a derivada parcial mista de <var>expr</var> com relação a <var>x_1</var>, ..., <var>x_m</var>.
Isso é equivalente a <code>diff (... (diff (<var>expr</var>, <var>x_m</var>, <var>n_m</var>) ...), <var>x_1</var>, <var>n_1</var>)</code>.
</p>
<p><code>diff (<var>expr</var>, <var>x</var>)</code>
retorna a primeira derivada de <var>expr</var> com relação a
uma variável <var>x</var>.
</p>
<p><code>diff (<var>expr</var>)</code> retorna a diferencial total de <var>expr</var>,
isto é, a soma das derivadas de <var>expr</var> com relação a cada uma de suas variáveis
vezes a diferencial <code>del</code> de cada variável.
Nenhuma simplificação adicional de <code>del</code> é oferecida.
</p>
<p>A forma substantiva de <code>diff</code> é requerida em alguns contextos,
tal como declarando uma equação diferencial.
Nesses casos, <code>diff</code> pode ser colocado apóstrofo (com <code>'diff</code>) para retornar a forma substantiva
em lugar da realização da diferenciação.
</p>
<p>Quando <code>derivabbrev</code> for <code>true</code>, derivadas são mostradas como subscritos.
De outra forma, derivadas são mostradas na notação de Leibniz, <code>dy/dx</code>.
</p>
<p>Exemplos:
</p>
<pre class="example">(%i1) diff (exp (f(x)), x, 2);
                     2
              f(x)  d               f(x)  d         2
(%o1)       %e     (--- (f(x))) + %e     (-- (f(x)))
                      2                   dx
                    dx
(%i2) derivabbrev: true$
(%i3) 'integrate (f(x, y), y, g(x), h(x));
                         h(x)
                        /
                        [
(%o3)                   I     f(x, y) dy
                        ]
                        /
                         g(x)
(%i4) diff (%, x);
       h(x)
      /
      [
(%o4) I     f(x, y)  dy + f(x, h(x)) h(x)  - f(x, g(x)) g(x)
      ]            x                     x                  x
      /
       g(x)
</pre>
<p>Para o pacote tensor, as seguintes modificações foram
incorporadas:
</p>
<p>(1) As derivadas de quaisquer objectos indexados em <var>expr</var> terão as
variáveis <var>x_i</var> anexadas como argumentos adicionais.  Então todos os
índices de derivada serão ordenados.
</p>
<p>(2) As variáveis <var>x_i</var> podem ser inteiros de 1 até o valor de uma variável
<code>dimension</code> [valor padrão: 4].  Isso fará com que a diferenciação
seja concluída com relação aos <var>x_i</var>'ésimos membros da lista <code>coordinates</code> que
pode ser escolhida para uma lista de nomes de coordenadas, e.g.,
<code>[x, y, z, t]</code>. Se <code>coordinates</code> for associada a uma variável at&ocirc;mica, então aquela
variável subscrita por <var>x_i</var> será usada para uma variável de
diferenciação.  Isso permite um array de nomes de coordenadas ou
nomes subscritos como <code>X[1]</code>, <code>X[2]</code>, ... sejam usados.  Se <code>coordinates</code> não
foram atribuídas um valor, então as variáveis seram tratadas como em (1)
acima.
</p>
</dd></dl>

<dl>
<dt><u>Símbolo especial:</u> <b>diff</b>
<a name="IDX610"></a>
</dt>
<dd><p>Quando <code>diff</code> está presente como um <code>evflag</code> em chamadas para <code>ev</code>,
Todas as diferenciações indicadas em <code>expr</code> são realizdas.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>dscalar</b><i> (<var>f</var>)</i>
<a name="IDX611"></a>
</dt>
<dd><p>Aplica o d'Alembertiano escalar para a função escalar <var>f</var>.
</p>
<p><code>load (&quot;ctensor&quot;)</code> chama essa função.
</p>


</dd></dl>

<dl>
<dt><u>Função:</u> <b>express</b><i> (<var>expr</var>)</i>
<a name="IDX612"></a>
</dt>
<dd>
<p>Expande o substantivo do operador diferencial em expressões em termos de derivadas parciais.
<code>express</code> reconhece os operadores <code>grad</code>, <code>div</code>, <code>curl</code>, <code>laplacian</code>.
<code>express</code> também expande o produto do X <code>~</code>.
</p>
<p>Derivadas simbólicas (isto é, substantivos <code>diff</code>)
no valor de retorno de <code>express</code> podem ser avaliadas incluíndo <code>diff</code>
na chamada à função <code>ev</code> ou na linha de comando.
Nesse contexto, <code>diff</code> age como uma <code>evfun</code>.
</p>
<p><code>load (&quot;vect&quot;)</code> chama essa função.
</p>
<p>Exemplos:
</p>
<pre class="example">(%i1) load (&quot;vect&quot;)$
(%i2) grad (x^2 + y^2 + z^2);
                              2    2    2
(%o2)                  grad (z  + y  + x )
(%i3) express (%);
       d    2    2    2   d    2    2    2   d    2    2    2
(%o3) [-- (z  + y  + x ), -- (z  + y  + x ), -- (z  + y  + x )]
       dx                 dy                 dz
(%i4) ev (%, diff);
(%o4)                    [2 x, 2 y, 2 z]
(%i5) div ([x^2, y^2, z^2]);
                              2   2   2
(%o5)                   div [x , y , z ]
(%i6) express (%);
                   d    2    d    2    d    2
(%o6)              -- (z ) + -- (y ) + -- (x )
                   dz        dy        dx
(%i7) ev (%, diff);
(%o7)                    2 z + 2 y + 2 x
(%i8) curl ([x^2, y^2, z^2]);
                               2   2   2
(%o8)                   curl [x , y , z ]
(%i9) express (%);
       d    2    d    2   d    2    d    2   d    2    d    2
(%o9) [-- (z ) - -- (y ), -- (x ) - -- (z ), -- (y ) - -- (x )]
       dy        dz       dz        dx       dx        dy
(%i10) ev (%, diff);
(%o10)                      [0, 0, 0]
(%i11) laplacian (x^2 * y^2 * z^2);
                                  2  2  2
(%o11)                laplacian (x  y  z )
(%i12) express (%);
         2                2                2
        d     2  2  2    d     2  2  2    d     2  2  2
(%o12)  --- (x  y  z ) + --- (x  y  z ) + --- (x  y  z )
          2                2                2
        dz               dy               dx
(%i13) ev (%, diff);
                      2  2      2  2      2  2
(%o13)             2 y  z  + 2 x  z  + 2 x  y
(%i14) [a, b, c] ~ [x, y, z];
(%o14)                [a, b, c] ~ [x, y, z]
(%i15) express (%);
(%o15)          [b z - c y, c x - a z, a y - b x]
</pre>
</dd></dl>


<dl>
<dt><u>Função:</u> <b>gradef</b><i> (<var>f</var>(<var>x_1</var>, ..., <var>x_n</var>), <var>g_1</var>, ..., <var>g_m</var>)</i>
<a name="IDX613"></a>
</dt>
<dt><u>Função:</u> <b>gradef</b><i> (<var>a</var>, <var>x</var>, <var>expr</var>)</i>
<a name="IDX614"></a>
</dt>
<dd><p>Define as derivadas parciais (i.e., os componentes do gradiente) da função <var>f</var>
ou variável <var>a</var>.
</p>
<p><code>gradef (<var>f</var>(<var>x_1</var>, ..., <var>x_n</var>), <var>g_1</var>, ..., <var>g_m</var>)</code>
define <code>d<var>f</var>/d<var>x_i</var></code> como <var>g_i</var>, 
onde <var>g_i</var> é uma expressão; <var>g_i</var> pode ser uma chamada de função, mas não o nome de uma função.
O número de derivadas parciais <var>m</var> pode ser menor que o número de argumentos <var>n</var>,
nesses casos derivadas são definidas com relação a <var>x_1</var> até <var>x_m</var> somente.
</p>
<p><code>gradef (<var>a</var>, <var>x</var>, <var>expr</var>)</code> define uma derivada de variável <var>a</var>
com relação a <var>x</var> como <var>expr</var>.
Isso também estabelece a dependência de <var>a</var> sobre <var>x</var> (via <code>depends (<var>a</var>, <var>x</var>)</code>).
</p>
<p>O primeiro argumento <code><var>f</var>(<var>x_1</var>, ..., <var>x_n</var>)</code> ou <var>a</var> é acompanhado de apóstrofo,
mas os argumentos restantes <var>g_1</var>, ..., <var>g_m</var> são avaliados.
<code>gradef</code> retorna a função ou variável para as quais as derivadas parciais são definidas.
</p>
<p><code>gradef</code> pode redefinir as derivadas de funções internas do Maxima.
Por exemplo, <code>gradef (sin(x), sqrt (1 - sin(x)^2))</code> redefine uma derivada de <code>sin</code>.
</p>
<p><code>gradef</code> não pode definir derivadas parciais para um função subscrita.
</p>
<p><code>printprops ([<var>f_1</var>, ..., <var>f_n</var>], gradef)</code> mostra as derivadas parciais
das funções <var>f_1</var>, ..., <var>f_n</var>, como definidas por <code>gradef</code>.
</p>
<p><code>printprops ([<var>a_n</var>, ..., <var>a_n</var>], atomgrad)</code> mostra as derivadas parciais
das variáveis <var>a_n</var>, ..., <var>a_n</var>, como definidas por <code>gradef</code>.
</p>
<p><code>gradefs</code> é a lista de funções
para as quais derivadas parciais foram definidas por <code>gradef</code>.
<code>gradefs</code> não inclui quaisquer variáveis
para quais derivadas parciais foram definidas por <code>gradef</code>.
</p>
<p>Gradientes são necessários quando, por exemplo, uma função não é conhecida
explicitamente mas suas derivadas primeiras são e isso é desejado para obter
derivadas de ordem superior.
</p>
</dd></dl>

<dl>
<dt><u>Variável de sistema:</u> <b>gradefs</b>
<a name="IDX615"></a>
</dt>
<dd><p>Valor por omissão: <code>[]</code>
</p>
<p><code>gradefs</code> é a lista de funções
para as quais derivadas parciais foram definidas por <code>gradef</code>.
<code>gradefs</code> não inclui quaisquer variáveis
para as quais derivadas parciais foram deinidas por <code>gradef</code>.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>laplace</b><i> (<var>expr</var>, <var>t</var>, <var>s</var>)</i>
<a name="IDX616"></a>
</dt>
<dd><p>Tenta calcular a transformada de Laplace de <var>expr</var> com relação a uma variável <var>t</var>
e parâmetro de transformação <var>s</var>.
Se <code>laplace</code> não pode achar uma solução, um substantivo <code>'laplace</code> é retornado.
</p>
<p><code>laplace</code> reconhece em <var>expr</var> as funções
<code>delta</code>, <code>exp</code>, <code>log</code>, <code>sin</code>, <code>cos</code>, <code>sinh</code>, <code>cosh</code>, e <code>erf</code>,
também <code>derivative</code>, <code>integrate</code>, <code>sum</code>, e <code>ilt</code>.
Se algumas outras funções estiverem presente,
<code>laplace</code> pode não ser habilitada a calcular a tranformada.
</p>
<p><var>expr</var> pode também ser uma equação linear, diferencial de coeficiente contante no
qual caso o <code>atvalue</code> da variável dependente é usado.
O requerido <code>atvalue</code> pode ser fornecido ou antes ou depois da transformada ser calculada.
Uma vez que as condições iniciais devem ser especificadas em zero, se um teve condições
de limite impostas em qualquer outro lugar ele pode impor essas sobre a solução
geral e eliminar as constantes resolvendo a solução geral
para essas e substituindo seus valores de volta.
</p>
<p><code>laplace</code> reconhece integrais de convolução da forma
<code>integrate (f(x) * g(t - x), x, 0, t)</code>;
outros tipos de convoluções não são reconhecidos.
</p>
<p>Relações funcionais devem ser explicitamente representadas em <var>expr</var>;
relações implícitas, estabelecidas por <code>depends</code>, não são reconhecidas.
Isto é, se <var>f</var> depende de <var>x</var> e <var>y</var>,
<code>f (x, y)</code> deve aparecer em <var>expr</var>.
</p>
<p>Veja também <code>ilt</code>, a transformada inversa de Laplace.
</p>
<p>Exemplos:
</p>
<pre class="example">(%i1) laplace (exp (2*t + a) * sin(t) * t, t, s);
                            a
                          %e  (2 s - 4)
(%o1)                    ---------------
                           2           2
                         (s  - 4 s + 5)
(%i2) laplace ('diff (f (x), x), x, s);
(%o2)             s laplace(f(x), x, s) - f(0)
(%i3) diff (diff (delta (t), t), t);
                          2
                         d
(%o3)                    --- (delta(t))
                           2
                         dt
(%i4) laplace (%, t, s);
                            !
               d            !         2
(%o4)        - -- (delta(t))!      + s  - delta(0) s
               dt           !
                            !t = 0
</pre>
</dd></dl>


<hr size="6">
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC60" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_20.html#SEC62" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_72.html#SEC272" title="Index">&Iacute;ndice</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<p>
 <font size="-1">
  This document was generated by <em>Robert Dodier</em> on <em>Janeiro, 9 2015</em> using <a href="http://texi2html.cvshome.org/"><em>texi2html 1.76</em></a>.
 </font>
 <br>

</p>
</body>
</html>
