<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html401/loose.dtd">
<html>
<!-- Created on Janeiro, 9 2015 by texi2html 1.76 -->
<!--
Written by: Lionel Cons <Lionel.Cons@cern.ch> (original author)
            Karl Berry  <karl@freefriends.org>
            Olaf Bachmann <obachman@mathematik.uni-kl.de>
            and many others.
Maintained by: Many creative people <dev@texi2html.cvshome.org>
Send bugs and suggestions to <users@texi2html.cvshome.org>

-->
<head>
<title>Manual do Maxima 5.35.71.g68475e4: 30. Séries</title>

<meta name="description" content="Manual do Maxima 5.35.71.g68475e4: 30. Séries">
<meta name="keywords" content="Manual do Maxima 5.35.71.g68475e4: 30. Séries">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="texi2html 1.76">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
pre.display {font-family: serif}
pre.format {font-family: serif}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: serif; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: serif; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.sansserif {font-family:sans-serif; font-weight:normal;}
ul.toc {list-style: none}
body {color: black; background: white;  margin-left: 8%; margin-right: 13%;
      font-family: "FreeSans", sans-serif}
h1 {font-size: 150%; font-family: "FreeSans", sans-serif}
h2 {font-size: 125%; font-family: "FreeSans", sans-serif}
h3 {font-size: 100%; font-family: "FreeSans", sans-serif}
a[href] {color: rgb(0,0,255); text-decoration: none;}
a[href]:hover {background: rgb(220,220,220);}
div.textbox {border: solid; border-width: thin; padding-top: 1em;
    padding-bottom: 1em; padding-left: 2em; padding-right: 2em}
div.titlebox {border: none; padding-top: 1em; padding-bottom: 1em;
    padding-left: 2em; padding-right: 2em; background: rgb(200,255,255);
    font-family: sans-serif}
div.synopsisbox {
    border: none; padding-top: 1em; padding-bottom: 1em; padding-left: 2em;
    padding-right: 2em; background: rgb(255,220,255);}
pre.example {border: 1px solid rgb(180,180,180); padding-top: 1em;
    padding-bottom: 1em; padding-left: 1em; padding-right: 1em;
    background-color: rgb(238,238,255)}
div.spacerbox {border: none; padding-top: 2em; padding-bottom: 2em}
div.image {margin: 0; padding: 1em; text-align: center}
div.categorybox {border: 1px solid gray; padding-top: 0px; padding-bottom: 0px;
    padding-left: 1em; padding-right: 1em; background: rgb(247,242,220)}

-->
</style>

<link rel="icon" href="../figures/favicon.ico"/>
</head>

<body lang="pt" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">

<a name="S_00e9ries"></a>
<a name="SEC120"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="maxima_29.html#SEC119" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC121" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima_29.html#SEC117" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_31.html#SEC123" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_72.html#SEC272" title="Index">&Iacute;ndice</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h1 class="chapter"> 30. Séries </h1>

<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC121">30.1 Introdução a Séries</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">      
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC122">30.2 Definições para Séries</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">      
</td></tr>
</table>

<hr size="6">
<a name="Introdu_00e7_00e3o-a-S_00e9ries"></a>
<a name="SEC121"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC120" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC122" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC120" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC120" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_31.html#SEC123" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_72.html#SEC272" title="Index">&Iacute;ndice</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 30.1 Introdução a Séries </h2>
<p>Maxima contém funções <code>taylor</code> e <code>powerseries</code> (séries de potência) para encontrar as
séries de funções diferenciáveis.   Maxima também tem ferramentas  tais como <code>nusum</code>
capazes de encontrar a forma fechada de algumas séries.   Operações tais como adição e multiplicação travalham da forma usual sobre séries.  Essa secção apresenta as variáveis globais que controlam a
expansão.
</p><hr size="6">
<a name="Defini_00e7_00f5es-para-S_00e9ries"></a>
<a name="SEC122"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC121" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_31.html#SEC123" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC120" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC120" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_31.html#SEC123" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_72.html#SEC272" title="Index">&Iacute;ndice</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 30.2 Definições para Séries </h2>

<dl>
<dt><u>Variável de opção:</u> <b>cauchysum</b>
<a name="IDX1014"></a>
</dt>
<dd><p>Valor por omissão: <code>false</code>
</p>
<p>Quando multiplicando adições jutas com <code>inf</code> como seus limites superiores,
se <code>sumexpand</code> for <code>true</code> e <code>cauchysum</code> for <code>true</code>
então o produto de Cauchy será usado em lugar do produto
usual.
No produto de Cauchy o índice do somatório interno é uma
função do índice do externo em lugar de variar
independentemente.
</p>
<p>Exemplo:
</p>
<pre class="example">(%i1) sumexpand: false$
(%i2) cauchysum: false$
(%i3) s: sum (f(i), i, 0, inf) * sum (g(j), j, 0, inf);
                      inf         inf
                      ====        ====
                      \           \
(%o3)                ( &gt;    f(i))  &gt;    g(j)
                      /           /
                      ====        ====
                      i = 0       j = 0
(%i4) sumexpand: true$
(%i5) cauchysum: true$
(%i6) ''s;
                 inf     i1
                 ====   ====
                 \      \
(%o6)             &gt;      &gt;     g(i1 - i2) f(i2)
                 /      /
                 ====   ====
                 i1 = 0 i2 = 0
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>deftaylor</b><i> (<var>f_1</var>(<var>x_1</var>), <var>expr_1</var>, ..., <var>f_n</var>(<var>x_n</var>), <var>expr_n</var>)</i>
<a name="IDX1015"></a>
</dt>
<dd><p>Para cada função <var>f_i</var> de uma variável <var>x_i</var>, 
<code>deftaylor</code> define <var>expr_i</var> como a séries de Taylor sobre zero.
<var>expr_i</var> é tipicamente um polinómio em <var>x_i</var> ou um somatório;
expressões mais gerais são aceitas por <code>deftaylor</code> sem reclamações.
</p>
<p><code>powerseries (<var>f_i</var>(<var>x_i</var>), <var>x_i</var>, 0)</code>
retorna as séries definidas por <code>deftaylor</code>.
</p>
<p><code>deftaylor</code> retorna uma lista das funções
<var>f_1</var>, ..., <var>f_n</var>.
<code>deftaylor</code> avalia seus argumentos.
</p>
<p>Exemplo:
</p>
<pre class="example">(%i1) deftaylor (f(x), x^2 + sum(x^i/(2^i*i!^2), i, 4, inf));
(%o1)                          [f]
(%i2) powerseries (f(x), x, 0);
                      inf
                      ====      i1
                      \        x         2
(%o2)                  &gt;     -------- + x
                      /       i1    2
                      ====   2   i1!
                      i1 = 4
(%i3) taylor (exp (sqrt (f(x))), x, 0, 4);
                      2         3          4
                     x    3073 x    12817 x
(%o3)/T/     1 + x + -- + ------- + -------- + . . .
                     2     18432     307200
</pre>
</dd></dl>

<dl>
<dt><u>Variável de opção:</u> <b>maxtayorder</b>
<a name="IDX1016"></a>
</dt>
<dd><p>Valor por omissão: <code>true</code>
</p>
<p>Quando <code>maxtayorder</code> for <code>true</code>, durante a manipulação
algébrica de séries (truncadas) de Taylor, <code>taylor</code> tenta reter
tantos termos quantos forem conhecidos serem correctos.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>niceindices</b><i> (<var>expr</var>)</i>
<a name="IDX1017"></a>
</dt>
<dd><p>Renomeia os índices de adições e produtos em <var>expr</var>.
<code>niceindices</code> tenta renomear cada índice para o valor de <code>niceindicespref[1]</code>,
a menos que o nome apareça nas parcelas do somatório ou produtório,
nesses casos <code>niceindices</code> tenta
os elementos seguintes de <code>niceindicespref</code> por sua vez, até que uma varável não usada unused variable seja encontrada.
Se a lista inteira for exaurida,
índices adicionais são constrídos através da anexaao de inteiros ao valor de
<code>niceindicespref[1]</code>, e.g., <code>i0</code>, <code>i1</code>, <code>i2</code>, ....
</p>
<p><code>niceindices</code> retorna uma expressão.
<code>niceindices</code> avalia seu argumento.
</p>
<p>Exemplo:
</p>
<pre class="example">(%i1) niceindicespref;
(%o1)                  [i, j, k, l, m, n]
(%i2) product (sum (f (foo + i*j*bar), foo, 1, inf), bar, 1, inf);
                 inf    inf
                /===\   ====
                 ! !    \
(%o2)            ! !     &gt;      f(bar i j + foo)
                 ! !    /
                bar = 1 ====
                        foo = 1
(%i3) niceindices (%);
                     inf  inf
                    /===\ ====
                     ! !  \
(%o3)                ! !   &gt;    f(i j l + k)
                     ! !  /
                    l = 1 ====
                          k = 1
</pre>
</dd></dl>

<dl>
<dt><u>Variável de opção:</u> <b>niceindicespref</b>
<a name="IDX1018"></a>
</dt>
<dd><p>Valor por omissão: <code>[i, j, k, l, m, n]</code>
</p>
<p><code>niceindicespref</code> é a lista da qual <code>niceindices</code>
obtém os nomes dos índices de adições e produtos products.
</p>
<p>Os elementos de <code>niceindicespref</code> são tipicamente nomes de variáveis,
embora que não seja imposto por <code>niceindices</code>.
</p>
<p>Exemplo:
</p>
<pre class="example">(%i1) niceindicespref: [p, q, r, s, t, u]$
(%i2) product (sum (f (foo + i*j*bar), foo, 1, inf), bar, 1, inf);
                 inf    inf
                /===\   ====
                 ! !    \
(%o2)            ! !     &gt;      f(bar i j + foo)
                 ! !    /
                bar = 1 ====
                        foo = 1
(%i3) niceindices (%);
                     inf  inf
                    /===\ ====
                     ! !  \
(%o3)                ! !   &gt;    f(i j q + p)
                     ! !  /
                    q = 1 ====
                          p = 1
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>nusum</b><i> (<var>expr</var>, <var>x</var>, <var>i_0</var>, <var>i_1</var>)</i>
<a name="IDX1019"></a>
</dt>
<dd><p>Realiza o somatório hipergeométrico indefinido de <var>expr</var> com
relação a <var>x</var> usando um procedimento de decisão devido a R.W. Gosper.
<var>expr</var> e o resultado deve ser expressável como produtos de expoentes inteiros,
factoriais, binomios, e funções recionais.
</p>
<p>Os termos &quot;definido&quot;
and &quot;e somatório indefinido&quot; são usados analogamente a &quot;definida&quot; and
&quot;integração indefinida&quot;.
Adicionar indefinidamente significa dar um resultado simólico
para a adição sobre intervalos de comprimentos de variáveis, não apenas e.g. 0 a
infinito.  Dessa forma, uma vez que não existe fórmula para a adição parcial geral de
séries binomiais, <code>nusum</code> não pode fazer isso.
</p>
<p><code>nusum</code> e <code>unsum</code> conhecem um porco sobre adições e subtrações de produtos finitos.
Veja também <code>unsum</code>.
</p>
<p>Exemplos:
</p>
<pre class="example">(%i1) nusum (n*n!, n, 0, n);

Dependent equations eliminated:  (1)
(%o1)                     (n + 1)! - 1
(%i2) nusum (n^4*4^n/binomial(2*n,n), n, 0, n);
                     4        3       2              n
      2 (n + 1) (63 n  + 112 n  + 18 n  - 22 n + 3) 4      2
(%o2) ------------------------------------------------ - ------
                    693 binomial(2 n, n)                 3 11 7
(%i3) unsum (%, n);
                              4  n
                             n  4
(%o3)                   ----------------
                        binomial(2 n, n)
(%i4) unsum (prod (i^2, i, 1, n), n);
                    n - 1
                    /===\
                     ! !   2
(%o4)              ( ! !  i ) (n - 1) (n + 1)
                     ! !
                    i = 1
(%i5) nusum (%, n, 1, n);

Dependent equations eliminated:  (2 3)
                            n
                          /===\
                           ! !   2
(%o5)                      ! !  i  - 1
                           ! !
                          i = 1
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>pade</b><i> (<var>taylor_series</var>, <var>numer_deg_bound</var>, <var>denom_deg_bound</var>)</i>
<a name="IDX1020"></a>
</dt>
<dd><p>Retorna uma lista de
todas as funções racionais que possuem a dada expansão da séries de Taylor
onde a adição dos graus do numerador e do denominador é
menor que ou igual ao nível de truncação das séries de potência, i.e.
são &quot;melhores&quot; aproximações, e que adicionalmente satisfazem o grau
especificado associado.
</p>
<p><var>taylor_series</var> é uma séries de Taylor de uma variável.
<var>numer_deg_bound</var> e <var>denom_deg_bound</var>
são inteiros positivos especificando o grau associado sobre
o numerador e o denominador.
</p>
<p><var>taylor_series</var> podem também ser séries de Laurent, e o grau
associado pode ser <code>inf</code> que acarreta todas funções racionais cujo grau
total for menor que ou igual ao comprimento das séries de potências a serem
retornadas.  O grau total é definido como <code><var>numer_deg_bound</var> + <var>denom_deg_bound</var></code>.
O comprimento de séries de potência é definido como
<code>&quot;nível de trncação&quot; + 1 - min(0, &quot;ordem das séries&quot;)</code>.
</p>
<pre class="example">(%i1) taylor (1 + x + x^2 + x^3, x, 0, 3);
                              2    3
(%o1)/T/             1 + x + x  + x  + . . .
(%i2) pade (%, 1, 1);
                                 1
(%o2)                       [- -----]
                               x - 1
(%i3) t: taylor(-(83787*x^10 - 45552*x^9 - 187296*x^8
                   + 387072*x^7 + 86016*x^6 - 1507328*x^5
                   + 1966080*x^4 + 4194304*x^3 - 25165824*x^2
                   + 67108864*x - 134217728)
       /134217728, x, 0, 10);
                    2    3       4       5       6        7
             x   3 x    x    15 x    23 x    21 x    189 x
(%o3)/T/ 1 - - + ---- - -- - ----- + ----- - ----- - ------
             2    16    32   1024    2048    32768   65536

                                  8         9          10
                            5853 x    2847 x    83787 x
                          + ------- + ------- - --------- + . . .
                            4194304   8388608   134217728
(%i4) pade (t, 4, 4);
(%o4)                          []
</pre>
<p>Não existe função racional de grau 4 numerador/denominador, com essa
expansão de série de potência.  Você obrigatoriamente em geral tem grau do numerador e
grau do denominador adicionando para cima ao menor grau das séries de potência,
com o objectivo de ter disponível coeficientes desconhecidos para resolver.
</p>
<pre class="example">(%i5) pade (t, 5, 5);
                     5                4                 3
(%o5) [- (520256329 x  - 96719020632 x  - 489651410240 x

                  2
 - 1619100813312 x  - 2176885157888 x - 2386516803584)

               5                 4                  3
/(47041365435 x  + 381702613848 x  + 1360678489152 x

                  2
 + 2856700692480 x  + 3370143559680 x + 2386516803584)]
</pre>
</dd></dl>

<dl>
<dt><u>Variável de opção:</u> <b>powerdisp</b>
<a name="IDX1021"></a>
</dt>
<dd><p>Valor por omissão: <code>false</code>
</p>
<p>Quando <code>powerdisp</code> for <code>true</code>,
uma adição é mostrada com seus termos em ordem do crescimento do expoente.
Dessa forma um polinómio é mostrado como séries de potências truncadas,
com o termo constante primeiro e o maior expoente por último.
</p>
<p>Por padão, termos de uma adição são mostrados em ordem do expoente decrescente.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>powerseries</b><i> (<var>expr</var>, <var>x</var>, <var>a</var>)</i>
<a name="IDX1022"></a>
</dt>
<dd><p>Retorna a forma geral expansão de séries de potência para <var>expr</var>
na variável <var>x</var> sobre o ponto <var>a</var> (o qual pode ser <code>inf</code> para infinito).
</p>
<p>Se <code>powerseries</code> incapaz de expandir <var>expr</var>,
<code>taylor</code> pode dar os primeiros muitos termos de séries.
</p>
<p>Quando <code>verbose</code> for <code>true</code>,
<code>powerseries</code> mostra mensagens de progresso. 
</p>
<pre class="example">(%i1) verbose: true$
(%i2) powerseries (log(sin(x)/x), x, 0);
can't expand 
                                 log(sin(x))
so we'll try again after applying the rule:
                                        d
                                      / -- (sin(x))
                                      [ dx
                        log(sin(x)) = i ----------- dx
                                      ]   sin(x)
                                      /
in the first simplification we have returned:
                             /
                             [
                             i cot(x) dx - log(x)
                             ]
                             /
                    inf
                    ====        i1  2 i1             2 i1
                    \      (- 1)   2     bern(2 i1) x
                     &gt;     ------------------------------
                    /                i1 (2 i1)!
                    ====
                    i1 = 1
(%o2)                -------------------------------------
                                      2
</pre>
</dd></dl>

<dl>
<dt><u>Variável de opção:</u> <b>psexpand</b>
<a name="IDX1023"></a>
</dt>
<dd><p>Valor por omissão: <code>false</code>
</p>
<p>Quando <code>psexpand</code> for <code>true</code>,
uma expressão função racional extendida é mostrada completamente expandida.
O comutador <code>ratexpand</code> tem o mesmo efeito.
</p>
<p>Quando <code>psexpand</code> for <code>false</code>,
uma expressão de várias variáveis é mostrada apenas como no pacote de função racional.
</p>
<p>Quando <code>psexpand</code> for  <code>multi</code>,
então termos com o mesmo grau total nas variáveis são agrupados juntos.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>revert</b><i> (<var>expr</var>, <var>x</var>)</i>
<a name="IDX1024"></a>
</dt>
<dt><u>Função:</u> <b>revert2</b><i> (<var>expr</var>, <var>x</var>, <var>n</var>)</i>
<a name="IDX1025"></a>
</dt>
<dd><p>Essas funções retornam a reversão de <var>expr</var>, uma série de Taylor sobre zero na variável <var>x</var>.
<code>revert</code> retorna um polinómio de grau igual ao maior expoente em <var>expr</var>.
<code>revert2</code> retorna um polinómio de grau <var>n</var>,
o qual pode ser maior que, igual a, ou menor que o grau de <var>expr</var>.
</p>
<p><code>load (&quot;revert&quot;)</code> chama essas funções.
</p>
<p>Exemplos:
</p>
<pre class="example">(%i1) load (&quot;revert&quot;)$
(%i2) t: taylor (exp(x) - 1, x, 0, 6);
                   2    3    4    5     6
                  x    x    x    x     x
(%o2)/T/      x + -- + -- + -- + --- + --- + . . .
                  2    6    24   120   720
(%i3) revert (t, x);
               6       5       4       3       2
           10 x  - 12 x  + 15 x  - 20 x  + 30 x  - 60 x
(%o3)/R/ - --------------------------------------------
                                60
(%i4) ratexpand (%);
                     6    5    4    3    2
                    x    x    x    x    x
(%o4)             - -- + -- - -- + -- - -- + x
                    6    5    4    3    2
(%i5) taylor (log(x+1), x, 0, 6);
                    2    3    4    5    6
                   x    x    x    x    x
(%o5)/T/       x - -- + -- - -- + -- - -- + . . .
                   2    3    4    5    6
(%i6) ratsimp (revert (t, x) - taylor (log(x+1), x, 0, 6));
(%o6)                           0
(%i7) revert2 (t, x, 4);
                          4    3    2
                         x    x    x
(%o7)                  - -- + -- - -- + x
                         4    3    2
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>taylor</b><i> (<var>expr</var>, <var>x</var>, <var>a</var>, <var>n</var>)</i>
<a name="IDX1026"></a>
</dt>
<dt><u>Função:</u> <b>taylor</b><i> (<var>expr</var>, [<var>x_1</var>, <var>x_2</var>, ...], <var>a</var>, <var>n</var>)</i>
<a name="IDX1027"></a>
</dt>
<dt><u>Função:</u> <b>taylor</b><i> (<var>expr</var>, [<var>x</var>, <var>a</var>, <var>n</var>, 'asymp])</i>
<a name="IDX1028"></a>
</dt>
<dt><u>Função:</u> <b>taylor</b><i> (<var>expr</var>, [<var>x_1</var>, <var>x_2</var>, ...], [<var>a_1</var>, <var>a_2</var>, ...], [<var>n_1</var>, <var>n_2</var>, ...])</i>
<a name="IDX1029"></a>
</dt>
<dt><u>Função:</u> <b>taylor</b><i> (<var>expr</var>, [<var>x_1</var>, <var>a_1</var>, <var>n_1</var>], [<var>x_2</var>, <var>a_2</var>, <var>n_2</var>], ...)</i>
<a name="IDX1030"></a>
</dt>
<dd><p><code>taylor (<var>expr</var>, <var>x</var>, <var>a</var>, <var>n</var>)</code> expande a expressão <var>expr</var>
em uma série truncada de Taylor ou de Laurent na variável <var>x</var>
em torno do ponto <var>a</var>,
contendo termos até <code>(<var>x</var> - <var>a</var>)^<var>n</var></code>.
</p>
<p>Se <var>expr</var> é da forma <code><var>f</var>(<var>x</var>)/<var>g</var>(<var>x</var>)</code>
e <code><var>g</var>(<var>x</var>)</code> não possui de grau acima do grau <var>n</var>
então <code>taylor</code> tenta expandir <code><var>g</var>(<var>x</var>)</code> acima do gau <code>2 <var>n</var></code>.
Se existe ainda termos não zero, <code>taylor</code> dobra o
grau de expansão de <code><var>g</var>(<var>x</var>)</code>
contanto que o grau da expansão o grau da expansão seja menor que ou igual a <code><var>n</var> 2^taylordepth</code>.
</p>
<p><code>taylor (<var>expr</var>, [<var>x_1</var>, <var>x_2</var>, ...], <var>a</var>, <var>n</var>)</code>
retorna uma série de potência truncada 
de grau <var>n</var> em todas as variáveis <var>x_1</var>, <var>x_2</var>, ...
sobre o ponto <code>(<var>a</var>, <var>a</var>, ...)</code>.
</p>
<p><code>taylor (<var>expr</var>, [<var>x_1</var>, <var>a_1</var>, <var>n_1</var>], [<var>x_2</var>, <var>a_2</var>, <var>n_2</var>], ...)</code>
retorna uma série de potência truncada nas variáveis <var>x_1</var>, <var>x_2</var>, ...
sobre o ponto <code>(<var>a_1</var>, <var>a_2</var>, ...)</code>,
truncada em <var>n_1</var>, <var>n_2</var>, ....
</p>
<p><code>taylor (<var>expr</var>, [<var>x_1</var>, <var>x_2</var>, ...], [<var>a_1</var>, <var>a_2</var>, ...], [<var>n_1</var>, <var>n_2</var>, ...])</code>
retorna uma série de potência truncada nas variáveis <var>x_1</var>, <var>x_2</var>, ...
sobre o ponto <code>(<var>a_1</var>, <var>a_2</var>, ...)</code>,
truncada em <var>n_1</var>, <var>n_2</var>, ....
</p>
<p><code>taylor (<var>expr</var>, [<var>x</var>, <var>a</var>, <var>n</var>, 'asymp])</code>
retorna uma expansão de <var>expr</var> em expoentes negativos de <code><var>x</var> - <var>a</var></code>.
O termo de maior ordem é <code>(<var>x</var> - <var>a</var>)^<var>-n</var></code>.
</p>
<p>Quando <code>maxtayorder</code> for <code>true</code>, então durante maniplulação
algébrica da séries de Taylor (truncada), <code>taylor</code> tenta reter
tantos termos quantos forem conhecidos serem correctos.
</p>
<p>Quando <code>psexpand</code> for <code>true</code>,
uma expressão de função racional extendida é mostrada completamente expandida.
O comutador <code>ratexpand</code> tem o mesmo efeito.
Quando <code>psexpand</code> for <code>false</code>,
uma expressão de várias variáveis é mostrada apenas como no pacote de função racional.
Quando <code>psexpand</code> for  <code>multi</code>,
então os termos com o mesmo grau total nas variáveis são agrupados juntos.
</p>
<p>Veja também o comutador <code>taylor_logexpand</code> para controlar a expansão.
</p>
<p>Exemplos:
</p>
<pre class="example">(%i1) taylor (sqrt (sin(x) + a*x + 1), x, 0, 3);
                           2             2
             (a + 1) x   (a  + 2 a + 1) x
(%o1)/T/ 1 + --------- - -----------------
                 2               8

                                   3      2             3
                               (3 a  + 9 a  + 9 a - 1) x
                             + -------------------------- + . . .
                                           48
(%i2) %^2;
                                    3
                                   x
(%o2)/T/           1 + (a + 1) x - -- + . . .
                                   6
(%i3) taylor (sqrt (x + 1), x, 0, 5);
                       2    3      4      5
                  x   x    x    5 x    7 x
(%o3)/T/      1 + - - -- + -- - ---- + ---- + . . .
                  2   8    16   128    256
(%i4) %^2;
(%o4)/T/                  1 + x + . . .
(%i5) product ((1 + x^i)^2.5, i, 1, inf)/(1 + x^2);
                         inf
                        /===\
                         ! !    i     2.5
                         ! !  (x  + 1)
                         ! !
                        i = 1
(%o5)                   -----------------
                              2
                             x  + 1
(%i6) ev (taylor(%, x,  0, 3), keepfloat);
                               2           3
(%o6)/T/    1 + 2.5 x + 3.375 x  + 6.5625 x  + . . .
(%i7) taylor (1/log (x + 1), x, 0, 3);
                               2       3
                 1   1   x    x    19 x
(%o7)/T/         - + - - -- + -- - ----- + . . .
                 x   2   12   24    720
(%i8) taylor (cos(x) - sec(x), x, 0, 5);
                                4
                           2   x
(%o8)/T/                - x  - -- + . . .
                               6
(%i9) taylor ((cos(x) - sec(x))^3, x, 0, 5);
(%o9)/T/                    0 + . . .
(%i10) taylor (1/(cos(x) - sec(x))^3, x, 0, 5);
                                               2          4
            1     1       11      347    6767 x    15377 x
(%o10)/T/ - -- + ---- + ------ - ----- - ------- - --------
             6      4        2   15120   604800    7983360
            x    2 x    120 x

                                                          + . . .
(%i11) taylor (sqrt (1 - k^2*sin(x)^2), x, 0, 6);
               2  2       4      2   4
              k  x    (3 k  - 4 k ) x
(%o11)/T/ 1 - ----- - ----------------
                2            24

                                    6       4       2   6
                               (45 k  - 60 k  + 16 k ) x
                             - -------------------------- + . . .
                                          720
(%i12) taylor ((x + 1)^n, x, 0, 4);
                      2       2     3      2         3
                    (n  - n) x    (n  - 3 n  + 2 n) x
(%o12)/T/ 1 + n x + ----------- + --------------------
                         2                 6

                               4      3       2         4
                             (n  - 6 n  + 11 n  - 6 n) x
                           + ---------------------------- + . . .
                                          24
(%i13) taylor (sin (y + x), x, 0, 3, y, 0, 3);
               3                 2
              y                 y
(%o13)/T/ y - -- + . . . + (1 - -- + . . .) x
              6                 2

                    3                       2
               y   y            2      1   y            3
          + (- - + -- + . . .) x  + (- - + -- + . . .) x  + . . .
               2   12                  6   12
(%i14) taylor (sin (y + x), [x, y], 0, 3);
                     3        2      2      3
                    x  + 3 y x  + 3 y  x + y
(%o14)/T/   y + x - ------------------------- + . . .
                                6
(%i15) taylor (1/sin (y + x), x, 0, 3, y, 0, 3);
          1   y              1    1               1            2
(%o15)/T/ - + - + . . . + (- -- + - + . . .) x + (-- + . . .) x
          y   6               2   6                3
                             y                    y

                                           1            3
                                      + (- -- + . . .) x  + . . .
                                            4
                                           y
(%i16) taylor (1/sin (y + x), [x, y], 0, 3);
                             3         2       2        3
            1     x + y   7 x  + 21 y x  + 21 y  x + 7 y
(%o16)/T/ ----- + ----- + ------------------------------- + . . .
          x + y     6                   360
</pre>
</dd></dl>

<dl>
<dt><u>Variável de opção:</u> <b>taylordepth</b>
<a name="IDX1031"></a>
</dt>
<dd><p>Valor por omissão: 3
</p>
<p>Se existem ainda termos não zero, <code>taylor</code> dobra o
grau da expansão de <code><var>g</var>(<var>x</var>)</code>
contanto que o grau da expansão seja menor que ou igual a <code><var>n</var> 2^taylordepth</code>.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>taylorinfo</b><i> (<var>expr</var>)</i>
<a name="IDX1032"></a>
</dt>
<dd><p>Retorna information about the séries de Taylor <var>expr</var>.
O valor de retorno é uma lista de listas.
Cada lista compreende o nome de uma variável,
o ponto de expansão, e o grau da expansão.
</p>
<p><code>taylorinfo</code> retorna <code>false</code> se <var>expr</var> não for uma séries de Taylor.
</p>
<p>Exemplo:
</p>
<pre class="example">(%i1) taylor ((1 - y^2)/(1 - x), x, 0, 3, [y, a, inf]);
                  2                       2
(%o1)/T/ - (y - a)  - 2 a (y - a) + (1 - a )

         2                        2
 + (1 - a  - 2 a (y - a) - (y - a) ) x

         2                        2   2
 + (1 - a  - 2 a (y - a) - (y - a) ) x

         2                        2   3
 + (1 - a  - 2 a (y - a) - (y - a) ) x  + . . .
(%i2) taylorinfo(%);
(%o2)               [[y, a, inf], [x, 0, 3]]
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>taylorp</b><i> (<var>expr</var>)</i>
<a name="IDX1033"></a>
</dt>
<dd><p>Retorna <code>true</code> se <var>expr</var> for uma séries de Taylor,
e <code>false</code> de outra forma.
</p>
</dd></dl>

<dl>
<dt><u>Variável de opção:</u> <b>taylor_logexpand</b>
<a name="IDX1034"></a>
</dt>
<dd><p>Valor por omissão: <code>true</code>
</p>
<p><code>taylor_logexpand</code> controla expansão de logaritmos em
séries de <code>taylor</code>.
</p>
<p>Quando <code>taylor_logexpand</code> for <code>true</code>, todos  logaritmos são expandidos completamente dessa forma
problemas de reconhecimento de zero envolvendo envolvendo identidades logarítmicas não
atrapalham o processo de expansão.  Todavia, esse esquema não é sempre
matematicamente correcto uma vez que isso ignora informações de ramo.
</p>
<p>Quando <code>taylor_logexpand</code> for escolhida para <code>false</code>, então a expansão logarítmica que ocorre
é somente aquela que for necessária para obter uma séries de potência formal.
</p>
</dd></dl>

<dl>
<dt><u>Variável de opção:</u> <b>taylor_order_coefficients</b>
<a name="IDX1035"></a>
</dt>
<dd><p>Valor por omissão: <code>true</code>
</p>
<p><code>taylor_order_coefficients</code> controla a ordenação dos
coeficientes em uma série de Taylor.
</p>
<p>Quando <code>taylor_order_coefficients</code> for <code>true</code>,
coeficientes da séries de Taylor são ordenados canonicamente.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>taylor_simplifier</b><i> (<var>expr</var>)</i>
<a name="IDX1036"></a>
</dt>
<dd><p>Simplifica coeficientes da séries  de potência <var>expr</var>.
<code>taylor</code> chama essa função.
</p>
</dd></dl>

<dl>
<dt><u>Variável de opção:</u> <b>taylor_truncate_polynomials</b>
<a name="IDX1037"></a>
</dt>
<dd><p>Valor por omissão: <code>true</code>
</p>
<p>Quando <code>taylor_truncate_polynomials</code> for <code>true</code>,
polinómios são truncados baseados sobre a entrada de níveis de truncação.
</p>
<p>De outra forma,
entrada de polinómios para <code>taylor</code> são consideradas terem precisão infinita.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>taytorat</b><i> (<var>expr</var>)</i>
<a name="IDX1038"></a>
</dt>
<dd><p>Converte <var>expr</var> da forma <code>taylor</code> para a forma de expressão racional canónica (CRE).
O efeito é o mesmo que <code>rat (ratdisrep (<var>expr</var>))</code>, mas mais rápido.
</p>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>trunc</b><i> (<var>expr</var>)</i>
<a name="IDX1039"></a>
</dt>
<dd><p>Coloca notas na representação interna da expressão geral <var>expr</var>
de modo que isso é mostrado como se suas adições forem séries de Taylor truncadas.
<var>expr</var> is not otherwise modified.
</p>
<p>Exemplo:
</p>
<pre class="example">(%i1) expr: x^2 + x + 1;
                            2
(%o1)                      x  + x + 1
(%i2) trunc (expr);
                                2
(%o2)                  1 + x + x  + . . .
(%i3) is (expr = trunc (expr));
(%o3)                         true
</pre>
</dd></dl>

<dl>
<dt><u>Função:</u> <b>unsum</b><i> (<var>f</var>, <var>n</var>)</i>
<a name="IDX1040"></a>
</dt>
<dd><p>Retorna a primeira diferençã de trás para frente <code><var>f</var>(<var>n</var>) - <var>f</var>(<var>n</var> - 1)</code>.
Dessa forma <code>unsum</code> logicamente é a inversa de <code>sum</code>.
</p>
<p>Veja também <code>nusum</code>.
</p>
<p>Exemplos:
</p>
<pre class="example">(%i1) g(p) := p*4^n/binomial(2*n,n);
                                     n
                                  p 4
(%o1)               g(p) := ----------------
                            binomial(2 n, n)
(%i2) g(n^4);
                              4  n
                             n  4
(%o2)                   ----------------
                        binomial(2 n, n)
(%i3) nusum (%, n, 0, n);
                     4        3       2              n
      2 (n + 1) (63 n  + 112 n  + 18 n  - 22 n + 3) 4      2
(%o3) ------------------------------------------------ - ------
                    693 binomial(2 n, n)                 3 11 7
(%i4) unsum (%, n);
                              4  n
                             n  4
(%o4)                   ----------------
                        binomial(2 n, n)
</pre>
</dd></dl>

<dl>
<dt><u>Variável de opção:</u> <b>verbose</b>
<a name="IDX1041"></a>
</dt>
<dd><p>Valor por omissão: <code>false</code>
</p>
<p>Quando <code>verbose</code> for <code>true</code>,
<code>powerseries</code> mostra mensagens de progresso.
</p>
</dd></dl>


<hr size="6">
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC120" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_31.html#SEC123" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_72.html#SEC272" title="Index">&Iacute;ndice</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<p>
 <font size="-1">
  This document was generated by <em>Robert Dodier</em> on <em>Janeiro, 9 2015</em> using <a href="http://texi2html.cvshome.org/"><em>texi2html 1.76</em></a>.
 </font>
 <br>

</p>
</body>
</html>
