<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html401/loose.dtd">
<html>
<!-- Created on abril, 9 2015 by texi2html 1.76 -->
<!--
Written by: Lionel Cons <Lionel.Cons@cern.ch> (original author)
            Karl Berry  <karl@freefriends.org>
            Olaf Bachmann <obachman@mathematik.uni-kl.de>
            and many others.
Maintained by: Many creative people <dev@texi2html.cvshome.org>
Send bugs and suggestions to <users@texi2html.cvshome.org>

-->
<head>
<title>Manual de Maxima 5.36.0: 44. descriptive</title>

<meta name="description" content="Manual de Maxima 5.36.0: 44. descriptive">
<meta name="keywords" content="Manual de Maxima 5.36.0: 44. descriptive">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="texi2html 1.76">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
pre.display {font-family: serif}
pre.format {font-family: serif}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: serif; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: serif; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.sansserif {font-family:sans-serif; font-weight:normal;}
ul.toc {list-style: none}
body {color: black; background: white;  margin-left: 8%; margin-right: 13%;
      font-family: "FreeSans", sans-serif}
h1 {font-size: 150%; font-family: "FreeSans", sans-serif}
h2 {font-size: 125%; font-family: "FreeSans", sans-serif}
h3 {font-size: 100%; font-family: "FreeSans", sans-serif}
a[href] {color: rgb(0,0,255); text-decoration: none;}
a[href]:hover {background: rgb(220,220,220);}
div.textbox {border: solid; border-width: thin; padding-top: 1em;
    padding-bottom: 1em; padding-left: 2em; padding-right: 2em}
div.titlebox {border: none; padding-top: 1em; padding-bottom: 1em;
    padding-left: 2em; padding-right: 2em; background: rgb(200,255,255);
    font-family: sans-serif}
div.synopsisbox {
    border: none; padding-top: 1em; padding-bottom: 1em; padding-left: 2em;
    padding-right: 2em; background: rgb(255,220,255);}
pre.example {border: 1px solid rgb(180,180,180); padding-top: 1em;
    padding-bottom: 1em; padding-left: 1em; padding-right: 1em;
    background-color: rgb(238,238,255)}
div.spacerbox {border: none; padding-top: 2em; padding-bottom: 2em}
div.image {margin: 0; padding: 1em; text-align: center}
div.categorybox {border: 1px solid gray; padding-top: 0px; padding-bottom: 0px;
    padding-left: 1em; padding-right: 1em; background: rgb(247,242,220)}

-->
</style>

<link rel="icon" href="../figures/favicon.ico"/>
</head>

<body lang="es" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">

<a name="descriptive"></a>
<a name="SEC229"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="maxima_43.html#SEC228" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC230" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima_43.html#SEC223" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_45.html#SEC234" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_80.html#SEC380" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h1 class="chapter"> 44. descriptive </h1>

<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC230">44.1 Introducción a descriptive</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC231">44.2 Funciones y variables para el tratamiento de datos</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC232">44.3 Funciones y variables de parámetros descriptivos</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC233">44.4 Funciones y variables para gráficos estadísticos</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
</table>

<hr size="6">
<a name="Introducci_00f3n-a-descriptive"></a>
<a name="SEC230"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC229" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC231" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC229" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC229" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_45.html#SEC234" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_80.html#SEC380" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 44.1 Introducción a descriptive </h2>


<p>El paquete <code>descriptive</code> contiene funciones para realizar 
cl'culos y gráficos estadísticos descriptivos. 
Junto con el código fuente se distribuyen tres conjuntos de datos: 
<code>pidigits.data</code>, <code>wind.data</code> y <code>biomed.data</code>.
</p>
<p>Cualquier manual de estadística se puede utilizar como referencia al paquete <code>descriptive</code>.
</p>
<p>Para comentarios, fallos y sugerencias, por favor contactar con <var>'mario AT edu DOT xunta DOT es'</var>.
</p>
<p>Aquí un sencillo ejemplo sobre cómo operan las funciones de <code>descriptive</code>, dependiendo de la naturaleza de sus argumentos, listas o matrices,
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) /* muestra univariate */   mean ([a, b, c]);
                            c + b + a
(%o2)                       ---------
                                3
(%i3) matrix ([a, b], [c, d], [e, f]);
                            [ a  b ]
                            [      ]
(%o3)                       [ c  d ]
                            [      ]
                            [ e  f ]
(%i4) /* muestra multivariante */ mean (%);
                      e + c + a  f + d + b
(%o4)                [---------, ---------]
                          3          3
</pre>
<p>Nótese que en las muestras multivariantes la media se calcula para cada columna.
</p>
<p>En caso de varias muestras de diferente tamaño, la función <code>map</code> de Maxima puede utilizarse para obtener los resultados deseados para cada muestra,
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) map (mean, [[a, b, c], [d, e]]);
                        c + b + a  e + d
(%o2)                  [---------, -----]
                            3        2
</pre>
<p>En este caso, dos muestras de tamaños 3 y 2 han sido almacenadas en una lista.
</p>
<p>Muestras univariantes deben guardarse en listas como en
</p>
<pre class="example">(%i1) s1 : [3, 1, 4, 1, 5, 9, 2, 6, 5, 3, 5];
(%o1)           [3, 1, 4, 1, 5, 9, 2, 6, 5, 3, 5]
</pre>
<p>y muestras multivariantes en matrices como las del siguiente ejemplo
</p>
<pre class="example">(%i1) s2 : matrix ([13.17, 9.29], [14.71, 16.88], [18.50, 16.88],
             [10.58, 6.63], [13.33, 13.25], [13.21,  8.12]);
                        [ 13.17  9.29  ]
                        [              ]
                        [ 14.71  16.88 ]
                        [              ]
                        [ 18.5   16.88 ]
(%o1)                   [              ]
                        [ 10.58  6.63  ]
                        [              ]
                        [ 13.33  13.25 ]
                        [              ]
                        [ 13.21  8.12  ]
</pre>
<p>En este caso, el número de columnas es igual al de la dimensión de la variable aleatoria y el número de filas coincide con el tamaño muestral.
</p>
<p>Los datos pueden suministrarse manualmente, pero las muestras grandes se suelen almacenar en ficheros de texto. Por ejemplo, el fichero <code>pidigits.data</code> contiene los 100 primeros dígitos del número <code>%pi</code>:
</p><pre class="example">      3
      1
      4
      1
      5
      9
      2
      6
      5
      3 ...
</pre>
<p>A fin de leer estos dígitos desde Maxima,
</p>
<pre class="example">(%i1) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i2) length (s1);
(%o2)                          100
</pre>
<p>Por otro lado, el archivo <code>wind.data</code> contiene los promedios diarios de la velocidad del viento en cinco estaciones meteorológicas en Irlanda (esta muestra es parte de un conjunto de datos correspondientes a 12 estaciones meteorológicas. El fichero original se puede descargar libremente del 'StatLib Data Repository' y se analiza en  Haslett, J., Raftery, A. E. (1989) <var>Space-time Modelling with Long-memory Dependence: Assessing Ireland's Wind Power Resource, with Discussion</var>. Applied Statistics 38, 1-50). Así se leen los datos:
</p>
<pre class="example">(%i1) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i2) length (s2);
(%o2)                          100
(%i3) s2 [%]; /* last record */
(%o3)            [3.58, 6.0, 4.58, 7.62, 11.25]
</pre>
<p>Algunas muestras contienen datos no numéricos. Como ejemplo, el archivo <code>biomed.data</code> (el cual es parte de otro mayor descargado también del 'StatLib Data Repository') contiene cuatro mediciones sanguíneas tomadas a dos grupos de pacientes, <code>A</code> y <code>B</code>, de diferentes edades,
</p>
<pre class="example">(%i1) s3 : read_matrix (file_search (&quot;biomed.data&quot;))$
(%i2) length (s3);
(%o2)                          100
(%i3) s3 [1]; /* first record */
(%o3)            [A, 30, 167.0, 89.0, 25.6, 364]
</pre>
<p>El primer individuo pertenece al grupo <code>A</code>, tiene 30 años de edad y sus medidas sanguíneas fueron 167.0, 89.0, 25.6 y 364.
</p>
<p>Debe tenerse cuidado cuando se trabaje con datos categóricos. En el siguiente ejemplo, se asigna al símbolo <code>a</code> cierto valor en algún momento previo y luego se toma una muestra con el valor categórico <code>a</code>,
</p>
<pre class="example">(%i1) a : 1$
(%i2) matrix ([a, 3], [b, 5]);
                            [ 1  3 ]
(%o2)                       [      ]
                            [ b  5 ]
</pre>

<hr size="6">
<a name="Funciones-y-variables-para-el-tratamiento-de-datos"></a>
<a name="SEC231"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC230" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC232" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC229" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC229" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_45.html#SEC234" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_80.html#SEC380" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 44.2 Funciones y variables para el tratamiento de datos </h2>



<dl>
<dt><u>Función:</u> <b>build_sample</b><i> (<var>list</var>)</i>
<a name="IDX1619"></a>
</dt>
<dt><u>Función:</u> <b>build_sample</b><i> (<var>matrix</var>)</i>
<a name="IDX1620"></a>
</dt>
<dd><p>Construye una muestra a partir de una tabla de frecuencias absolutas.
La tabla de entrada puede ser una una matriz o una lista de listas,
todas ellas de igual tamaño. El número de columnas o la longitud de
las listas debe ser mayor que la unidad. El último elemento de cada
fila o lista se interpreta como la frecuencia absoluta.
El resultado se devuelve siempre en formato de matriz.
</p>
<p>Ejemplos:
</p>
<p>Tabla de frecuencias univariante.
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) sam1: build_sample([[6,1], [j,2], [2,1]]);
                       [ 6 ]
                       [   ]
                       [ j ]
(%o2)                  [   ]
                       [ j ]
                       [   ]
                       [ 2 ]
(%i3) mean(sam1);
                      2 j + 8
(%o3)                [-------]
                         4
(%i4) barsplot(sam1) $
</pre>
<p>Tabla de frecuencias multivariante.
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) sam2: build_sample([[6,3,1], [5,6,2], [u,2,1],[6,8,2]]) ;
                           [ 6  3 ]
                           [      ]
                           [ 5  6 ]
                           [      ]
                           [ 5  6 ]
(%o2)                      [      ]
                           [ u  2 ]
                           [      ]
                           [ 6  8 ]
                           [      ]
                           [ 6  8 ]
(%i3) cov(sam2);
       [   2                 2                            ]
       [  u  + 158   (u + 28)     2 u + 174   11 (u + 28) ]
       [  -------- - ---------    --------- - ----------- ]
(%o3)  [     6          36            6           12      ]
       [                                                  ]
       [ 2 u + 174   11 (u + 28)            21            ]
       [ --------- - -----------            --            ]
       [     6           12                 4             ]
(%i4) barsplot(sam2, grouping=stacked) $
</pre></dd></dl>



<dl>
<dt><u>Función:</u> <b>continuous_freq</b><i> (<var>list</var>)</i>
<a name="IDX1621"></a>
</dt>
<dt><u>Función:</u> <b>continuous_freq</b><i> (<var>list</var>, <var>m</var>)</i>
<a name="IDX1622"></a>
</dt>
<dd><p>El argumento de <code>continuous_freq</code> debe ser una lista de números.
Divide el rango en intervalos y cuenta cuántos valores hay en ellos.
El segundo argumento es opcional y puede ser el número de clases 
deseado, 10 por defecto, o una lista que contenga los límites
de las clases y el número de éstas, o una lista que contenga
únicamente los límites. Si los valores muestrales
son todos iguales, esta función devuelve solamente una clase 
de amplitud 2.
</p>
<p>Ejemplos:
</p>
<p>El argumento opcional indica el número de clases deseadas. 
La primera lista de la respuesta contiene los límites
de los intervalos y la segunda los totales correspondientes: hay 16
dígitos en el intervalo <code>[0, 1.8]</code>, 24 en 
<code>(1.8, 3.6]</code> y así sucesivamente.
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) continuous_freq (s1, 5);
(%o3) [[0, 1.8, 3.6, 5.4, 7.2, 9.0], [16, 24, 18, 17, 25]]
</pre>
<p>El argumento opcional indica que queremos 7 clases con 
límites -2 y 12:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) continuous_freq (s1, [-2,12,7]);
(%o3) [[- 2, 0, 2, 4, 6, 8, 10, 12], [8, 20, 22, 17, 20, 13, 0]]
</pre>
<p>El argumento opcional indica que queremos el número por defecto
de clases y límites -2 y 12:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) continuous_freq (s1, [-2,12]);
                3  4  11  18     32  39  46  53
(%o3)  [[- 2, - -, -, --, --, 5, --, --, --, --, 12], 
                5  5  5   5      5   5   5   5
               [0, 8, 20, 12, 18, 9, 8, 25, 0, 0]]
</pre>
</dd></dl>



<dl>
<dt><u>Función:</u> <b>discrete_freq</b><i> (<var>list</var>)</i>
<a name="IDX1623"></a>
</dt>
<dd><p>Calcula las frecuencias absolutas en muestras discretas, tanto numéricas como categóricas. Su único argumento debe ser una lista.
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) discrete_freq (s1);
(%o3) [[0, 1, 2, 3, 4, 5, 6, 7, 8, 9], 
                             [8, 8, 12, 12, 10, 8, 9, 8, 12, 13]]
</pre>

<p>La primera lista son los valores de la muestra y la segunda sus frecuencias absolutas. Las instrucciones <code>? col</code> y 
<code>? transpose</code> pueden ayudar a comprender la última entrada.
</p></dd></dl>



<dl>
<dt><u>Función:</u> <b>standardize</b><i> (<var>list</var>)</i>
<a name="IDX1624"></a>
</dt>
<dt><u>Función:</u> <b>standardize</b><i> (<var>matrix</var>)</i>
<a name="IDX1625"></a>
</dt>
<dd><p>Resta a cada elemento de la lista la media muestral y luego divide el resultado por
la desviación típica. Si la entrada es una matriz, <code>standardize</code> 
resta a cada fila la media multivariante y luego divide cada componente por la
desviación típica correspondiente.
</p>
</dd></dl>




<dl>
<dt><u>Función:</u> <b>subsample</b><i> (<var>data_matrix</var>, <var>predicate_function</var>)</i>
<a name="IDX1626"></a>
</dt>
<dt><u>Función:</u> <b>subsample</b><i> (<var>data_matrix</var>, <var>predicate_function</var>, <var>col_num</var>, <var>col_num</var>, ...)</i>
<a name="IDX1627"></a>
</dt>
<dd><p>Esta es una variante de la función <code>submatrix</code> de Maxima.
El primer argumento es una matriz de datos, el segundo es una 
función de predicado y el resto de argumentos opcionales son
los números de las columnas a tomar en consideración.
</p>
<p>Estos son los registros multivariantes en los que la velocidad del viento
en la primera estación meteorológica fue menor de 18 nudos. Véase 
cómo en la expresión lambda la <var>i</var>-ésima componente 
se la referencia como <code>v[i]</code>.
</p><pre class="example">(%i1) load (descriptive)$
(%i2) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i3) subsample (s2, lambda([v], v[1] &gt; 18));
              [ 19.38  15.37  15.12  23.09  25.25 ]
              [                                   ]
              [ 18.29  18.66  19.08  26.08  27.63 ]
(%o3)         [                                   ]
              [ 20.25  21.46  19.95  27.71  23.38 ]
              [                                   ]
              [ 18.79  18.96  14.46  26.38  21.84 ]
</pre>
<p>En el siguiente ejemplo, se solicitan únicamente la primera, segunda y
quinta componentes de aquellos registros con velocidades del viento mayores
o iguales que 16 nudos en la estación número 1 y menores que 25 nudos
en la estación número 4. La muestra sólo contiene los datos referidos
a las estaciones 1, 2 y 5. En este caso, la función de predicado se
define por medio de una función de Maxima ordinaria.
</p><pre class="example">(%i1) load (descriptive)$
(%i2) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i3) g(x):= x[1] &gt;= 16 and x[4] &lt; 25$
(%i4) subsample (s2, g, 1, 2, 5);
                     [ 19.38  15.37  25.25 ]
                     [                     ]
                     [ 17.33  14.67  19.58 ]
(%o4)                [                     ]
                     [ 16.92  13.21  21.21 ]
                     [                     ]
                     [ 17.25  18.46  23.87 ]
</pre>
<p>He aquí un ejemplo con las variables categóricas de <code>biomed.data</code>.
Se piden los registros correspondientes a aquellos pacientes del grupo <code>B</code> mayores de 38 anños,
</p><pre class="example">(%i1) load (descriptive)$
(%i2) s3 : read_matrix (file_search (&quot;biomed.data&quot;))$
(%i3) h(u):= u[1] = B and u[2] &gt; 38 $
(%i4) subsample (s3, h);
                [ B  39  28.0  102.3  17.1  146 ]
                [                               ]
                [ B  39  21.0  92.4   10.3  197 ]
                [                               ]
                [ B  39  23.0  111.5  10.0  133 ]
                [                               ]
                [ B  39  26.0  92.6   12.3  196 ]
(%o4)           [                               ]
                [ B  39  25.0  98.7   10.0  174 ]
                [                               ]
                [ B  39  21.0  93.2   5.9   181 ]
                [                               ]
                [ B  39  18.0  95.0   11.3  66  ]
                [                               ]
                [ B  39  39.0  88.5   7.6   168 ]
</pre>
<p>Es probable que el análisis estadístico
requiera únicamente de las medidas sanguíneas.
</p><pre class="example">(%i1) load (descriptive)$
(%i2) s3 : read_matrix (file_search (&quot;biomed.data&quot;))$
(%i3) subsample (s3, lambda([v], v[1] = B and v[2] &gt; 38),
           3, 4, 5, 6);
                   [ 28.0  102.3  17.1  146 ]
                   [                        ]
                   [ 21.0  92.4   10.3  197 ]
                   [                        ]
                   [ 23.0  111.5  10.0  133 ]
                   [                        ]
                   [ 26.0  92.6   12.3  196 ]
(%o3)              [                        ]
                   [ 25.0  98.7   10.0  174 ]
                   [                        ]
                   [ 21.0  93.2   5.9   181 ]
                   [                        ]
                   [ 18.0  95.0   11.3  66  ]
                   [                        ]
                   [ 39.0  88.5   7.6   168 ]
</pre>
<p>Esta es la media multivariante de <code>s3</code>.
</p><pre class="example">(%i1) load (descriptive)$
(%i2) s3 : read_matrix (file_search (&quot;biomed.data&quot;))$
(%i3) mean (s3);
       65 B + 35 A  317          6 NA + 8145.0
(%o3) [-----------, ---, 87.178, -------------, 18.123, 
           100      10                100
                                                    3 NA + 19587
                                                    ------------]
                                                        100
</pre>
<p>Aquí la primera componente carece de significado, ya que tanto <code>A</code> como <code>B</code> son categóricas, la segunda componente es la edad media de los individuos en forma racional, al tiempo que los valores cuarto y quinto muestran cierto comportamiento extraño; lo cual se debe a que el símbolo <code>NA</code> se utiliza para indicar datos <i>no disponibles</i>, por lo que ambas medias no tienen sentido. Una posible solución puede ser extraer de la matriz aquellas filas con símbolos <code>NA</code>, lo que acarrearía cierta pérdida de información.
</p><pre class="example">(%i1) load (descriptive)$
(%i2) s3 : read_matrix (file_search (&quot;biomed.data&quot;))$
(%i3) g(v):= v[4] # NA and v[6] # NA $
(%i4) mean (subsample (s3, g, 3, 4, 5, 6));
(%o4) [79.4923076923077, 86.2032967032967, 16.93186813186813, 
                                                            2514
                                                            ----]
                                                             13
</pre></dd></dl>





<dl>
<dt><u>Función:</u> <b>transform_sample</b><i> (<var>matriz</var>, <var>varlist</var>, <var>exprlist</var>)</i>
<a name="IDX1628"></a>
</dt>
<dd><p>Transforma la <var>matriz</var> de datos, en la que a cada columna se le asigna
un nombre de acuerdo con la lista <var>varlist</var>, según las expresiones de <var>exprlist</var>.
</p>
<p>Ejemplos:
</p>
<p>El segundo argumento asigna nombres a las tres columnas, con ellos la lista de expresiones
define la transformación de la muestra.
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) data: matrix([3,2,7],[3,7,2],[8,2,4],[5,2,4]) $
(%i3) transform_sample(data, [a,b,c], [c, a*b, log(a)]);
                               [ 7  6   log(3) ]
                               [               ]
                               [ 2  21  log(3) ]
(%o3)                          [               ]
                               [ 4  16  log(8) ]
                               [               ]
                               [ 4  10  log(5) ]
</pre>
<p>Añade una columna constante y elimina la tercera variable.
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) data: matrix([3,2,7],[3,7,2],[8,2,4],[5,2,4]) $
(%i3) transform_sample(data, [a,b,c], [makelist(1,k,length(data)),a,b]);
                                  [ 1  3  2 ]
                                  [         ]
                                  [ 1  3  7 ]
(%o3)                             [         ]
                                  [ 1  8  2 ]
                                  [         ]
                                  [ 1  5  2 ]
</pre></dd></dl>





<hr size="6">
<a name="Funciones-y-variables-de-par_00e1metros-descriptivos"></a>
<a name="SEC232"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC231" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC233" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC229" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC229" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_45.html#SEC234" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_80.html#SEC380" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 44.3 Funciones y variables de parámetros descriptivos </h2>


<dl>
<dt><u>Función:</u> <b>mean</b><i> (<var>list</var>)</i>
<a name="IDX1629"></a>
</dt>
<dt><u>Función:</u> <b>mean</b><i> (<var>matrix</var>)</i>
<a name="IDX1630"></a>
</dt>
<dd><p>Es la media muestral, definida como
</p><pre class="example">                       n
                     ====
             _   1   \
             x = -    &gt;    x
                 n   /      i
                     ====
                     i = 1
</pre>

<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) mean (s1);
                               471
(%o3)                          ---
                               100
(%i4) %, numer;
(%o4)                         4.71
(%i5) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i6) mean (s2);
(%o6)     [9.9485, 10.1607, 10.8685, 15.7166, 14.8441]
</pre>
</dd></dl>



<dl>
<dt><u>Función:</u> <b>var</b><i> (<var>list</var>)</i>
<a name="IDX1631"></a>
</dt>
<dt><u>Función:</u> <b>var</b><i> (<var>matrix</var>)</i>
<a name="IDX1632"></a>
</dt>
<dd><p>Es la varianza muestral, definida como
</p><pre class="example">                     n
                   ====
           2   1   \          _ 2
          s  = -    &gt;    (x - x)
               n   /       i
                   ====
                   i = 1
</pre>

<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) var (s1), numer;
(%o3)                   8.425899999999999
</pre>
<p>Véase también <code>var1</code>.
</p></dd></dl>



<dl>
<dt><u>Función:</u> <b>var1</b><i> (<var>list</var>)</i>
<a name="IDX1633"></a>
</dt>
<dt><u>Función:</u> <b>var1</b><i> (<var>matrix</var>)</i>
<a name="IDX1634"></a>
</dt>
<dd><p>Es la cuasivarianza muestral, definida como
</p><pre class="example">                     n
                   ====
               1   \          _ 2
              ---   &gt;    (x - x)
              n-1  /       i
                   ====
                   i = 1
</pre>

<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) var1 (s1), numer;
(%o3)                    8.5110101010101
(%i4) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i5) var1 (s2);
(%o5) [17.39586540404041, 15.13912778787879, 15.63204924242424, 
                            32.50152569696971, 24.66977392929294]
</pre>
<p>Véase también <code>var</code>.
</p></dd></dl>



<dl>
<dt><u>Función:</u> <b>std</b><i> (<var>list</var>)</i>
<a name="IDX1635"></a>
</dt>
<dt><u>Función:</u> <b>std</b><i> (<var>matrix</var>)</i>
<a name="IDX1636"></a>
</dt>
<dd><p>Es la desviación típica muestral, raíz cuadrada de <code>var</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) std (s1), numer;
(%o3)                   2.902740084816414
(%i4) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i5) std (s2);
(%o5) [4.149928523480858, 3.871399812729241, 3.933920277534866, 
                            5.672434260526957, 4.941970881136392]
</pre>
<p>Véanse también <code>var</code> y <code>std1</code>.
</p></dd></dl>



<dl>
<dt><u>Función:</u> <b>std1</b><i> (<var>list</var>)</i>
<a name="IDX1637"></a>
</dt>
<dt><u>Función:</u> <b>std1</b><i> (<var>matrix</var>)</i>
<a name="IDX1638"></a>
</dt>
<dd><p>Es la cuasidesviación típica muestral, raíz cuadrada de <code>var1</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) std1 (s1), numer;
(%o3)                   2.917363553109228
(%i4) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i5) std1 (s2);
(%o5) [4.17083509672109, 3.89090320978032, 3.953738641137555, 
                            5.701010936401517, 4.966867617451963]
</pre>
<p>Véanse también <code>var1</code> y <code>std</code>.
</p></dd></dl>



<dl>
<dt><u>Función:</u> <b>noncentral_moment</b><i> (<var>list</var>, <var>k</var>)</i>
<a name="IDX1639"></a>
</dt>
<dt><u>Función:</u> <b>noncentral_moment</b><i> (<var>matrix</var>, <var>k</var>)</i>
<a name="IDX1640"></a>
</dt>
<dd><p>Es el momento no central de orden <em>k</em>, definido como
</p><pre class="example">                       n
                     ====
                 1   \      k
                 -    &gt;    x
                 n   /      i
                     ====
                     i = 1
</pre>

<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) noncentral_moment (s1, 1), numer; /* the mean */
(%o3)                         4.71
(%i5) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%o5) [319793.8724761506, 320532.1923892463, 391249.5621381556, 
                            2502278.205988911, 1691881.797742255]
(%i6) noncentral_moment (s2, 5);
</pre>
<p>Véase también <code>central_moment</code>.
</p></dd></dl>



<dl>
<dt><u>Función:</u> <b>central_moment</b><i> (<var>list</var>, <var>k</var>)</i>
<a name="IDX1641"></a>
</dt>
<dt><u>Función:</u> <b>central_moment</b><i> (<var>matrix</var>, <var>k</var>)</i>
<a name="IDX1642"></a>
</dt>
<dd><p>Es el momento central de orden <em>k</em>, definido como
</p><pre class="example">                    n
                  ====
              1   \          _ k
              -    &gt;    (x - x)
              n   /       i
                  ====
                  i = 1
</pre>

<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) central_moment (s1, 2), numer; /* the variance */
(%o3)                   8.425899999999999
(%i5) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%o5) [11.29584771375004, 16.97988248298583, 5.626661952750102, 
                             37.5986572057918, 25.85981904394192]
(%i6) central_moment (s2, 3);
</pre>
<p>Véanse también <code>central_moment</code> y <code>mean</code>.
</p></dd></dl>


<dl>
<dt><u>Función:</u> <b>cv</b><i> (<var>list</var>)</i>
<a name="IDX1643"></a>
</dt>
<dt><u>Función:</u> <b>cv</b><i> (<var>matrix</var>)</i>
<a name="IDX1644"></a>
</dt>
<dd><p>Es el coeficiente de variación, o cociente entre la desviación típica muestral (<code>std</code>) y la media (<code>mean</code>),
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) cv (s1), numer;
(%o3)                   .6193977819764815
(%i4) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i5) cv (s2);
(%o5) [.4192426091090204, .3829365309260502, 0.363779605385983, 
                            .3627381836021478, .3346021393989506]
</pre>
<p>Véanse también <code>std</code> y <code>mean</code>.
</p></dd></dl>



<dl>
<dt><u>Función:</u> <b>smin</b><i> (<var>list</var>)</i>
<a name="IDX1645"></a>
</dt>
<dt><u>Función:</u> <b>smin</b><i> (<var>matrix</var>)</i>
<a name="IDX1646"></a>
</dt>
<dd><p>Es el valor mínimo de la muestra <var>list</var>.
Cuando el argumento es una matriz, <code>smin</code> devuelve
una lista con los valores mínimos de las
columnas, las cuales están asociadas a variables
estadísticas.
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) smin (s1);
(%o3)                           0
(%i4) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i5) smin (s2);
(%o5)             [0.58, 0.5, 2.67, 5.25, 5.17]
</pre>
<p>Véase también <code>smax</code>.
</p></dd></dl>



<dl>
<dt><u>Función:</u> <b>smax</b><i> (<var>list</var>)</i>
<a name="IDX1647"></a>
</dt>
<dt><u>Función:</u> <b>smax</b><i> (<var>matrix</var>)</i>
<a name="IDX1648"></a>
</dt>
<dd><p>Es el valor máximo de la muestra <var>list</var>.
Cuando el argumento es una matriz, <code>smax</code> devuelve
una lista con los valores máximos de las
columnas, las cuales están asociadas a variables
estadísticas.
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) smax (s1);
(%o3)                           9
(%i4) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i5) smax (s2);
(%o5)          [20.25, 21.46, 20.04, 29.63, 27.63]
</pre>
<p>Véase también <code>smin</code>.
</p></dd></dl>



<dl>
<dt><u>Función:</u> <b>range</b><i> (<var>list</var>)</i>
<a name="IDX1649"></a>
</dt>
<dt><u>Función:</u> <b>range</b><i> (<var>matrix</var>)</i>
<a name="IDX1650"></a>
</dt>
<dd><p>Es la diferencia entre los valores extremos.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) range (s1);
(%o3)                           9
(%i4) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i5) range (s2);
(%o5)          [19.67, 20.96, 17.37, 24.38, 22.46]
</pre>
</dd></dl>



<dl>
<dt><u>Función:</u> <b>quantile</b><i> (<var>list</var>, <var>p</var>)</i>
<a name="IDX1651"></a>
</dt>
<dt><u>Función:</u> <b>quantile</b><i> (<var>matrix</var>, <var>p</var>)</i>
<a name="IDX1652"></a>
</dt>
<dd><p>Es el <var>p</var>-cuantil, siendo <var>p</var> un número del intervalo <em>[0, 1]</em>, de la muestra <var>list</var>.
Aunque existen varias definiciones para el cuantil muestral (Hyndman, R. J., Fan, Y. (1996) <var>Sample quantiles in statistical packages</var>. American Statistician, 50, 361-365), la programada en el paquete  <code>descriptive</code> es la basada en la interpolación lineal.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) /* 1st and 3rd quartiles */
         [quantile (s1, 1/4), quantile (s1, 3/4)], numer;
(%o3)                      [2.0, 7.25]
(%i4) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i5) quantile (s2, 1/4);
(%o5)    [7.2575, 7.477500000000001, 7.82, 11.28, 11.48]
</pre>
</dd></dl>



<dl>
<dt><u>Función:</u> <b>median</b><i> (<var>list</var>)</i>
<a name="IDX1653"></a>
</dt>
<dt><u>Función:</u> <b>median</b><i> (<var>matrix</var>)</i>
<a name="IDX1654"></a>
</dt>
<dd><p>Una vez ordenada una muestra, si el tamaño muestral es impar la mediana es el valor central, en caso contrario será la media de los dos valores centrales.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) median (s1);
                                9
(%o3)                           -
                                2
(%i4) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i5) median (s2);
(%o5)         [10.06, 9.855, 10.73, 15.48, 14.105]
</pre>
<p>La mediana es el cuantil 1/2.
</p>
<p>Véase también <code>quantile</code>.
</p></dd></dl>



<dl>
<dt><u>Función:</u> <b>qrange</b><i> (<var>list</var>)</i>
<a name="IDX1655"></a>
</dt>
<dt><u>Función:</u> <b>qrange</b><i> (<var>matrix</var>)</i>
<a name="IDX1656"></a>
</dt>
<dd><p>El rango intercuartílico es la diferencia entre el tercer y primer cuartil,
<code>quantile(<var>list</var>,3/4) - quantile(<var>list</var>,1/4)</code>,
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) qrange (s1);
                               21
(%o3)                          --
                               4
(%i4) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i5) qrange (s2);
(%o5) [5.385, 5.572499999999998, 6.0225, 8.729999999999999, 
                                               6.650000000000002]
</pre>
<p>Véase también <code>quantile</code>.
</p></dd></dl>



<dl>
<dt><u>Función:</u> <b>mean_deviation</b><i> (<var>list</var>)</i>
<a name="IDX1657"></a>
</dt>
<dt><u>Función:</u> <b>mean_deviation</b><i> (<var>matrix</var>)</i>
<a name="IDX1658"></a>
</dt>
<dd><p>Es la desviación media, definida como
</p><pre class="example">                     n
                   ====
               1   \          _
               -    &gt;    |x - x|
               n   /       i
                   ====
                   i = 1
</pre>

<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) mean_deviation (s1);
                               51
(%o3)                          --
                               20
(%i4) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i5) mean_deviation (s2);
(%o5) [3.287959999999999, 3.075342, 3.23907, 4.715664000000001, 
                                               4.028546000000002]
</pre>
<p>Véase también <code>mean</code>.
</p></dd></dl>



<dl>
<dt><u>Función:</u> <b>median_deviation</b><i> (<var>list</var>)</i>
<a name="IDX1659"></a>
</dt>
<dt><u>Función:</u> <b>median_deviation</b><i> (<var>matrix</var>)</i>
<a name="IDX1660"></a>
</dt>
<dd><p>Es la desviación mediana, definida como
</p><pre class="example">                 n
               ====
           1   \
           -    &gt;    |x - med|
           n   /       i
               ====
               i = 1
</pre>
<p>siendo <code>med</code> la mediana de <var>list</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) median_deviation (s1);
                                5
(%o3)                           -
                                2
(%i4) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i5) median_deviation (s2);
(%o5)           [2.75, 2.755, 3.08, 4.315, 3.31]
</pre>
<p>Véase también <code>mean</code>.
</p></dd></dl>



<dl>
<dt><u>Función:</u> <b>harmonic_mean</b><i> (<var>list</var>)</i>
<a name="IDX1661"></a>
</dt>
<dt><u>Función:</u> <b>harmonic_mean</b><i> (<var>matrix</var>)</i>
<a name="IDX1662"></a>
</dt>
<dd><p>Es la media armónica, definida como
</p><pre class="example">                  n
               --------
                n
               ====
               \     1
                &gt;    --
               /     x
               ====   i
               i = 1
</pre>

<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) y : [5, 7, 2, 5, 9, 5, 6, 4, 9, 2, 4, 2, 5]$
(%i3) harmonic_mean (y), numer;
(%o3)                   3.901858027632205
(%i4) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i5) harmonic_mean (s2);
(%o5) [6.948015590052786, 7.391967752360356, 9.055658197151745, 
                            13.44199028193692, 13.01439145898509]
</pre>
<p>Véanse también <code>mean</code> y <code>geometric_mean</code>.
</p></dd></dl>



<dl>
<dt><u>Función:</u> <b>geometric_mean</b><i> (<var>list</var>)</i>
<a name="IDX1663"></a>
</dt>
<dt><u>Función:</u> <b>geometric_mean</b><i> (<var>matrix</var>)</i>
<a name="IDX1664"></a>
</dt>
<dd><p>Es la media geométrica, definida como
</p><pre class="example">                 /  n      \ 1/n
                 | /===\   |
                 |  ! !    |
                 |  ! !  x |
                 |  ! !   i|
                 | i = 1   |
                 \         /
</pre>

<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) y : [5, 7, 2, 5, 9, 5, 6, 4, 9, 2, 4, 2, 5]$
(%i3) geometric_mean (y), numer;
(%o3)                   4.454845412337012
(%i4) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i5) geometric_mean (s2);
(%o5) [8.82476274347979, 9.22652604739361, 10.0442675714889, 
                            14.61274126349021, 13.96184163444275]
</pre>
<p>Véanse también <code>mean</code> y <code>harmonic_mean</code>.
</p></dd></dl>



<dl>
<dt><u>Función:</u> <b>kurtosis</b><i> (<var>list</var>)</i>
<a name="IDX1665"></a>
</dt>
<dt><u>Función:</u> <b>kurtosis</b><i> (<var>matrix</var>)</i>
<a name="IDX1666"></a>
</dt>
<dd><p>Es el coeficiente de curtosis, definido como
</p><pre class="example">                    n
                  ====
            1     \          _ 4
           ----    &gt;    (x - x)  - 3
              4   /       i
           n s    ====
                  i = 1
</pre>

<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) kurtosis (s1), numer;
(%o3)                  - 1.273247946514421
(%i4) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i5) kurtosis (s2);
(%o5) [- .2715445622195385, 0.119998784429451, 
   - .4275233490482866, - .6405361979019522, - .4952382132352935]
</pre>
<p>Véanse también <code>mean</code>, <code>var</code> y <code>skewness</code>.
</p></dd></dl>



<dl>
<dt><u>Función:</u> <b>skewness</b><i> (<var>list</var>)</i>
<a name="IDX1667"></a>
</dt>
<dt><u>Función:</u> <b>skewness</b><i> (<var>matrix</var>)</i>
<a name="IDX1668"></a>
</dt>
<dd><p>Es el coeficiente de asimetría, definido como
</p><pre class="example">                    n
                  ====
            1     \          _ 3
           ----    &gt;    (x - x)
              3   /       i
           n s    ====
                  i = 1
</pre>

<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) skewness (s1), numer;
(%o3)                  .009196180476450306
(%i4) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i5) skewness (s2);
(%o5) [.1580509020000979, .2926379232061854, .09242174416107717, 
                            .2059984348148687, .2142520248890832]
</pre>
<p>Véanse también <code>mean</code>, <code>var</code> y <code>kurtosis</code>.
</p></dd></dl>



<dl>
<dt><u>Función:</u> <b>pearson_skewness</b><i> (<var>list</var>)</i>
<a name="IDX1669"></a>
</dt>
<dt><u>Función:</u> <b>pearson_skewness</b><i> (<var>matrix</var>)</i>
<a name="IDX1670"></a>
</dt>
<dd><p>Es el coeficiente de asimetría de Pearson, definido como
</p><pre class="example">                _
             3 (x - med)
             -----------
                  s
</pre>
<p>siendo <var>med</var> la mediana de <var>list</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) pearson_skewness (s1), numer;
(%o3)                   .2159484029093895
(%i4) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i5) pearson_skewness (s2);
(%o5) [- .08019976629211892, .2357036272952649, 
         .1050904062491204, .1245042340592368, .4464181795804519]
</pre>
<p>Véanse también <code>mean</code>, <code>var</code> y <code>median</code>.
</p></dd></dl>



<dl>
<dt><u>Función:</u> <b>quartile_skewness</b><i> (<var>list</var>)</i>
<a name="IDX1671"></a>
</dt>
<dt><u>Función:</u> <b>quartile_skewness</b><i> (<var>matrix</var>)</i>
<a name="IDX1672"></a>
</dt>
<dd><p>Es el coeficiente de asimetría cuartílico, definido como
</p><pre class="example">               c    - 2 c    + c
                3/4      1/2    1/4
               --------------------
                   c    - c
                    3/4    1/4
</pre>
<p>siendo <em>c_p</em> el <var>p</var>-cuantil de la muestra <var>list</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) quartile_skewness (s1), numer;
(%o3)                  .04761904761904762
(%i4) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i5) quartile_skewness (s2);
(%o5) [- 0.0408542246982353, .1467025572005382, 
       0.0336239103362392, .03780068728522298, 0.210526315789474]
</pre>
<p>Véase también <code>quantile</code>.
</p></dd></dl>




<dl>
<dt><u>Función:</u> <b>cov</b><i> (<var>matrix</var>)</i>
<a name="IDX1673"></a>
</dt>
<dd><p>Es la matriz de covarianzas de una muestra multivariante, definida como
</p><pre class="example">              n
             ====
          1  \           _        _
      S = -   &gt;    (X  - X) (X  - X)'
          n  /       j        j
             ====
             j = 1
</pre>
<p>siendo <em>X_j</em> la <em>j</em>-ésima fila de la matriz muestral.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i3) fpprintprec : 7$  /* change precision for pretty output */
      [ 17.22191  13.61811  14.37217  19.39624  15.42162 ]
      [                                                  ]
      [ 13.61811  14.98774  13.30448  15.15834  14.9711  ]
      [                                                  ]
(%o4) [ 14.37217  13.30448  15.47573  17.32544  16.18171 ]
      [                                                  ]
      [ 19.39624  15.15834  17.32544  32.17651  20.44685 ]
      [                                                  ]
      [ 15.42162  14.9711   16.18171  20.44685  24.42308 ]
(%i5) cov (s2);
</pre>
<p>Véase también <code>cov1</code>.
</p></dd></dl>



<dl>
<dt><u>Función:</u> <b>cov1</b><i> (<var>matrix</var>)</i>
<a name="IDX1674"></a>
</dt>
<dd><p>Es la matriz de cuasivarianzas de una muestra multivariante, definida como
</p><pre class="example">              n
             ====
         1   \           _        _
   S  = ---   &gt;    (X  - X) (X  - X)'
    1   n-1  /       j        j
             ====
             j = 1
</pre>
<p>siendo <em>X_j</em> la <em>j</em>-ésima fila de la matriz muestral.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i3) fpprintprec : 7$ /* change precision for pretty output */
      [ 17.39587  13.75567  14.51734  19.59216  15.5774  ]
      [                                                  ]
      [ 13.75567  15.13913  13.43887  15.31145  15.12232 ]
      [                                                  ]
(%o4) [ 14.51734  13.43887  15.63205  17.50044  16.34516 ]
      [                                                  ]
      [ 19.59216  15.31145  17.50044  32.50153  20.65338 ]
      [                                                  ]
      [ 15.5774   15.12232  16.34516  20.65338  24.66977 ]
(%i5) cov1 (s2);
</pre>
<p>Véase también <code>cov</code>.
</p></dd></dl>



<dl>
<dt><u>Función:</u> <b>global_variances</b><i> (<var>matrix</var>)</i>
<a name="IDX1675"></a>
</dt>
<dt><u>Función:</u> <b>global_variances</b><i> (<var>matrix</var>, <var>options</var> ...)</i>
<a name="IDX1676"></a>
</dt>
<dd><p>La función <code>global_variances</code> devuelve una lista de medidas globales de variabilidad:
</p>
<ul>
<li>
<var>varianza total</var>: <code>trace(S_1)</code>,
</li><li>
<var>varianza media</var>: <code>trace(S_1)/p</code>,
</li><li>
<var>varianza generalizada</var>: <code>determinant(S_1)</code>,
</li><li>
<var>desviación típica generalizada</var>: <code>sqrt(determinant(S_1))</code>,
</li><li>
<var>varianza efectiva</var> <code>determinant(S_1)^(1/p)</code>, (definida en: Peña, D. (2002) <var>Análisis de datos multivariantes</var>; McGraw-Hill, Madrid.)
</li><li>
<var>desviación típica efectiva</var>: <code>determinant(S_1)^(1/(2*p))</code>.
</li></ul>
<p>donde <var>p</var> es la dimensión de la variable aleatoria multivariante y <em>S_1</em> la matriz de covarianzas devuelta por la función <code>cov1</code>.
</p>
<p>Opción:
</p>
<ul>
<li>
<code>'data</code>, por defecto <code>'true</code>, indica si la matriz de entrada contiene los datos muestrales,
en cuyo caso la matriz de covarianzas <code>cov1</code> debe ser calculada; en caso contrario, se le debe
pasar ésta a la función como matriz simétrica en lugar de los datos.
</li></ul>

<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i3) global_variances (s2);
(%o3) [105.338342060606, 21.06766841212119, 12874.34690469686, 
         113.4651792608502, 6.636590811800794, 2.576158149609762]
</pre>
<p>Cálculo de <code>global_variances</code> a partir de la matriz de covarianzas.
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i3) s : cov1 (s2)$
(%i4) global_variances (s, data=false);
(%o4) [105.338342060606, 21.06766841212119, 12874.34690469686, 
         113.4651792608502, 6.636590811800794, 2.576158149609762]
</pre>
<p>Véanse también <code>cov</code> y <code>cov1</code>.
</p></dd></dl>



<dl>
<dt><u>Función:</u> <b>cor</b><i> (<var>matrix</var>)</i>
<a name="IDX1677"></a>
</dt>
<dt><u>Función:</u> <b>cor</b><i> (<var>matrix</var>, <var>options</var> ...)</i>
<a name="IDX1678"></a>
</dt>
<dd><p>Es la matriz de correlaciones de la muestra multivariante.
</p>
<p>Opción:
</p>
<ul>
<li>
<code>'data</code>, por defecto <code>'true</code>, indica si la matriz de entrada contiene los datos muestrales,
en cuyo caso la matriz de covarianzas <code>cov1</code> debe ser calculada; en caso contrario, se le debe
pasar ésta a la función como matriz simétrica en lugar de los datos.
</li></ul>

<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) fpprintprec:7$
(%i3) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i4) cor (s2);
      [   1.0     .8476339  .8803515  .8239624  .7519506 ]
      [                                                  ]
      [ .8476339    1.0     .8735834  .6902622  0.782502 ]
      [                                                  ]
(%o4) [ .8803515  .8735834    1.0     .7764065  .8323358 ]
      [                                                  ]
      [ .8239624  .6902622  .7764065    1.0     .7293848 ]
      [                                                  ]
      [ .7519506  0.782502  .8323358  .7293848    1.0    ]
</pre>
<p>Cálculo de la matriz de correlaciones a partir de la matriz de covarianzas.
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) fpprintprec : 7 $
(%i3) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i4) s : cov1 (s2)$
(%i5) cor (s, data=false); /* this is faster */
      [   1.0     .8476339  .8803515  .8239624  .7519506 ]
      [                                                  ]
      [ .8476339    1.0     .8735834  .6902622  0.782502 ]
      [                                                  ]
(%o5) [ .8803515  .8735834    1.0     .7764065  .8323358 ]
      [                                                  ]
      [ .8239624  .6902622  .7764065    1.0     .7293848 ]
      [                                                  ]
      [ .7519506  0.782502  .8323358  .7293848    1.0    ]
</pre>
<p>Véanse también <code>cov</code> y <code>cov1</code>.
</p></dd></dl>



<dl>
<dt><u>Función:</u> <b>list_correlations</b><i> (<var>matrix</var>)</i>
<a name="IDX1679"></a>
</dt>
<dt><u>Función:</u> <b>list_correlations</b><i> (<var>matrix</var>, <var>options</var> ...)</i>
<a name="IDX1680"></a>
</dt>
<dd><p>La función <code>list_correlations</code> devuelve una lista con medidas de correlación:
</p>
<ul>
<li>
<var>matriz de precisión</var>: es la inversa de la matriz de covarianzas <em>S_1</em>,
<pre class="example">       -1     ij
      S   = (s  )             
       1         i,j = 1,2,...,p
</pre>
</li><li>
<var>multiple correlation vector</var>:  <em>(R_1^2, R_2^2, ..., R_p^2)</em>, with 
<pre class="example">       2          1
      R  = 1 - -------
       i        ii
               s   s
                    ii
</pre><p>es un indicador de la bondad de ajuste del modelo de regresión lineal multivariante de <em>X_i</em> cuando el resto de variables se utilizan como regresores.
</p>
</li><li>
<var>matriz de correlaciones parciales</var>: en la que el elemento <em>(i, j)</em> es
<pre class="example">                         ij
                        s
      r        = - ------------
       ij.rest     / ii  jj\ 1/2
                   |s   s  |
                   \       /
</pre></li></ul>

<p>Opción:
</p>
<ul>
<li>
<code>'data</code>, por defecto <code>'true</code>, indica si la matriz de entrada contiene los datos muestrales,
en cuyo caso la matriz de covarianzas <code>cov1</code> debe ser calculada; en caso contrario, se le debe
pasar ésta a la función como matriz simétrica en lugar de los datos.
</li></ul>

<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i3) z : list_correlations (s2)$
(%i4) fpprintprec : 5$ /* for pretty output */
      [  .38486   - .13856   - .15626   - .10239    .031179  ]
      [                                                      ]
      [ - .13856   .34107    - .15233    .038447   - .052842 ]
      [                                                      ]
(%o5) [ - .15626  - .15233    .47296    - .024816  - .10054  ]
      [                                                      ]
      [ - .10239   .038447   - .024816   .10937    - .034033 ]
      [                                                      ]
      [ .031179   - .052842  - .10054   - .034033   .14834   ]
(%o6)       [.85063, .80634, .86474, .71867, .72675]
       [  - 1.0     .38244   .36627   .49908   - .13049 ]
       [                                                ]
       [  .38244    - 1.0    .37927  - .19907   .23492  ]
       [                                                ]
(%o7)  [  .36627    .37927   - 1.0    .10911    .37956  ]
       [                                                ]
       [  .49908   - .19907  .10911   - 1.0     .26719  ]
       [                                                ]
       [ - .13049   .23492   .37956   .26719    - 1.0   ]
</pre>
<p>Véanse también <code>cov</code> y <code>cov1</code>.
</p></dd></dl>



<dl>
<dt><u>Función:</u> <b>principal_components</b><i> (<var>matrix</var>)</i>
<a name="IDX1681"></a>
</dt>
<dt><u>Función:</u> <b>principal_components</b><i> (<var>matrix</var>, <var>options</var> ...)</i>
<a name="IDX1682"></a>
</dt>
<dd><p>Calcula las componentes principales de una muestra multivariante. Las componentes
principales se utilizan en el análisis estadístico multivariante
para reducir la dimensionalidad de la muestra.
</p>
<p>Opción:
</p>
<ul>
<li>
<code>'data</code>, por defecto <code>'true</code>, indica si la matriz de entrada contiene los datos muestrales,
en cuyo caso la matriz de covarianzas <code>cov1</code> debe ser calculada; en caso contrario, se le debe
pasar ésta a la función como matriz simétrica en lugar de los datos.
</li></ul>

<p>La salida de la función <code>principal_components</code> es una lista con los siguientes resultados:
</p>
<ul>
<li>
varianzas de las componentes principales,
</li><li>
porcentajes de variación total explicada por cada componente principal,
</li><li>
matriz de rotación.
</li></ul>

<p>Ejemplos:
</p>
<p>En este ejemplo, la primera componente explica el 83.13 por ciento de la varianza total.
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i3) fpprintprec:4 $
(%i4) res: principal_components(s2);
0 errors, 0 warnings
(%o4) [[87.57, 8.753, 5.515, 1.889, 1.613], 
[83.13, 8.31, 5.235, 1.793, 1.531], 
[ .4149  .03379   - .4757  - 0.581   - .5126 ]
[                                            ]
[ 0.369  - .3657  - .4298   .7237    - .1469 ]
[                                            ]
[ .3959  - .2178  - .2181  - .2749    .8201  ]]
[                                            ]
[ .5548   .7744    .1857    .2319    .06498  ]
[                                            ]
[ .4765  - .4669   0.712   - .09605  - .1969 ]
(%i5) /* porcentajes acumulados  */
    block([ap: copy(res[2])],
      for k:2 thru length(ap) do ap[k]: ap[k]+ap[k-1],
      ap);
(%o5)                 [83.13, 91.44, 96.68, 98.47, 100.0]
(%i6) /* dimension de la muestra */
      p: length(first(res));
(%o6)                                  5
(%i7) /* dibuja porcentajes para seleccionar el numero de 
         componentes principales para el analisis ulterior */
     draw2d(
        fill_density = 0.2,
        apply(bars, makelist([k, res[2][k], 1/2], k, p)),
        points_joined = true,
        point_type    = filled_circle,
        point_size    = 3,
        points(makelist([k, res[2][k]], k, p)),
        xlabel = &quot;Variances&quot;,
        ylabel = &quot;Percentages&quot;,
        xtics  = setify(makelist([concat(&quot;PC&quot;,k),k], k, p))) $
</pre>
<p>En caso de que la matriz de covarianzas sea conocida, se le puede pasar
a la función, pero debe utilizarse la opción <code>data=false</code>.
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) S: matrix([1,-2,0],[-2,5,0],[0,0,2]);
                                [  1   - 2  0 ]
                                [             ]
(%o2)                           [ - 2   5   0 ]
                                [             ]
                                [  0    0   2 ]
(%i3) fpprintprec:4 $
(%i4) /* el argumento es una matriz de covarianzas */
      res: principal_components(S, data=false);
0 errors, 0 warnings
                                                  [ - .3827  0.0  .9239 ]
                                                  [                     ]
(%o4) [[5.828, 2.0, .1716], [72.86, 25.0, 2.145], [  .9239   0.0  .3827 ]]
                                                  [                     ]
                                                  [   0.0    1.0   0.0  ]
(%i5) /* transformacion para obtener las componentes principales a
         partir de los registros originales */
      matrix([a1,b2,c3],[a2,b2,c2]).last(res);
             [ .9239 b2 - .3827 a1  1.0 c3  .3827 b2 + .9239 a1 ]
(%o5)        [                                                  ]
             [ .9239 b2 - .3827 a2  1.0 c2  .3827 b2 + .9239 a2 ]
</pre>
</dd></dl>





<hr size="6">
<a name="Funciones-y-variables-para-gr_00e1ficos-estad_00edsticos"></a>
<a name="SEC233"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC232" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_45.html#SEC234" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC229" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC229" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_45.html#SEC234" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_80.html#SEC380" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 44.4 Funciones y variables para gráficos estadísticos </h2>


<dl>
<dt><u>Función:</u> <b>barsplot</b><i> (<var>data1</var>, <var>data2</var>, &hellip;, <var>option_1</var>, <var>option_2</var>, &hellip;)</i>
<a name="IDX1683"></a>
</dt>
<dt><u>Función:</u> <b>barsplot_description</b><i> (&hellip;)</i>
<a name="IDX1684"></a>
</dt>
<dd><p>Dibuja diagramas de barras para variables estadísticas
discretas, tanto para una como para más muestras.
</p>
<p><var>data</var> puede ser una lista de resultados provenientes de una muestra
o una matriz de <var>m</var> filas y <var>n</var> columnas, representando <var>n</var> 
muestras de tamaño <var>m</var> cada una.
</p>
<p>Las opciones disponibles son:
</p>
<ul>
<li>
<var>box_width</var> (valor por defecto, <code>3/4</code>): ancho relativo de los rectángulos. Este 
valor debe pertenecer al rango <code>[0,1]</code>.

</li><li>
<var>grouping</var> (valor por defecto, <code>clustered</code>): indica cómo se agrupan las 
diferentes muestras. Son valores válidos: <code>clustered</code> y <code>stacked</code>.

</li><li>
<var>groups_gap</var> (valor por defecto, <code>1</code>): un número positivo que representa
la separación entre dos grupos consecutivos de barras.

</li><li>
<var>bars_colors</var> (valor por defecto, <code>[]</code>): una lista de colores para múltiples 
muestras. Cuando el número de muestras sea mayor que el de colores especificados, 
los colores adicionales necesarios se seleccionan aleatoriamente. Véase <code>color</code> para más
información.

</li><li>
<var>frequency</var> (valor por defecto, <code>absolute</code>): indica la escala de las ordenadas.
Valores admitidos son:  <code>absolute</code>, <code>relative</code> y and <code>percent</code>.

</li><li>
<var>ordering</var> (valor por defecto, <code>orderlessp</code>): los valores admitidos para esta 
opción son: <code>orderlessp</code> y <code>ordergreatp</code>, indicando cómo se deben ordenar
los resultados muestrales sobre el eje-<var>x</var>.

</li><li>
<var>sample_keys</var> (valor por defecto, <code>[]</code>): es una lista de cadenas de 
texto a usar como leyendas. Cuando la lista tenga una longitud diferente de cero o 
del número de muestras, se devolverá un mensaje de error.

</li><li>
<var>start_at</var> (valor por defecto, <code>0</code>): indica a qué altura comienza 
a dibujarse el gráfico de barra sobre el eje de abscisas.

</li><li>
Todas las opciones globales de <code>draw</code>, excepto <code>xtics</code>, que se asigna
internamente por <code>barsplot</code>. Si es necesario que el usuario le dé su propio
valor a esta opción, o quiere construir una escena más compleja,
debe hacer uso de <code>barsplot_description</code>. Véase el ejemplo más abajo.

</li><li>
Las siguientes opciones locales de <code>draw</code>: <code>key</code>, <code>color</code>, 
<code>fill_color</code>, <code>fill_density</code> y <code>line_width</code>. Véase también
<code>bars</code>.

</li></ul>

<p>La función <code>barsplot_description</code> crea un objeto gráfico
útil para formar escenas complejas, junto con otros objetos gráficos.
Se dispone también de la función <code>wxbarsplot</code> para crear
histogramas incorporados en los interfaces wxMaxima y iMaxima.
</p>
<p>Ejemplos:
</p>
<p>Muestra univariante en formato matricial. Frecuencias absolutas.
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) m : read_matrix (file_search (&quot;biomed.data&quot;))$
(%i3) barsplot(
        col(m,2),
        title        = &quot;Ages&quot;,
        xlabel       = &quot;years&quot;,
        box_width    = 1/2,
        fill_density = 3/4)$
</pre>
<p>Dos muestras de diferente tamaño, con frecuencias
relativas y colores definidos por el usuario.
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) l1:makelist(random(10),k,1,50)$
(%i3) l2:makelist(random(10),k,1,100)$
(%i4) barsplot(
        l1,l2,
        box_width    = 1,
        fill_density = 1,
        bars_colors  = [black, grey],
        frequency = relative,
        sample_keys = [&quot;A&quot;, &quot;B&quot;])$
</pre>
<p>Cuatro muestras no numéricas de igual tamaño.
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) barsplot(
        makelist([Yes, No, Maybe][random(3)+1],k,1,50),
        makelist([Yes, No, Maybe][random(3)+1],k,1,50),
        makelist([Yes, No, Maybe][random(3)+1],k,1,50),
        makelist([Yes, No, Maybe][random(3)+1],k,1,50),
        title  = &quot;Asking for something to four groups&quot;,
        ylabel = &quot;# of individuals&quot;,
        groups_gap   = 3,
        fill_density = 0.5,
        ordering     = ordergreatp)$
</pre>
<p>Barras apiladas verticalmente.
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) barsplot(
        makelist([Yes, No, Maybe][random(3)+1],k,1,50),
        makelist([Yes, No, Maybe][random(3)+1],k,1,50),
        makelist([Yes, No, Maybe][random(3)+1],k,1,50),
        makelist([Yes, No, Maybe][random(3)+1],k,1,50),
        title  = &quot;Asking for something to four groups&quot;,
        ylabel = &quot;# of individuals&quot;,
        grouping     = stacked,
        fill_density = 0.5,
        ordering     = ordergreatp)$
</pre>
<p><code>barsplot</code> en un contexto multiplot.
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) l1:makelist(random(10),k,1,50)$
(%i3) l2:makelist(random(10),k,1,100)$
(%i4) bp1 : 
        barsplot_description(
         l1,
         box_width = 1,
         fill_density = 0.5,
         bars_colors = [blue],
         frequency = relative)$
(%i5) bp2 : 
        barsplot_description(
         l2,
         box_width = 1,
         fill_density = 0.5,
         bars_colors = [red],
         frequency = relative)$
(%i6) draw(gr2d(bp1), gr2d(bp2))$
</pre>
<p>Para las opciones relacionadas con los diagramas de barras, véase <code>bars</code>
del paquete <code>draw</code>.
</p>
<p>Véanse también las funciones <code>histogram</code> y <code>piechart</code>.
</p></dd></dl>



<dl>
<dt><u>Función:</u> <b>boxplot</b><i> (<var>data</var>)</i>
<a name="IDX1685"></a>
</dt>
<dt><u>Función:</u> <b>boxplot</b><i> (<var>data</var>, <var>option_1</var>, <var>option_2</var>, &hellip;)</i>
<a name="IDX1686"></a>
</dt>
<dt><u>Función:</u> <b>boxplot_description</b><i> (&hellip;)</i>
<a name="IDX1687"></a>
</dt>
<dd><p>Dibuja diagramas de cajas (box-and-whishker). El argumento <var>data</var> puede
ser una lista, lo cual no es de gran interés, puesto que estos gráficos 
se utilizan principalmente para comparar distintas muestras, o una matriz,
de manera que sea posible comparar dos o más componentes de una muestra
multivariante. También se permite que <var>data</var> sea una lista de muestras
con posibles tamaños diferentes; de hecho, esta es la única función
del paquete <code>descriptive</code> que admite esta estructura de datos.
</p>
<p>Opciones disponibles:
</p>
<ul>
<li>
<var>box_width</var> (valor por defecto, <code>3/4</code>): ancho relativo de las cajas.
This  value must be in the range <code>[0,1]</code>.

</li><li>
<var>box_orientation</var> (valor por defecto, <code>vertical</code>): valores posibles: <code>vertical</code>
y <code>horizontal</code>.

</li><li>
Todas las opciones globales de <code>draw</code>, excepto <code>points_joined</code>, 
<code>point_size</code>, <code>point_type</code>, <code>xtics</code>, <code>ytics</code>, <code>xrange</code>
y <code>yrange</code>, que se asignan internamente por <code>boxplot</code>. Si es necesario 
que el usuario le dé sus propios valores a estas opciones, o quiere construir 
una escena más compleja, debe hacer uso de <code>boxplot_description</code>.

</li><li>
Las siguientes opciones locales de <code>draw</code>: <code>key</code>, <code>color</code>, 
y <code>line_width</code>.

</li></ul>

<p>La función <code>boxplot_description</code> crea un objeto gráfico
útil para formar escenas complejas, junto con otros objetos gráficos.
Se dispone también de la función <code>wxboxplot</code> para crear
histogramas incorporados en los interfaces wxMaxima y iMaxima.
</p>
<p>Ejemplos:
</p>
<p>Diagrama de cajas de una muestra multivariante.
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s2 : read_matrix(file_search(&quot;wind.data&quot;))$
(%i3) boxplot(s2,
        box_width  = 0.2,
        title      = &quot;Windspeed in knots&quot;,
        xlabel     = &quot;Stations&quot;,
        color      = red,
        line_width = 2)$
</pre>
<p>Diagrama de cajas de tres muestras de tamaños diferentes.
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) A :
       [[6, 4, 6, 2, 4, 8, 6, 4, 6, 4, 3, 2],
        [8, 10, 7, 9, 12, 8, 10],
        [16, 13, 17, 12, 11, 18, 13, 18, 14, 12]]$
(%i3) boxplot (A, box_orientation = horizontal)$
</pre>
</dd></dl>



<dl>
<dt><u>Función:</u> <b>histogram</b><i> (<var>list</var>)</i>
<a name="IDX1688"></a>
</dt>
<dt><u>Función:</u> <b>histogram</b><i> (<var>list</var>, <var>option_1</var>, <var>option_2</var>, &hellip;)</i>
<a name="IDX1689"></a>
</dt>
<dt><u>Función:</u> <b>histogram</b><i> (<var>one_column_matrix</var>)</i>
<a name="IDX1690"></a>
</dt>
<dt><u>Función:</u> <b>histogram</b><i> (<var>one_column_matrix</var>, <var>option_1</var>, <var>option_2</var>, &hellip;)</i>
<a name="IDX1691"></a>
</dt>
<dt><u>Función:</u> <b>histogram</b><i> (<var>one_row_matrix</var>)</i>
<a name="IDX1692"></a>
</dt>
<dt><u>Función:</u> <b>histogram</b><i> (<var>one_row_matrix</var>, <var>option_1</var>, <var>option_2</var>, &hellip;)</i>
<a name="IDX1693"></a>
</dt>
<dt><u>Función:</u> <b>histogram_description</b><i> (&hellip;)</i>
<a name="IDX1694"></a>
</dt>
<dd><p>Dibuja un histograma a partir de una muestra continua. Los datos
muestrales deben darse en forma de lista de números o como una
matriz unidimensional.
</p>
<p>Opciones dispponibles:
</p>
<ul>
<li>
<var>nclasses</var> (valor por defecto, <code>10</code>): número de clases del histograma, o
una lista indicando los límites de las clases y su número,
o solamente los límites.

</li><li>
<var>frequency</var> (valor por defecto, <code>absolute</code>): indica la escala de las ordenadas.
Valores admitidos son:  <code>absolute</code>, <code>relative</code>, <code>percent</code> y <code>density</code>.
Con <code>density</code>, el histograma adquiere un área total igual a uno.

</li><li>
<var>htics</var> (valor por defecto, <code>auto</code>): formato para las marcas sobre el
eje de las abscisas. Valores admitidos son: <code>auto</code>, <code>endpoints</code>, 
<code>intervals</code> o una lista de etiquetas. 

</li><li>
Todas las opciones globales de <code>draw</code>, excepto <code>xrange</code>, <code>yrange</code>
y <code>xtics</code>, que son asignadas internamente por <code>histogram</code>.
Si es necesario que el usuario le dé sus propios valores a estas opciones,
debe hacer uso de <code>histogram_description</code>. Véase el ejemplo más abajo.

</li><li>
Las siguientes opciones locales de <code>draw</code>: <code>key</code>, <code>color</code>, 
<code>fill_color</code>, <code>fill_density</code> y <code>line_width</code>. Véase también
<code>bars</code>.

</li></ul>

<p>La función <code>histogram_description</code> crea un objeto gráfico
útil para formar escenas complejas, junto con otros objetos gráficos.
Se dispone también de la función <code>wxhistogram</code> para crear
histogramas incorporados en los interfaces wxMaxima y iMaxima.
</p>
<p>Ejemplos:
</p>
<p>Un histograma con seis clases:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) histogram (
           s1,
           nclasses     = 8,
           title        = &quot;pi digits&quot;,
           xlabel       = &quot;digits&quot;,
           ylabel       = &quot;Absolute frequency&quot;,
           fill_color   = grey,
           fill_density = 0.6)$
</pre>
<p>Ajustando los límites del histograma a -2 y 12,
con 3 clases. También se establece un formato predefinido a
las marcas del eje de abscisas:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) histogram (
           s1,
           nclasses     = [-2,12,3],
           htics        = [&quot;A&quot;, &quot;B&quot;, &quot;C&quot;],
           terminal     = png,
           fill_color   = &quot;#23afa0&quot;,
           fill_density = 0.6)$
</pre>
<p>Se hace uso de <code>histogram_description</code> para ajustar
la opción <code>xrange</code> y añadir una curva
explícita a la escena:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) ( load(&quot;distrib&quot;),
        m: 14, s: 2,
        s2: random_normal(m, s, 1000) ) $
(%i3) draw2d(
        grid   = true,
        xrange = [5, 25],
        histogram_description(
          s2,
          nclasses     = 9,
          frequency    = density,
          fill_density = 0.5),
        explicit(pdf_normal(x,m,s), x, m - 3*s, m + 3* s))$
</pre>
</dd></dl>




<dl>
<dt><u>Función:</u> <b>piechart</b><i> (<var>list</var>)</i>
<a name="IDX1695"></a>
</dt>
<dt><u>Función:</u> <b>piechart</b><i> (<var>list</var>, <var>option_1</var>, <var>option_2</var>, &hellip;)</i>
<a name="IDX1696"></a>
</dt>
<dt><u>Función:</u> <b>piechart</b><i> (<var>one_column_matrix</var>)</i>
<a name="IDX1697"></a>
</dt>
<dt><u>Función:</u> <b>piechart</b><i> (<var>one_column_matrix</var>, <var>option_1</var>, <var>option_2</var>, &hellip;)</i>
<a name="IDX1698"></a>
</dt>
<dt><u>Función:</u> <b>piechart</b><i> (<var>one_row_matrix</var>)</i>
<a name="IDX1699"></a>
</dt>
<dt><u>Función:</u> <b>piechart</b><i> (<var>one_row_matrix</var>, <var>option_1</var>, <var>option_2</var>, &hellip;)</i>
<a name="IDX1700"></a>
</dt>
<dt><u>Función:</u> <b>piechart_description</b><i> (&hellip;)</i>
<a name="IDX1701"></a>
</dt>
<dd><p>Similar a <code>barsplot</code>, pero dibuja sectores en lugar de rectángulos.
</p>
<p>Opciones disponibles:
</p>

<ul>
<li>
<var>sector_colors</var> (valor por defecto, <code>[]</code>): una lista de colores para los
sectores. Cuando el número de sectores sea mayor que el de colores especificados, 
los colores adicionales necesarios se seleccionan aleatoriamente. Véase <code>color</code> para más
información.

</li><li>
<var>pie_center</var> (valor por defecto, <code>[0,0]</code>): centro del diagrama

</li><li>
<var>pie_radius</var> (valor por defecto, <code>1</code>): radio del diagrama.

</li><li>
Todas las opciones globales de <code>draw</code>, excepto <code>key</code>, que se asigna
internamente por <code>piechart</code>. Si es necesario que el usuario le dé su propio
valor a esta opción, o quiere construir una escena más compleja,
debe hacer uso de <code>piechart_description</code>.

</li><li>
Las siguientes opciones locales de <code>draw</code>: <code>key</code>, <code>color</code>, 
<code>fill_density</code> y <code>line_width</code>. Véase también
<code>bars</code>.

</li></ul>

<p>La función <code>piechart_description</code> crea un objeto gráfico
útil para formar escenas complejas, junto con otros objetos gráficos.
Se dispone también de la función <code>wxpiechart</code> para crear
histogramas incorporados en los interfaces wxMaxima y iMaxima.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s1 : read_list (file_search (&quot;pidigits.data&quot;))$
(%i3) piechart(
        s1,
        xrange  = [-1.1, 1.3],
        yrange  = [-1.1, 1.1],
        title   = &quot;Digit frequencies in pi&quot;)$
</pre>
<p>Véase también la función <code>barsplot</code>.
</p></dd></dl>



<dl>
<dt><u>Función:</u> <b>scatterplot</b><i> (<var>list</var>)</i>
<a name="IDX1702"></a>
</dt>
<dt><u>Función:</u> <b>scatterplot</b><i> (<var>list</var>, <var>option_1</var>, <var>option_2</var>, &hellip;)</i>
<a name="IDX1703"></a>
</dt>
<dt><u>Función:</u> <b>scatterplot</b><i> (<var>matrix</var>)</i>
<a name="IDX1704"></a>
</dt>
<dt><u>Función:</u> <b>scatterplot</b><i> (<var>matrix</var>, <var>option_1</var>, <var>option_2</var>, &hellip;)</i>
<a name="IDX1705"></a>
</dt>
<dt><u>Función:</u> <b>scatterplot_description</b><i> (&hellip;)</i>
<a name="IDX1706"></a>
</dt>
<dd><p>Dibuja diagramas de dispersión, tanto de muestras univariantes (<var>list</var>)
como multivariantes (<var>matrix</var>). 
</p>
<p>Las opciones disponibles son las mismas que admite <code>histogram</code>.
</p>
<p>La función <code>scatterplot_description</code> crea un objeto gráfico
útil para formar escenas complejas, junto con otros objetos gráficos.
Se dispone también de la función <code>wxscatterplot</code> para crear
histogramas incorporados en los interfaces wxMaxima y iMaxima.
</p>
<p>Ejemplos:
</p>
<p>Diagrama de dispersión univariante a partir de una muestra normal
simulada. 
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load (distrib)$
(%i3) scatterplot(
        random_normal(0,1,200),
        xaxis      = true,
        point_size = 2,
        dimensions = [600,150])$
</pre>
<p>Diagrama de dispersión bidimensional.
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i3) scatterplot(
       submatrix(s2, 1,2,3),
       title      = &quot;Data from stations #4 and #5&quot;,
       point_type = diamant,
       point_size = 2,
       color      = blue)$
</pre>
<p>Diagrama de dispersión tridimensional.
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i3) scatterplot(submatrix (s2, 1,2), nclasses=4)$
</pre>
<p>Diagrama de dispersión de cinco dimensiones, con histogramas de
cinco classes.
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i3) scatterplot(
        s2,
        nclasses     = 5,
        frequency    = relative,
        fill_color   = blue,
        fill_density = 0.3,
        xtics        = 5)$
</pre>
<p>Para dibujar puntos aislados o unidos por segmentos, tanto en dos
como en tres dimensiones, véase <code>points</code>.
Véase también <code>histogram</code>.
</p></dd></dl>



<dl>
<dt><u>Función:</u> <b>starplot</b><i> (<var>data1</var>, <var>data2</var>, &hellip;, <var>option_1</var>, <var>option_2</var>, &hellip;)</i>
<a name="IDX1707"></a>
</dt>
<dt><u>Función:</u> <b>starplot_description</b><i> (&hellip;)</i>
<a name="IDX1708"></a>
</dt>
<dd><p>Dibuja diagramas de estrellas para variables estadísticas
discretas, tanto para una como para más muestras.
</p>
<p><var>data</var> puede ser una lista de resultados provenientes de una muestra
o una matriz de <var>m</var> filas y <var>n</var> columnas, representando <var>n</var> 
muestras de tamaño <var>m</var> cada una.
</p>
<p>Las opciones disponibles son:
</p>
<ul>
<li>
<var>stars_colors</var> (valor por defecto, <code>[]</code>): una lista de colores para muestras
múltiples. Cuando haya más muestras que colores especificados, los colores que faltan
se eligen aleatoriamente. Véase <code>color</code> para más información.

</li><li>
<var>frequency</var> (valor por defecto, <code>absolute</code>): indica la escala de los radios.
Valores admitidos son:  <code>absolute</code> y <code>relative</code>.

</li><li>
<var>ordering</var> (valor por defecto, <code>orderlessp</code>): los valores admitidos para esta 
opción son: <code>orderlessp</code> y <code>ordergreatp</code>, indicando cómo se deben ordenar
los resultados muestrales sobre el eje-<var>x</var>.


</li><li>
<var>sample_keys</var> (valor por defecto, <code>[]</code>): es una lista de cadenas de 
texto a usar como leyendas. Cuando la lista tenga una longitud diferente de cero o 
del número de muestras, se devolverá un mensaje de error.

</li><li>
<var>star_center</var> (valor por defecto, <code>[0,0]</code>): centro del diagrama.

</li><li>
<var>star_radius</var> (valor por defecto, <code>1</code>): radio del diagrama.

</li><li>
Todas las opciones globales de <code>draw</code>, excepto <code>points_joined</code>, <code>point_type</code>, 
and <code>key</code>, que se asignan internamente por <code>starplot</code>. Si es necesario que el 
usuario les dé sus propios valores a estas opciones, o quiere construir una escena más compleja,
debe hacer uso de <code>starplot_description</code>.

</li><li>
La siguiente opción local de <code>draw</code>: <code>line_width</code>.

</li></ul>

<p>La función <code>starplot_description</code> crea un objeto gráfico
útil para formar escenas complejas, junto con otros objetos gráficos.
Se dispone también de la función <code>wxstarplot</code> para crear
histogramas incorporados en los interfaces wxMaxima y iMaxima.
</p>
<p>Ejemplo:
</p>
<p>Gráfico basado en frecuencias absolutas. La localización y
el radios lo define el usuario.
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) l1: makelist(random(10),k,1,50)$
(%i3) l2: makelist(random(10),k,1,200)$
(%i4) starplot(
        l1, l2,
        stars_colors = [blue,red],
        sample_keys = [&quot;1st sample&quot;, &quot;2nd sample&quot;],
        star_center = [1,2],
        star_radius = 4,
        proportional_axes = xy,
        line_width = 2 ) $ 
</pre>
</dd></dl>



<dl>
<dt><u>Función:</u> <b>stemplot</b><i> (<var>m</var>)</i>
<a name="IDX1709"></a>
</dt>
<dt><u>Función:</u> <b>stemplot</b><i> (<var>m</var>, <var>option</var>)</i>
<a name="IDX1710"></a>
</dt>
<dd><p>Dibuja diagrama de tallos y hojas.
</p>
<p>La única opción disponible es:
</p>
<ul>
<li>
<var>leaf_unit</var> (valor por defecto, <code>1</code>): indica la unidad de las hojas; debe ser
una potencia de 10.

</li></ul>

<p>Ejemplo:
</p>
<pre class="example">(%i1) load (descriptive)$
(%i2) load(distrib)$
(%i3) stemplot(
        random_normal(15, 6, 100),
        leaf_unit = 0.1);
-5|4
 0|37
 1|7
 3|6
 4|4
 5|4
 6|57
 7|0149
 8|3
 9|1334588
10|07888
11|01144467789
12|12566889
13|24778
14|047
15|223458
16|4
17|11557
18|000247
19|4467799
20|00
21|1
22|2335
23|01457
24|12356
25|455
27|79
key: 6|3 =  6.3
(%o3)                  done
</pre>
</dd></dl>



<hr size="6">
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC229" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_45.html#SEC234" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_80.html#SEC380" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<p>
 <font size="-1">
  This document was generated by <em>Robert Dodier</em> on <em>abril, 9 2015</em> using <a href="http://texi2html.cvshome.org/"><em>texi2html 1.76</em></a>.
 </font>
 <br>

</p>
</body>
</html>
